#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(nonstandard_style)]
#![allow(unused)]
/* automatically generated by rust-bindgen 0.71.1 */

pub const WIREDTIGER_VERSION_MAJOR: u32 = 12;
pub const WIREDTIGER_VERSION_MINOR: u32 = 0;
pub const WIREDTIGER_VERSION_PATCH: u32 = 0;
pub const WIREDTIGER_VERSION_STRING: &[u8; 31] = b"WiredTiger 12.0.0 (Rust build)\0";
pub const __has_safe_buffers: u32 = 1;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __has_bounds_safety_attributes: u32 = 0;
pub const USE_CLANG_TYPES: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;

pub const WT_STAT_DSRC_REC_TIME_WINDOW_DURABLE_STOP_TS: u32 = 2371;
pub const WT_STAT_DSRC_REC_TIME_WINDOW_STOP_TS: u32 = 2372;
pub const WT_STAT_DSRC_REC_TIME_WINDOW_STOP_TXN: u32 = 2373;
pub const WT_STAT_DSRC_REC_SKIP_WRITE: u32 = 2374;
pub const WT_STAT_DSRC_SESSION_COMPACT: u32 = 2375;
pub const WT_STAT_DSRC_TXN_READ_RACE_PREPARE_COMMIT: u32 = 2376;
pub const WT_STAT_DSRC_TXN_READ_OVERFLOW_REMOVE: u32 = 2377;
pub const WT_STAT_DSRC_TXN_READ_RACE_PREPARE_UPDATE: u32 = 2378;
pub const WT_STAT_DSRC_TXN_RTS_BTREES_APPLIED: u32 = 2379;
pub const WT_STAT_DSRC_TXN_RTS_SWEEP_HS_KEYS_DRYRUN: u32 = 2380;
pub const WT_STAT_DSRC_TXN_RTS_HS_STOP_OLDER_THAN_NEWER_START: u32 = 2381;
pub const WT_STAT_DSRC_TXN_RTS_INCONSISTENT_CKPT: u32 = 2382;
pub const WT_STAT_DSRC_TXN_RTS_KEYS_REMOVED: u32 = 2383;
pub const WT_STAT_DSRC_TXN_RTS_KEYS_RESTORED: u32 = 2384;
pub const WT_STAT_DSRC_TXN_RTS_KEYS_REMOVED_DRYRUN: u32 = 2385;
pub const WT_STAT_DSRC_TXN_RTS_KEYS_RESTORED_DRYRUN: u32 = 2386;
pub const WT_STAT_DSRC_TXN_RTS_HS_RESTORE_TOMBSTONES: u32 = 2387;
pub const WT_STAT_DSRC_TXN_RTS_HS_RESTORE_UPDATES: u32 = 2388;
pub const WT_STAT_DSRC_TXN_RTS_BTREES_SKIPPED: u32 = 2389;
pub const WT_STAT_DSRC_TXN_RTS_DELETE_RLE_SKIPPED: u32 = 2390;
pub const WT_STAT_DSRC_TXN_RTS_STABLE_RLE_SKIPPED: u32 = 2391;
pub const WT_STAT_DSRC_TXN_RTS_SWEEP_HS_KEYS: u32 = 2392;
pub const WT_STAT_DSRC_TXN_RTS_HS_RESTORE_TOMBSTONES_DRYRUN: u32 = 2393;
pub const WT_STAT_DSRC_TXN_RTS_HS_RESTORE_UPDATES_DRYRUN: u32 = 2394;
pub const WT_STAT_DSRC_TXN_RTS_HS_REMOVED: u32 = 2395;
pub const WT_STAT_DSRC_TXN_RTS_HS_REMOVED_DRYRUN: u32 = 2396;
pub const WT_STAT_DSRC_TXN_UPDATE_CONFLICT: u32 = 2397;
pub const WT_STAT_SESSION_BYTES_READ: u32 = 4000;
pub const WT_STAT_SESSION_BYTES_WRITE: u32 = 4001;
pub const WT_STAT_SESSION_LOCK_DHANDLE_WAIT: u32 = 4002;
pub const WT_STAT_SESSION_TXN_BYTES_DIRTY: u32 = 4003;
pub const WT_STAT_SESSION_TXN_UPDATES: u32 = 4004;
pub const WT_STAT_SESSION_READ_TIME: u32 = 4005;
pub const WT_STAT_SESSION_WRITE_TIME: u32 = 4006;
pub const WT_STAT_SESSION_LOCK_SCHEMA_WAIT: u32 = 4007;
pub const WT_STAT_SESSION_CACHE_TIME: u32 = 4008;
pub const WT_STAT_SESSION_CACHE_TIME_INTERRUPTIBLE: u32 = 4009;
pub const WT_STAT_SESSION_CACHE_TIME_MANDATORY: u32 = 4010;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_quad_t = u_int64_t;
pub type quad_t = i64;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type daddr_t = i32;
pub type dev_t = __darwin_dev_t;
pub type fixpt_t = u_int32_t;
pub type blkcnt_t = __darwin_blkcnt_t;
pub type blksize_t = __darwin_blksize_t;
pub type gid_t = __darwin_gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type ino_t = __darwin_ino_t;
pub type ino64_t = __darwin_ino64_t;
pub type key_t = __int32_t;
pub type mode_t = __darwin_mode_t;
pub type nlink_t = __uint16_t;
pub type id_t = __darwin_id_t;
pub type pid_t = __darwin_pid_t;
pub type off_t = __darwin_off_t;
pub type segsz_t = i32;
pub type swblk_t = i32;
pub type uid_t = __darwin_uid_t;
pub type clock_t = __darwin_clock_t;
pub type time_t = __darwin_time_t;
pub type useconds_t = __darwin_useconds_t;
pub type suseconds_t = __darwin_suseconds_t;
pub type rsize_t = __darwin_size_t;
pub type errno_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__int32_t; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::fds_bits"][::std::mem::offset_of!(fd_set, fds_bits) - 0usize];
};
unsafe extern "C" {
    pub fn __darwin_check_fd_set_overflow(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type fd_mask = __int32_t;
pub type pthread_attr_t = __darwin_pthread_attr_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_condattr_t = __darwin_pthread_condattr_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_mutexattr_t = __darwin_pthread_mutexattr_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type pthread_rwlockattr_t = __darwin_pthread_rwlockattr_t;
pub type pthread_t = __darwin_pthread_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type fsblkcnt_t = __darwin_fsblkcnt_t;
pub type fsfilcnt_t = __darwin_fsfilcnt_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type wchar_t = __darwin_wchar_t;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
unsafe extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
        arg2: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: usize,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, __len: *mut usize) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Portable type names"]
pub type wt_off_t = i64;
#[doc = " Public forward structure declarations"]
pub type WT_COLLATOR = __wt_collator;
#[doc = " The interface implemented by applications to provide custom compression.\n\n Compressors must implement the WT_COMPRESSOR interface: the\n WT_COMPRESSOR::compress and WT_COMPRESSOR::decompress callbacks must be\n specified, and WT_COMPRESSOR::pre_size is optional.  To build your own\n compressor, use one of the compressors in \\c ext/compressors as a template:\n \\c ext/nop_compress is a simple compressor that passes through data\n unchanged, and is a reasonable starting point.\n\n Applications register their implementation with WiredTiger by calling\n WT_CONNECTION::add_compressor.\n\n @snippet nop_compress.c WT_COMPRESSOR initialization structure\n @snippet nop_compress.c WT_COMPRESSOR initialization function"]
pub type WT_COMPRESSOR = __wt_compressor;
#[doc = " The configuration information returned by the WiredTiger configuration\n parsing functions in the WT_EXTENSION_API and the public API."]
pub type WT_CONFIG_ITEM = __wt_config_item;
#[doc = " A handle that can be used to search and traverse configuration strings\n compatible with the WiredTiger API.\n To parse the contents of a list or nested configuration string use a new\n configuration parser handle based on the content of the ::WT_CONFIG_ITEM\n retrieved from the parent configuration string.\n\n @section config_parse_examples Configuration String Parsing examples\n\n This could be used in C to create a configuration parser as follows:\n\n @snippet ex_config_parse.c Create a configuration parser\n\n Once the parser has been created the content can be queried directly:\n\n @snippet ex_config_parse.c get\n\n Or the content can be traversed linearly:\n\n @snippet ex_config_parse.c next\n\n Nested configuration values can be queried using a shorthand notation:\n\n @snippet ex_config_parse.c nested get\n\n Nested configuration values can be traversed using multiple\n ::WT_CONFIG_PARSER handles:\n\n @snippet ex_config_parse.c nested traverse"]
pub type WT_CONFIG_PARSER = __wt_config_parser;
#[doc = " A connection to a WiredTiger database.  The connection may be opened within\n the same address space as the caller or accessed over a socket connection.\n\n Most applications will open a single connection to a database for each\n process.  The first process to open a connection to a database will access\n the database in its own address space.  Subsequent connections (if allowed)\n will communicate with the first process over a socket connection to perform\n their operations.\n\n <b>Thread safety:</b> A WT_CONNECTION handle may be shared between threads.\n See @ref threads for more information."]
pub type WT_CONNECTION = __wt_connection;
#[doc = " A WT_CURSOR handle is the interface to a cursor.\n\n Cursors allow data to be searched, iterated and modified, implementing the\n CRUD (create, read, update and delete) operations.  Cursors are opened in\n the context of a session.  If a transaction is started, cursors operate in\n the context of the transaction until the transaction is resolved.\n\n Raw data is represented by key/value pairs of WT_ITEM structures, but\n cursors can also provide access to fields within the key and value if the\n formats are described in the WT_SESSION::create method.\n\n In the common case, a cursor is used to access records in a table.  However,\n cursors can be used on subsets of tables (such as a single column or a\n projection of multiple columns), as an interface to statistics, configuration\n data or application-specific data sources.  See WT_SESSION::open_cursor for\n more information.\n\n <b>Thread safety:</b> A WT_CURSOR handle is not usually shared between\n threads. See @ref threads for more information."]
pub type WT_CURSOR = __wt_cursor;
#[doc = " Applications can extend WiredTiger by providing new implementations of the\n WT_DATA_SOURCE class.  Each data source supports a different URI scheme for\n data sources to WT_SESSION::create, WT_SESSION::open_cursor and related\n methods.  See @ref custom_data_sources for more information.\n\n <b>Thread safety:</b> WiredTiger may invoke methods on the WT_DATA_SOURCE\n interface from multiple threads concurrently.  It is the responsibility of\n the implementation to protect any shared data.\n\n Applications register their implementation with WiredTiger by calling\n WT_CONNECTION::add_data_source.\n\n @snippet ex_data_source.c WT_DATA_SOURCE register"]
pub type WT_DATA_SOURCE = __wt_data_source;
#[doc = " The interface implemented by applications to provide custom encryption.\n\n Encryptors must implement the WT_ENCRYPTOR interface: the WT_ENCRYPTOR::encrypt,\n WT_ENCRYPTOR::decrypt and WT_ENCRYPTOR::sizing callbacks must be specified,\n WT_ENCRYPTOR::customize and WT_ENCRYPTOR::terminate are optional.  To build your own\n encryptor, use one of the encryptors in \\c ext/encryptors as a template: \\c\n ext/encryptors/sodium_encrypt uses the open-source libsodium cryptographic library, and\n \\c ext/encryptors/nop_encrypt is a simple template that passes through data unchanged,\n and is a reasonable starting point.  \\c ext/encryptors/rotn_encrypt is an encryptor\n implementing a simple (insecure) rotation cipher meant for testing.  See @ref\n encryption \"the encryptors page\" for further information.\n\n Applications register their implementation with WiredTiger by calling\n WT_CONNECTION::add_encryptor.\n\n @snippet nop_encrypt.c WT_ENCRYPTOR initialization structure\n @snippet nop_encrypt.c WT_ENCRYPTOR initialization function"]
pub type WT_ENCRYPTOR = __wt_encryptor;
#[doc = " The interface implemented by applications to handle error, informational and\n progress messages.  Entries set to NULL are ignored and the default handlers\n will continue to be used."]
pub type WT_EVENT_HANDLER = __wt_event_handler;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_extension_api {
    _unused: [u8; 0],
}
pub type WT_EXTENSION_API = __wt_extension_api;
#[doc = " A file handle implementation returned by WT_FILE_SYSTEM::fs_open_file.\n\n <b>Thread safety:</b> Unless explicitly stated otherwise, WiredTiger may\n invoke methods on the WT_FILE_HANDLE interface from multiple threads\n concurrently. It is the responsibility of the implementation to protect\n any shared data.\n\n See @ref custom_file_systems for more information."]
pub type WT_FILE_HANDLE = __wt_file_handle;
#[doc = " The interface implemented by applications to provide a custom file system\n implementation.\n\n <b>Thread safety:</b> WiredTiger may invoke methods on the WT_FILE_SYSTEM\n interface from multiple threads concurrently. It is the responsibility of\n the implementation to protect any shared data.\n\n Applications register implementations with WiredTiger by calling\n WT_CONNECTION::set_file_system.  See @ref custom_file_systems for more\n information.\n\n @snippet ex_file_system.c WT_FILE_SYSTEM register"]
pub type WT_FILE_SYSTEM = __wt_file_system;
#[doc = " A raw item of data to be managed, including a pointer to the data and a\n length.\n\n WT_ITEM structures do not need to be cleared before use."]
pub type WT_ITEM = __wt_item;
#[doc = " A set of modifications for a value, including a pointer to new data and a\n length, plus a target offset in the value and an optional length of data\n in the value to be replaced.\n\n WT_MODIFY structures do not need to be cleared before use."]
pub type WT_MODIFY = __wt_modify;
#[doc = " The interface implemented by applications to provide a page log service\n implementation.\n\n <b>Thread safety:</b> WiredTiger may invoke methods on the WT_PAGE_LOG\n interface from multiple threads concurrently. It is the responsibility of\n the implementation to protect any shared data.\n\n <b>Reentrancy:</b>Methods on the WT_PAGE_LOG interface are not expected to\n support reentrant use.\n\n Applications register implementations with WiredTiger by calling\n WT_CONNECTION::add_page_log.\n\n @snippet ex_page_log.c WT_PAGE_LOG register"]
pub type WT_PAGE_LOG = __wt_page_log;
#[doc = " Values given to, or returned by the WT_PAGE_LOG_HANDLE::plh_discard interface."]
pub type WT_PAGE_LOG_DISCARD_ARGS = __wt_page_log_discard_args;
#[doc = " FIXME-WT-16821: Remove _ext.\n WT_PAGE_LOG::pl_complete_checkpoint(_ext) interface."]
pub type WT_PAGE_LOG_COMPLETE_CHECKPOINT_ARGS = __wt_page_log_complete_checkpoint_args;
#[doc = " Values given to, or returned by the WT_PAGE_LOG_HANDLE::plh_get interface."]
pub type WT_PAGE_LOG_GET_ARGS = __wt_page_log_get_args;
#[doc = " Values given to, or returned by the WT_PAGE_LOG_HANDLE::plh_put interface."]
pub type WT_PAGE_LOG_PUT_ARGS = __wt_page_log_put_args;
#[doc = " Interface for custom key provider services used by applications.\n\n Applications register implementations using WT_CONNECTION::set_key_provider."]
pub type WT_KEY_PROVIDER = __wt_key_provider;
#[doc = " A structure that represents encrypted keys stored by WiredTiger."]
pub type WT_CRYPT_KEYS = __wt_crypt_keys;
#[doc = " The interface implemented by applications to provide handles used\n by a page log service implementation. This interface is returned by\n WT_PAGE_LOG::pl_open_handle .\n\n <b>Thread safety:</b> WiredTiger may invoke methods on the WT_PAGE_LOG_HANDLES\n interface from multiple threads concurrently. It is the responsibility of\n the implementation to protect any shared data.\n\n <b>Reentrancy:</b>Methods on the WT_PAGE_LOG_HANDLE interface are not expected to\n support reentrant use."]
pub type WT_PAGE_LOG_HANDLE = __wt_page_log_handle;
#[doc = " All data operations are performed in the context of a WT_SESSION.  This\n encapsulates the thread and transactional context of the operation.\n\n <b>Thread safety:</b> A WT_SESSION handle is not usually shared between\n threads, see @ref threads for more information."]
pub type WT_SESSION = __wt_session;
#[doc = " The interface implemented by applications to provide a storage source\n implementation. This documentation refers to \"object\" and \"bucket\"\n to mean a \"file-like object\" and a \"container of objects\", respectively.\n\n <b>Thread safety:</b> WiredTiger may invoke methods on the WT_STORAGE_SOURCE\n interface from multiple threads concurrently. It is the responsibility of\n the implementation to protect any shared data.\n\n Applications register implementations with WiredTiger by calling\n WT_CONNECTION::add_storage_source.\n\n @snippet ex_storage_source.c WT_STORAGE_SOURCE register"]
pub type WT_STORAGE_SOURCE = __wt_storage_source;
#[doc = " A raw item of data to be managed, including a pointer to the data and a\n length.\n\n WT_ITEM structures do not need to be cleared before use."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_item {
    #[doc = " The memory reference of the data item.\n\n For items returned by a WT_CURSOR, the pointer is only valid until\n the next operation on that cursor.  Applications that need to keep\n an item across multiple cursor operations must make a copy."]
    pub data: *const ::std::os::raw::c_void,
    #[doc = " The number of bytes in the data item.\n\n The maximum length of a single column stored in a table is not fixed\n (as it partially depends on the underlying file configuration), but\n is always a small number of bytes less than 4GB."]
    pub size: usize,
    #[doc = " Managed memory chunk (internal use)."]
    pub mem: *mut ::std::os::raw::c_void,
    #[doc = " Managed memory size (internal use)."]
    pub memsize: usize,
    pub flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_item"][::std::mem::size_of::<__wt_item>() - 40usize];
    ["Alignment of __wt_item"][::std::mem::align_of::<__wt_item>() - 8usize];
    ["Offset of field: __wt_item::data"][::std::mem::offset_of!(__wt_item, data) - 0usize];
    ["Offset of field: __wt_item::size"][::std::mem::offset_of!(__wt_item, size) - 8usize];
    ["Offset of field: __wt_item::mem"][::std::mem::offset_of!(__wt_item, mem) - 16usize];
    ["Offset of field: __wt_item::memsize"][::std::mem::offset_of!(__wt_item, memsize) - 24usize];
    ["Offset of field: __wt_item::flags"][::std::mem::offset_of!(__wt_item, flags) - 32usize];
};
#[doc = " A set of modifications for a value, including a pointer to new data and a\n length, plus a target offset in the value and an optional length of data\n in the value to be replaced.\n\n WT_MODIFY structures do not need to be cleared before use."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_modify {
    #[doc = " New data. The size of the new data may be zero when no new data is\n provided."]
    pub data: WT_ITEM,
    #[doc = " The zero-based byte offset in the value where the new data is placed.\n\n If the offset is past the end of the value, padding bytes are\n appended to the value up to the specified offset. If the value is a\n string (value format \\c S), the padding byte is a space. If the value\n is a raw byte array accessed using a WT_ITEM structure (value format\n \\c u), the padding byte is a nul."]
    pub offset: usize,
    #[doc = " The number of bytes in the value to be replaced.\n\n If the size is zero, no bytes from the value are replaced and the new\n data is inserted.\n\n If the offset is past the end of the value, the size is ignored.\n\n If the offset plus the size overlaps the end of the previous value,\n bytes from the offset to the end of the value are replaced and any\n remaining new data is appended."]
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_modify"][::std::mem::size_of::<__wt_modify>() - 56usize];
    ["Alignment of __wt_modify"][::std::mem::align_of::<__wt_modify>() - 8usize];
    ["Offset of field: __wt_modify::data"][::std::mem::offset_of!(__wt_modify, data) - 0usize];
    ["Offset of field: __wt_modify::offset"][::std::mem::offset_of!(__wt_modify, offset) - 40usize];
    ["Offset of field: __wt_modify::size"][::std::mem::offset_of!(__wt_modify, size) - 48usize];
};
#[doc = " A WT_CURSOR handle is the interface to a cursor.\n\n Cursors allow data to be searched, iterated and modified, implementing the\n CRUD (create, read, update and delete) operations.  Cursors are opened in\n the context of a session.  If a transaction is started, cursors operate in\n the context of the transaction until the transaction is resolved.\n\n Raw data is represented by key/value pairs of WT_ITEM structures, but\n cursors can also provide access to fields within the key and value if the\n formats are described in the WT_SESSION::create method.\n\n In the common case, a cursor is used to access records in a table.  However,\n cursors can be used on subsets of tables (such as a single column or a\n projection of multiple columns), as an interface to statistics, configuration\n data or application-specific data sources.  See WT_SESSION::open_cursor for\n more information.\n\n <b>Thread safety:</b> A WT_CURSOR handle is not usually shared between\n threads. See @ref threads for more information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_cursor {
    #[doc = "< The session handle for this cursor."]
    pub session: *mut WT_SESSION,
    #[doc = " The name of the data source for the cursor, matches the \\c uri\n parameter to WT_SESSION::open_cursor used to open the cursor."]
    pub uri: *const ::std::os::raw::c_char,
    #[doc = " The format of the data packed into key items.  See @ref packing for\n details.  If not set, a default value of \"u\" is assumed, and\n applications must use WT_ITEM structures to manipulate untyped byte\n arrays."]
    pub key_format: *const ::std::os::raw::c_char,
    #[doc = " The format of the data packed into value items.  See @ref packing\n for details.  If not set, a default value of \"u\" is assumed, and\n applications must use WT_ITEM structures to manipulate untyped byte\n arrays."]
    pub value_format: *const ::std::os::raw::c_char,
    #[doc = " @name Data access\n @{\n/\n/*!\n Get the key for the current record.\n\n @snippet ex_all.c Get the cursor's string key\n\n @snippet ex_all.c Get the cursor's record number key\n\n @param cursor the cursor handle\n @param ... pointers to hold key fields corresponding to\n WT_CURSOR::key_format.\n The API does not validate the argument types passed in; the caller is\n responsible for passing the correct argument types according to\n WT_CURSOR::key_format.\n @errors"]
    pub get_key: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR, ...) -> ::std::os::raw::c_int,
    >,
    #[doc = " Get the value for the current record.\n\n @snippet ex_all.c Get the cursor's string value\n\n @snippet ex_all.c Get the cursor's raw value\n\n @param cursor the cursor handle\n @param ... pointers to hold value fields corresponding to\n WT_CURSOR::value_format.\n The API does not validate the argument types passed in; the caller is\n responsible for passing the correct argument types according to\n WT_CURSOR::value_format.\n @errors"]
    pub get_value: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR, ...) -> ::std::os::raw::c_int,
    >,
    #[doc = " Get the raw key and value for the current record.\n\n @snippet ex_all.c Get the raw key and value for the current record.\n\n @snippet ex_all.c Set the cursor's record number key\n\n @param cursor the cursor handle\n @param key pointer to an item that will contains the current record's raw key\n @param value pointer to an item that will contains the current record's raw value\n\n The caller can optionally pass in NULL for either key or value to retrieve only\n the other of the key or value.\n\n If an error occurs during this operation, a flag will be set in the\n cursor, and the next operation to access the key will fail.  This\n simplifies error handling in applications.\n @errors"]
    pub get_raw_key_value: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            key: *mut WT_ITEM,
            value: *mut WT_ITEM,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set the key for the next operation.\n\n @snippet ex_all.c Set the cursor's string key\n\n @snippet ex_all.c Set the cursor's record number key\n\n @param cursor the cursor handle\n @param ... key fields corresponding to WT_CURSOR::key_format.\n\n If an error occurs during this operation, a flag will be set in the\n cursor, and the next operation to access the key will fail.  This\n simplifies error handling in applications."]
    pub set_key: ::std::option::Option<unsafe extern "C" fn(cursor: *mut WT_CURSOR, ...)>,
    #[doc = " Set the value for the next operation.\n\n @snippet ex_all.c Set the cursor's string value\n\n @snippet ex_all.c Set the cursor's raw value\n\n @param cursor the cursor handle\n @param ... value fields corresponding to WT_CURSOR::value_format.\n\n If an error occurs during this operation, a flag will be set in the\n cursor, and the next operation to access the value will fail.  This\n simplifies error handling in applications."]
    pub set_value: ::std::option::Option<unsafe extern "C" fn(cursor: *mut WT_CURSOR, ...)>,
    #[doc = " @name Cursor positioning\n @{\n/\n/*!\n Return the ordering relationship between two cursors: both cursors\n must have the same data source and have valid keys. (When testing\n only for equality, WT_CURSOR::equals may be faster.)\n\n @snippet ex_all.c Cursor comparison\n\n @param cursor the cursor handle\n @param other another cursor handle\n @param comparep the status of the comparison: < 0 if\n <code>cursor</code> refers to a key that appears before\n <code>other</code>, 0 if the cursors refer to the same key,\n and > 0 if <code>cursor</code> refers to a key that appears after\n <code>other</code>.\n @errors"]
    pub compare: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            other: *mut WT_CURSOR,
            comparep: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the ordering relationship between two cursors, testing only\n for equality: both cursors must have the same data source and have\n valid keys.\n\n @snippet ex_all.c Cursor equality\n\n @param cursor the cursor handle\n @param other another cursor handle\n @param[out] equalp the status of the comparison: 1 if the cursors\n refer to the same key, otherwise 0.\n @errors"]
    pub equals: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            other: *mut WT_CURSOR,
            equalp: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the next record.\n\n @snippet ex_all.c Return the next record\n\n @param cursor the cursor handle\n @errors"]
    pub next: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the previous record.\n\n @snippet ex_all.c Return the previous record\n\n @param cursor the cursor handle\n @errors"]
    pub prev: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reset the cursor. Any resources held by the cursor are released,\n and the cursor's key and position are no longer valid. Subsequent\n iterations with WT_CURSOR::next will move to the first record, or\n with WT_CURSOR::prev will move to the last record.\n\n In the case of a statistics cursor, resetting the cursor refreshes\n the statistics information returned. Resetting a session statistics\n cursor resets all the session statistics values to zero.\n\n @snippet ex_all.c Reset the cursor\n\n @param cursor the cursor handle\n @errors"]
    pub reset: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the record matching the key. The key must first be set.\n\n @snippet ex_all.c Search for an exact match\n\n On success, the cursor ends positioned at the returned record; to\n minimize cursor resources, the WT_CURSOR::reset method should be\n called as soon as the record has been retrieved and the cursor no\n longer needs that position.\n\n @param cursor the cursor handle\n @errors"]
    pub search: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the record matching the key if it exists, or an adjacent\n record.  An adjacent record is either the smallest record larger\n than the key or the largest record smaller than the key (in other\n words, a logically adjacent key).\n\n The key must first be set.\n\n An example of a search for an exact or adjacent match:\n\n @snippet ex_all.c Search for an exact or adjacent match\n\n An example of a forward scan through the table, where all keys\n greater than or equal to a specified prefix are included in the\n scan:\n\n @snippet ex_all.c Forward scan greater than or equal\n\n An example of a backward scan through the table, where all keys\n less than a specified prefix are included in the scan:\n\n @snippet ex_all.c Backward scan less than\n\n On success, the cursor ends positioned at the returned record; to\n minimize cursor resources, the WT_CURSOR::reset method should be\n called as soon as the record has been retrieved and the cursor no\n longer needs that position.\n\n @param cursor the cursor handle\n @param exactp the status of the search: 0 if an exact match is\n found, < 0 if a smaller key is returned, > 0 if a larger key is\n returned\n @errors"]
    pub search_near: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            exactp: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Data modification\n @{\n/\n/*!\n Insert a record and optionally update an existing record.\n\n If the cursor was configured with \"overwrite=true\" (the default),\n both the key and value must be set; if the record already exists,\n the key's value will be updated, otherwise, the record will be\n inserted.\n\n @snippet ex_all.c Insert a new record or overwrite an existing record\n\n If the cursor was not configured with \"overwrite=true\", both the key\n and value must be set and the record must not already exist; the\n record will be inserted. If the record already exists, the\n ::WT_DUPLICATE_KEY error is returned and the value found in the tree\n can be retrieved using WT_CURSOR::get_value.\n\n @snippet ex_all.c Insert a new record and fail if the record exists\n\n If a cursor with record number keys was configured with\n \"append=true\" (not the default), the value must be set; a new record\n will be appended and the new record number can be retrieved using\n WT_CURSOR::get_key.\n\n @snippet ex_all.c Insert a new record and assign a record number\n\n The cursor ends with no position, and a subsequent call to the\n WT_CURSOR::next (WT_CURSOR::prev) method will iterate from the\n beginning (end) of the table.\n\n If the cursor does not have record number keys or was not configured\n with \"append=true\", the cursor ends with no key set and a subsequent\n call to the WT_CURSOR::get_key method will fail. The cursor ends with\n no value set and a subsequent call to the WT_CURSOR::get_value method\n will fail, except for the ::WT_DUPLICATE_KEY error return, in which\n case the value currently stored for the key can be retrieved.\n\n When loading a large amount of data into a new object, using\n a cursor with the \\c bulk configuration string enabled and\n loading the data in sorted order will be much faster than doing\n out-of-order inserts.  See @ref tune_bulk_load for more information.\n\n The maximum length of a single column stored in a table is not fixed\n (as it partially depends on the underlying file configuration), but\n is always a small number of bytes less than 4GB.\n\n The WT_CURSOR::insert method can only be used at snapshot isolation.\n\n @param cursor the cursor handle\n @errors\n In particular, if \\c overwrite=false is configured and a record with\n the specified key already exists, ::WT_DUPLICATE_KEY is returned.\n Also, if \\c in_memory is configured for the database and the insert\n requires more than the configured cache size to complete,\n ::WT_CACHE_FULL is returned."]
    pub insert: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Modify an existing record. Both the key and value must be set and the record must\n already exist.\n\n Modifications are specified in WT_MODIFY structures. Modifications\n are applied in order and later modifications can update earlier ones.\n\n The modify method is only supported on strings (value format type\n \\c S), or raw byte arrays accessed using a WT_ITEM structure (value\n format type \\c u).\n\n The WT_CURSOR::modify method stores a change record in cache and writes a change record\n to the log instead of the usual complete values. Using WT_CURSOR::modify will result in\n slower reads, and slower writes than the WT_CURSOR::insert or WT_CURSOR::update methods,\n because of the need to assemble the complete value in both the read and write paths. The\n WT_CURSOR::modify method is intended for applications where memory and log amplification\n are issues (in other words, applications where there is cache or I/O pressure and the\n application wants to trade performance for a smaller working set in cache and smaller\n log records).\n\n @snippet ex_all.c Modify an existing record\n\n On success, the cursor ends positioned at the modified record; to\n minimize cursor resources, the WT_CURSOR::reset method should be\n called as soon as the cursor no longer needs that position.\n\n The maximum length of a single column stored in a table is not fixed\n (as it partially depends on the underlying file configuration), but\n is always a small number of bytes less than 4GB.\n\n The WT_CURSOR::modify method can only be used at snapshot isolation.\n\n @param cursor the cursor handle\n @param entries an array of modification data structures\n @param nentries the number of modification data structures\n @errors\n In particular, if \\c in_memory is configured for the database and\n the modify requires more than the configured cache size to complete,\n ::WT_CACHE_FULL is returned."]
    pub modify: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            entries: *mut WT_MODIFY,
            nentries: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Update an existing record and optionally insert a record.\n\n If the cursor was configured with \"overwrite=true\" (the default),\n both the key and value must be set; if the record already exists, the\n key's value will be updated, otherwise, the record will be inserted.\n\n @snippet ex_all.c Update an existing record or insert a new record\n\n If the cursor was not configured with \"overwrite=true\", both the key\n and value must be set and the record must already exist; the\n record will be updated.\n\n @snippet ex_all.c Update an existing record and fail if DNE\n\n On success, the cursor ends positioned at the modified record; to\n minimize cursor resources, the WT_CURSOR::reset method should be\n called as soon as the cursor no longer needs that position. (The\n WT_CURSOR::insert method never keeps a cursor position and may be\n more efficient for that reason.)\n\n The maximum length of a single column stored in a table is not fixed\n (as it partially depends on the underlying file configuration), but\n is always a small number of bytes less than 4GB.\n\n The WT_CURSOR::update method can only be used at snapshot isolation.\n\n @param cursor the cursor handle\n @errors\n In particular, if \\c overwrite=false is configured and no record with\n the specified key exists, ::WT_NOTFOUND is returned.\n Also, if \\c in_memory is configured for the database and the update\n requires more than the configured cache size to complete,\n ::WT_CACHE_FULL is returned."]
    pub update: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Remove a record.\n\n The key must be set; the key's record will be removed if it exists.\n\n @snippet ex_all.c Remove a record\n\n Any cursor position does not change: if the cursor was positioned\n before the WT_CURSOR::remove call, the cursor remains positioned\n at the removed record; to minimize cursor resources, the\n WT_CURSOR::reset method should be called as soon as the cursor no\n longer needs that position. If the cursor was not positioned before\n the WT_CURSOR::remove call, the cursor ends with no position, and a\n subsequent call to the WT_CURSOR::next (WT_CURSOR::prev) method will\n iterate from the beginning (end) of the table.\n\n @snippet ex_all.c Remove a record and fail if DNE\n\n The WT_CURSOR::remove method can only be used at snapshot isolation.\n\n @param cursor the cursor handle\n @errors"]
    pub remove: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reserve an existing record so a subsequent write is less likely to\n fail due to a conflict between concurrent operations.\n\n The key must first be set and the record must already exist.\n\n Note that reserve works by doing a special update operation that is\n not logged and does not change the value of the record. This update\n is aborted when the enclosing transaction ends regardless of whether\n it commits or rolls back. Given that, reserve can only be used to\n detect conflicts between transactions that execute concurrently. It\n cannot detect all logical conflicts between transactions. For that,\n some update to the record must be committed.\n\n @snippet ex_all.c Reserve a record\n\n On success, the cursor ends positioned at the specified record; to\n minimize cursor resources, the WT_CURSOR::reset method should be\n called as soon as the cursor no longer needs that position.\n\n @param cursor the cursor handle\n @errors"]
    pub reserve: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " If the cursor is opened on a checkpoint, return a unique identifier for the checkpoint;\n otherwise return 0.\n\n This allows applications to confirm that checkpoint cursors opened on default checkpoints\n in different objects reference the same database checkpoint.\n\n @param cursor the cursor handle\n @errors"]
    pub checkpoint_id: ::std::option::Option<unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> u64>,
    #[doc = " Close the cursor.\n\n This releases the resources associated with the cursor handle.\n Cursors are closed implicitly by ending the enclosing connection or\n closing the session in which they were opened.\n\n @snippet ex_all.c Close the cursor\n\n @param cursor the cursor handle\n @errors"]
    pub close: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Get the table's largest key, ignoring visibility. This method is only supported by\n file: or table: objects. The cursor ends with no position.\n\n @snippet ex_all.c Get the table's largest key\n\n @param cursor the cursor handle\n @errors"]
    pub largest_key: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut WT_CURSOR) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reconfigure the cursor.\n\n The cursor is reset.\n\n @snippet ex_all.c Reconfigure a cursor\n\n @param cursor the cursor handle\n @configstart{WT_CURSOR.reconfigure, see dist/api_data.py}\n @config{append, append written values as new records\\, giving each a new record number key;\n valid only for cursors with record number keys., a boolean flag; default \\c false.}\n @config{overwrite, configures whether the cursor's insert and update methods check the\n existing state of the record.  If \\c overwrite is \\c false\\, WT_CURSOR::insert fails with\n ::WT_DUPLICATE_KEY if the record exists\\, and WT_CURSOR::update fails with ::WT_NOTFOUND if\n the record does not exist., a boolean flag; default \\c true.}\n @configend\n @errors"]
    pub reconfigure: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set range bounds on the cursor.\n\n @param cursor the cursor handle\n @configstart{WT_CURSOR.bound, see dist/api_data.py}\n @config{action, configures whether this call into the API will set or clear range bounds on\n the given cursor.  It takes one of two values\\, \"set\" or \"clear\". If \"set\" is specified then\n \"bound\" must also be specified.  The keys relevant to the given bound must have been set\n prior to the call using WT_CURSOR::set_key., a string\\, chosen from the following options: \\c\n \"clear\"\\, \\c \"set\"; default \\c set.}\n @config{bound, configures which bound is being operated on.  It takes one of two values\\,\n \"lower\" or \"upper\"., a string\\, chosen from the following options: \\c \"lower\"\\, \\c \"upper\";\n default empty.}\n @config{inclusive, configures whether the given bound is inclusive or not., a boolean flag;\n default \\c true.}\n @configend\n @errors"]
    pub bound: ::std::option::Option<
        unsafe extern "C" fn(
            cursor: *mut WT_CURSOR,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_cursor"][::std::mem::size_of::<__wt_cursor>() - 208usize];
    ["Alignment of __wt_cursor"][::std::mem::align_of::<__wt_cursor>() - 8usize];
    ["Offset of field: __wt_cursor::session"]
        [::std::mem::offset_of!(__wt_cursor, session) - 0usize];
    ["Offset of field: __wt_cursor::uri"][::std::mem::offset_of!(__wt_cursor, uri) - 8usize];
    ["Offset of field: __wt_cursor::key_format"]
        [::std::mem::offset_of!(__wt_cursor, key_format) - 16usize];
    ["Offset of field: __wt_cursor::value_format"]
        [::std::mem::offset_of!(__wt_cursor, value_format) - 24usize];
    ["Offset of field: __wt_cursor::get_key"]
        [::std::mem::offset_of!(__wt_cursor, get_key) - 32usize];
    ["Offset of field: __wt_cursor::get_value"]
        [::std::mem::offset_of!(__wt_cursor, get_value) - 40usize];
    ["Offset of field: __wt_cursor::get_raw_key_value"]
        [::std::mem::offset_of!(__wt_cursor, get_raw_key_value) - 48usize];
    ["Offset of field: __wt_cursor::set_key"]
        [::std::mem::offset_of!(__wt_cursor, set_key) - 56usize];
    ["Offset of field: __wt_cursor::set_value"]
        [::std::mem::offset_of!(__wt_cursor, set_value) - 64usize];
    ["Offset of field: __wt_cursor::compare"]
        [::std::mem::offset_of!(__wt_cursor, compare) - 72usize];
    ["Offset of field: __wt_cursor::equals"][::std::mem::offset_of!(__wt_cursor, equals) - 80usize];
    ["Offset of field: __wt_cursor::next"][::std::mem::offset_of!(__wt_cursor, next) - 88usize];
    ["Offset of field: __wt_cursor::prev"][::std::mem::offset_of!(__wt_cursor, prev) - 96usize];
    ["Offset of field: __wt_cursor::reset"][::std::mem::offset_of!(__wt_cursor, reset) - 104usize];
    ["Offset of field: __wt_cursor::search"]
        [::std::mem::offset_of!(__wt_cursor, search) - 112usize];
    ["Offset of field: __wt_cursor::search_near"]
        [::std::mem::offset_of!(__wt_cursor, search_near) - 120usize];
    ["Offset of field: __wt_cursor::insert"]
        [::std::mem::offset_of!(__wt_cursor, insert) - 128usize];
    ["Offset of field: __wt_cursor::modify"]
        [::std::mem::offset_of!(__wt_cursor, modify) - 136usize];
    ["Offset of field: __wt_cursor::update"]
        [::std::mem::offset_of!(__wt_cursor, update) - 144usize];
    ["Offset of field: __wt_cursor::remove"]
        [::std::mem::offset_of!(__wt_cursor, remove) - 152usize];
    ["Offset of field: __wt_cursor::reserve"]
        [::std::mem::offset_of!(__wt_cursor, reserve) - 160usize];
    ["Offset of field: __wt_cursor::checkpoint_id"]
        [::std::mem::offset_of!(__wt_cursor, checkpoint_id) - 168usize];
    ["Offset of field: __wt_cursor::close"][::std::mem::offset_of!(__wt_cursor, close) - 176usize];
    ["Offset of field: __wt_cursor::largest_key"]
        [::std::mem::offset_of!(__wt_cursor, largest_key) - 184usize];
    ["Offset of field: __wt_cursor::reconfigure"]
        [::std::mem::offset_of!(__wt_cursor, reconfigure) - 192usize];
    ["Offset of field: __wt_cursor::bound"][::std::mem::offset_of!(__wt_cursor, bound) - 200usize];
};
#[doc = "< Commit timestamp."]
pub const WT_TS_TXN_TYPE_WT_TS_TXN_TYPE_COMMIT: WT_TS_TXN_TYPE = 0;
#[doc = "< Durable timestamp."]
pub const WT_TS_TXN_TYPE_WT_TS_TXN_TYPE_DURABLE: WT_TS_TXN_TYPE = 1;
#[doc = "< Prepare timestamp."]
pub const WT_TS_TXN_TYPE_WT_TS_TXN_TYPE_PREPARE: WT_TS_TXN_TYPE = 2;
#[doc = "< Read timestamp."]
pub const WT_TS_TXN_TYPE_WT_TS_TXN_TYPE_READ: WT_TS_TXN_TYPE = 3;
#[doc = "< Rollback timestamp."]
pub const WT_TS_TXN_TYPE_WT_TS_TXN_TYPE_ROLLBACK: WT_TS_TXN_TYPE = 4;
#[doc = " WT_SESSION::timestamp_transaction_uint timestamp types"]
pub type WT_TS_TXN_TYPE = ::std::os::raw::c_uint;
#[doc = " All data operations are performed in the context of a WT_SESSION.  This\n encapsulates the thread and transactional context of the operation.\n\n <b>Thread safety:</b> A WT_SESSION handle is not usually shared between\n threads, see @ref threads for more information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_session {
    #[doc = " The connection for this session."]
    pub connection: *mut WT_CONNECTION,
    #[doc = " A location for applications to store information that will be\n available in callbacks taking a WT_SESSION handle."]
    pub app_private: *mut ::std::os::raw::c_void,
    #[doc = " Close the session handle.\n\n This will release the resources associated with the session handle,\n including rolling back any active transactions and closing any\n cursors that remain open in the session.\n\n @snippet ex_all.c Close a session\n\n @param session the session handle\n @configempty{WT_SESSION.close, see dist/api_data.py}\n @errors"]
    pub close: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reconfigure a session handle.\n\n Only configurations listed in the method arguments are modified, other configurations\n remain in their current state. This method additionally resets the cursors associated\n with the session. Transaction-related configurations can only be modified when no transaction\n is active.\n\n @snippet ex_all.c Reconfigure a session\n\n @param session the session handle\n @configstart{WT_SESSION.reconfigure, see dist/api_data.py}\n @config{cache_cursors, enable caching of cursors for reuse.  Any calls to WT_CURSOR::close\n for a cursor created in this session will mark the cursor as cached and keep it available to\n be reused for later calls to WT_SESSION::open_cursor.  Cached cursors may be eventually\n closed.  This value is inherited from ::wiredtiger_open \\c cache_cursors., a boolean flag;\n default \\c true.}\n @config{cache_max_wait_ms, the maximum number of milliseconds an application thread will wait\n for space to be available in cache before giving up.  Default value will be the global\n setting of the connection config.  0 will wait forever.  1 will never wait., an integer\n greater than or equal to \\c 0; default \\c 0.}\n @config{debug = (, configure debug specific behavior on a session.  Generally only used for\n internal testing purposes., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;checkpoint_fail_before_turtle_update, Fail before writing a\n turtle file at the end of a checkpoint., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;release_evict_page, Configure the session to evict the page\n when it is released and no longer needed., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{ignore_cache_size, when set\\, operations performed by this session ignore the cache\n size and are not blocked when the cache is full.  Note that use of this option for operations\n that create cache pressure can starve ordinary sessions that obey the cache size., a boolean\n flag; default \\c false.}\n @config{isolation, the default isolation level for operations in this session., a string\\,\n chosen from the following options: \\c \"read-uncommitted\"\\, \\c \"read-committed\"\\, \\c\n \"snapshot\"; default \\c snapshot.}\n @config{prefetch = (, Enable automatic detection of scans by applications\\, and attempt to\n pre-fetch future content into the cache., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, whether pre-fetch is enabled for this\n session., a boolean flag; default \\c false.}\n @config{ ),,}\n @configend\n @errors"]
    pub reconfigure: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return information about an error as a string.\n\n @snippet ex_all.c Display an error thread safe\n\n @param session the session handle\n @param error a return value from a WiredTiger, ISO C, or POSIX\n standard API call\n @returns a string representation of the error"]
    pub strerror: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            error: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Open a new cursor on a data source or duplicate an existing cursor.\n\n @snippet ex_all.c Open a cursor\n\n An existing cursor can be duplicated by passing it as the \\c to_dup\n parameter and setting the \\c uri parameter to \\c NULL:\n\n @snippet ex_all.c Duplicate a cursor\n\n Cursors being duplicated must have a key set, and successfully\n duplicated cursors are positioned at the same place in the data\n source as the original.\n\n Cursor handles should be discarded by calling WT_CURSOR::close.\n\n Cursors capable of supporting transactional operations operate in the\n context of the current transaction, if any.\n\n WT_SESSION::rollback_transaction implicitly resets all cursors associated with the\n session.\n\n Cursors are relatively light-weight objects but may hold references\n to heavier-weight objects; applications should re-use cursors when\n possible, but instantiating new cursors is not so expensive that\n applications need to cache cursors at all cost.\n\n @param session the session handle\n @param uri the data source on which the cursor operates; cursors\n  are usually opened on tables, however, cursors can be opened on\n  any data source, regardless of whether it is ultimately stored\n  in a table.  Some cursor types may have limited functionality\n  (for example, they may be read-only or not support transactional\n  updates).  See @ref data_sources for more information.\n  <br>\n  @copydoc doc_cursor_types\n @param to_dup a cursor to duplicate or gather statistics on\n @configstart{WT_SESSION.open_cursor, see dist/api_data.py}\n @config{append, append written values as new records\\, giving each a new record number key;\n valid only for cursors with record number keys., a boolean flag; default \\c false.}\n @config{bulk, configure the cursor for bulk-loading\\, a fast\\, initial load path (see @ref\n tune_bulk_load for more information). Bulk-load may only be used for newly created objects\n and applications should use the WT_CURSOR::insert method to insert rows.  When bulk-loading\\,\n rows must be loaded in sorted order., a string; default \\c false.}\n @config{checkpoint, the name of a checkpoint to open.  (The reserved name\n \"WiredTigerCheckpoint\" opens the most recent checkpoint taken for the object.) The cursor\n does not support data modification., a string; default empty.}\n @config{debug = (, configure debug specific behavior on a cursor.  Generally only used for\n internal testing purposes., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;dump_version = (, open a version cursor\\, which is a debug\n cursor on a table that enables iteration through the history of values for all the keys., a\n set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n ),,}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;release_evict, Configure the cursor to evict the page\n positioned on when the reset API call is used., a boolean flag; default \\c false.}\n @config{\n ),,}\n @config{dump, configure the cursor for dump format inputs and outputs: \"hex\" selects a simple\n hexadecimal format\\, \"json\" selects a JSON format with each record formatted as fields named\n by column names if available\\, \"pretty\" selects a human-readable format (making it\n incompatible with the \"load\")\\, \"pretty_hex\" is similar to \"pretty\" (also incompatible with\n \"load\") except raw byte data elements will be printed like \"hex\" format\\, and \"print\" selects\n a format where only non-printing characters are hexadecimal encoded.  These formats are\n compatible with the @ref util_dump and @ref util_load commands., a string\\, chosen from the\n following options: \\c \"hex\"\\, \\c \"json\"\\, \\c \"pretty\"\\, \\c \"pretty_hex\"\\, \\c \"print\"; default\n empty.}\n @config{incremental = (, configure the cursor for block incremental backup usage.  These\n formats are only compatible with the backup data source; see @ref backup., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;consolidate,\n causes block incremental backup information to be consolidated if adjacent granularity blocks\n are modified.  If false\\, information will be returned in granularity sized blocks only.\n This must be set on the primary backup cursor and it applies to all files for this backup., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, whether to\n configure this backup as the starting point for a subsequent incremental backup., a boolean\n flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;file, the file name when opening a\n duplicate incremental backup cursor.  That duplicate cursor will return the block\n modifications relevant to the given file name., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;force_stop, causes all block incremental backup information\n to be released.  This is on an open_cursor call and the resources will be released when this\n cursor is closed.  No other operations should be done on this open cursor., a boolean flag;\n default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;granularity, this setting manages the\n granularity of how WiredTiger maintains modification maps internally.  The larger the\n granularity\\, the smaller amount of information WiredTiger need to maintain., an integer\n between \\c 4KB and \\c 2GB; default \\c 16MB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;src_id, a string\n that identifies a previous checkpoint backup source as the source of this incremental backup.\n This identifier must have already been created by use of the 'this_id' configuration in an\n earlier backup.  A source id is required to begin an incremental backup., a string; default\n empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;this_id, a string that identifies the current system\n state as a future backup source for an incremental backup via \\c src_id.  This identifier is\n required when opening an incremental backup cursor and an error will be returned if one is\n not provided.  The identifiers can be any text string\\, but should be unique., a string;\n default empty.}\n @config{ ),,}\n @config{next_random, configure the cursor to return a pseudo-random record from the object\n when the WT_CURSOR::next method is called; valid only for row-store cursors.  See @ref\n cursor_random for details., a boolean flag; default \\c false.}\n @config{next_random_sample_size, cursors configured by \\c next_random to return pseudo-random\n records from the object randomly select from the entire object\\, by default.  Setting \\c\n next_random_sample_size to a non-zero value sets the number of samples the application\n expects to take using the \\c next_random cursor.  A cursor configured with both \\c\n next_random and \\c next_random_sample_size attempts to divide the object into \\c\n next_random_sample_size equal-sized pieces\\, and each retrieval returns a record from one of\n those pieces.  See @ref cursor_random for details., a string; default \\c 0.}\n @config{next_random_seed, configure the cursor to set an initial random seed when using \\c\n next_random configuration.  This is used for testing purposes only.  See @ref cursor_random\n for details., a string; default \\c 0.}\n @config{overwrite, configures whether the cursor's insert and update methods check the\n existing state of the record.  If \\c overwrite is \\c false\\, WT_CURSOR::insert fails with\n ::WT_DUPLICATE_KEY if the record exists\\, and WT_CURSOR::update fails with ::WT_NOTFOUND if\n the record does not exist., a boolean flag; default \\c true.}\n @config{raw, ignore the encodings for the key and value\\, manage data as if the formats were\n \\c \"u\". See @ref cursor_raw for details., a boolean flag; default \\c false.}\n @config{read_once, results that are brought into cache from disk by this cursor will be given\n less priority in the cache., a boolean flag; default \\c false.}\n @config{readonly, only query operations are supported by this cursor.  An error is returned\n if a modification is attempted using the cursor.  The default is false for all cursor types\n except for metadata cursors and checkpoint cursors., a boolean flag; default \\c false.}\n @config{statistics, Specify the statistics to be gathered.  Choosing \"all\" gathers statistics\n regardless of cost and may include traversing on-disk files; \"fast\" gathers a subset of\n relatively inexpensive statistics.  The selection must agree with the database \\c statistics\n configuration specified to ::wiredtiger_open or WT_CONNECTION::reconfigure.  For example\\,\n \"all\" or \"fast\" can be configured when the database is configured with \"all\"\\, but the cursor\n open will fail if \"all\" is specified when the database is configured with \"fast\"\\, and the\n cursor open will fail in all cases when the database is configured with \"none\". If \"size\" is\n configured\\, only the underlying size of the object on disk is filled in and the object is\n not opened.  If \\c statistics is not configured\\, the default configuration is the database\n configuration.  The \"clear\" configuration resets statistics after gathering them\\, where\n appropriate (for example\\, a cache size statistic is not cleared\\, while the count of cursor\n insert operations will be cleared). See @ref statistics for more information., a list\\, with\n values chosen from the following options: \\c \"all\"\\, \\c \"cache_walk\"\\, \\c \"fast\"\\, \\c\n \"clear\"\\, \\c \"size\"\\, \\c \"tree_walk\"; default empty.}\n @config{target, if non-empty\\, back up the given list of objects; valid only for a backup\n data source., a list of strings; default empty.}\n @configend\n @param[out] cursorp a pointer to the newly opened cursor\n @errors"]
    pub open_cursor: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            to_dup: *mut WT_CURSOR,
            config: *const ::std::os::raw::c_char,
            cursorp: *mut *mut WT_CURSOR,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Table operations\n @{\n/\n/*!\n Alter a table.\n\n This will allow modification of some table settings after creation. Although the alter\n operation is non-transactional, if it fails, it will force the current transaction to\n roll back to avoid potential disruption to the data written by the transaction.\n\n @exclusive\n\n @snippet ex_all.c Alter a table\n\n @param session the session handle\n @param name the URI of the object to alter, such as \\c \"table:stock\"\n @configstart{WT_SESSION.alter, see dist/api_data.py}\n @config{access_pattern_hint, It is recommended that workloads that consist primarily of\n updates and/or point queries specify \\c random.  Workloads that do many cursor scans through\n large ranges of data should specify \\c sequential and other workloads should specify \\c none.\n The option leads to an appropriate operating system advisory call where available., a\n string\\, chosen from the following options: \\c \"none\"\\, \\c \"random\"\\, \\c \"sequential\";\n default \\c none.}\n @config{app_metadata, application-owned metadata for this object., a string; default empty.}\n @config{assert = (, declare timestamp usage., a set of related configuration options defined\n as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;read_timestamp, if set\\, check that timestamps\n are \\c always or \\c never used on reads with this table\\, writing an error message if the\n policy is violated.  If the library was built in diagnostic mode\\, drop core at the failing\n check., a string\\, chosen from the following options: \\c \"always\"\\, \\c \"never\"\\, \\c \"none\";\n default \\c none.}\n @config{ ),,}\n @config{cache_resident, do not ever evict the object's pages from cache\\, see @ref\n tuning_cache_resident for more information., a boolean flag; default \\c false.}\n @config{log = (, the transaction log configuration for this object.  Only valid if \\c log is\n enabled in ::wiredtiger_open., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, if false\\, this object has checkpoint-level\n durability.  Not supported for layered tables., a boolean flag; default \\c true.}\n @config{\n ),,}\n @config{os_cache_dirty_max, maximum dirty system buffer cache usage\\, in bytes.  If\n non-zero\\, schedule writes for dirty blocks belonging to this object in the system buffer\n cache after that many bytes from this object are written into the buffer cache., an integer\n greater than or equal to \\c 0; default \\c 0.}\n @config{os_cache_max, maximum system buffer cache usage\\, in bytes.  If non-zero\\, evict\n object blocks from the system buffer cache after that many bytes from this object are read or\n written into the buffer cache., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{write_timestamp_usage, describe how timestamps are expected to be used on table\n modifications.  The choices are the default\\, which ensures that once timestamps are used for\n a key\\, they are always used\\, and also that multiple updates to a key never use decreasing\n timestamps and \\c never which enforces that timestamps are never used for a table.  (The \\c\n always\\, \\c key_consistent\\, \\c mixed_mode and \\c ordered choices should not be used\\, and\n are retained for backward compatibility.)., a string\\, chosen from the following options: \\c\n \"always\"\\, \\c \"key_consistent\"\\, \\c \"mixed_mode\"\\, \\c \"never\"\\, \\c \"none\"\\, \\c \"ordered\";\n default \\c none.}\n @configend\n @ebusy_errors"]
    pub alter: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Bind values for a compiled configuration.  The bindings hold for API calls in this\n session that use the compiled string.  Strings passed into this call are not duplicated,\n the application must ensure that strings remain valid while the bindings are being\n used.\n\n This API may change in future releases.\n\n @param session the session handle\n @param compiled a string returned from WT_CONNECTION::compile_configuration\n @errors"]
    pub bind_configuration: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            compiled: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Create a table, column group, index or file.\n\n @not_transactional\n\n @snippet ex_all.c Create a table\n\n @param session the session handle\n @param name the URI of the object to create, such as\n \\c \"table:stock\". For a description of URI formats\n see @ref data_sources.\n @configstart{WT_SESSION.create, see dist/api_data.py}\n @config{access_pattern_hint, It is recommended that workloads that consist primarily of\n updates and/or point queries specify \\c random.  Workloads that do many cursor scans through\n large ranges of data should specify \\c sequential and other workloads should specify \\c none.\n The option leads to an appropriate operating system advisory call where available., a\n string\\, chosen from the following options: \\c \"none\"\\, \\c \"random\"\\, \\c \"sequential\";\n default \\c none.}\n @config{allocation_size, the file unit allocation size\\, in bytes\\, must be a power of two;\n smaller values decrease the file space required by overflow items\\, and the default value of\n 4KB is a good choice absent requirements from the operating system or storage device., an\n integer between \\c 512B and \\c 128MB; default \\c 4KB.}\n @config{app_metadata, application-owned metadata for this object., a string; default empty.}\n @config{assert = (, declare timestamp usage., a set of related configuration options defined\n as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;read_timestamp, if set\\, check that timestamps\n are \\c always or \\c never used on reads with this table\\, writing an error message if the\n policy is violated.  If the library was built in diagnostic mode\\, drop core at the failing\n check., a string\\, chosen from the following options: \\c \"always\"\\, \\c \"never\"\\, \\c \"none\";\n default \\c none.}\n @config{ ),,}\n @config{block_allocation, configure block allocation.  Permitted values are \\c \"best\" or \\c\n \"first\"; the \\c \"best\" configuration uses a best-fit algorithm\\, the \\c \"first\" configuration\n uses a first-available algorithm during block allocation., a string\\, chosen from the\n following options: \\c \"best\"\\, \\c \"first\"; default \\c best.}\n @config{block_compressor, configure a compressor for file blocks.  Permitted values are \\c\n \"none\" or a custom compression engine name created with WT_CONNECTION::add_compressor.  If\n WiredTiger has builtin support for \\c \"lz4\"\\, \\c \"snappy\"\\, \\c \"zlib\" or \\c \"zstd\"\n compression\\, these names are also available.  See @ref compression for more information., a\n string; default \\c none.}\n @config{block_manager, configure a manager for file blocks.  Permitted values are \\c\n \"default\" or the disaggregated storage block manager backed by \\c PALI., a string\\, chosen\n from the following options: \\c \"default\"\\, \\c \"disagg\"; default \\c default.}\n @config{cache_resident, do not ever evict the object's pages from cache\\, see @ref\n tuning_cache_resident for more information., a boolean flag; default \\c false.}\n @config{checksum, configure block checksums; the permitted values are \\c on\\, \\c off\\, \\c\n uncompressed and \\c unencrypted.  The default is \\c on\\, in which case all block writes\n include a checksum subsequently verified when the block is read.  The \\c off setting does no\n checksums\\, the \\c uncompressed setting only checksums blocks that are not compressed\\, and\n the \\c unencrypted setting only checksums blocks that are not encrypted.  See @ref\n tune_checksum for more information., a string\\, chosen from the following options: \\c \"on\"\\,\n \\c \"off\"\\, \\c \"uncompressed\"\\, \\c \"unencrypted\"; default \\c on.}\n @config{colgroups, comma-separated list of names of column groups.  Each column group is\n stored separately\\, keyed by the primary key of the table.  If no column groups are\n specified\\, all columns are stored together in a single file.  All value columns in the table\n must appear in at least one column group.  Each column group must be created with a separate\n call to WT_SESSION::create using a \\c colgroup: URI., a list of strings; default empty.}\n @config{collator, configure custom collation for keys.  Permitted values are \\c \"none\" or a\n custom collator name created with WT_CONNECTION::add_collator., a string; default \\c none.}\n @config{columns, list of the column names.  Comma-separated list of the form\n <code>(column[\\,...])</code>. For tables\\, the number of entries must match the total number\n of values in \\c key_format and \\c value_format.  For colgroups and indices\\, all column names\n must appear in the list of columns for the table., a list of strings; default empty.}\n @config{dictionary, the maximum number of unique values remembered in the\n row-store/variable-length column-store leaf page value dictionary; see @ref\n file_formats_compression for more information., an integer greater than or equal to \\c 0;\n default \\c 0.}\n @config{disaggregated = (, configure disaggregated storage for this file., a set of related\n configuration options defined as follows.}\n @config{ ),,}\n @config{encryption = (, configure an encryptor for file blocks.  When a table is created\\,\n its encryptor is not implicitly used for any related indices or column groups., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;keyid, An\n identifier that identifies a unique instance of the encryptor.  It is stored in clear text\\,\n and thus is available when the WiredTiger database is reopened.  On the first use of a\n (name\\, keyid) combination\\, the WT_ENCRYPTOR::customize function is called with the keyid as\n an argument., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;name, Permitted\n values are \\c \"none\" or a custom encryption engine name created with\n WT_CONNECTION::add_encryptor.  See @ref encryption for more information., a string; default\n \\c none.}\n @config{ ),,}\n @config{exclusive, explicitly fail with EEXIST if the object exists.  When false (the\n default)\\, if the object exists\\, silently fail without creating a new object., a boolean\n flag; default \\c false.}\n @config{format, the file format., a string\\, chosen from the following options: \\c \"btree\";\n default \\c btree.}\n @config{ignore_in_memory_cache_size, allow update and insert operations to proceed even if\n the cache is already at capacity.  Only valid in conjunction with in-memory databases.\n Should be used with caution - this configuration allows WiredTiger to consume memory over the\n configured cache limit., a boolean flag; default \\c false.}\n @config{immutable, configure the index to be immutable -- that is\\, the index is not changed\n by any update to a record in the table., a boolean flag; default \\c false.}\n @config{import = (, configure import of an existing object into the currently running\n database., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;compare_timestamp, allow importing files with timestamps\n smaller or equal to the configured global timestamps.  Note the history of the files are not\n imported together and thus snapshot read of historical data will not work with the option\n \"stable_timestamp\". (The \\c oldest and \\c stable arguments are deprecated short-hand for \\c\n oldest_timestamp and \\c stable_timestamp\\, respectively)., a string\\, chosen from the\n following options: \\c \"oldest\"\\, \\c \"oldest_timestamp\"\\, \\c \"stable\"\\, \\c \"stable_timestamp\";\n default \\c oldest_timestamp.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, whether to import the\n input URI from disk., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n file_metadata, the file configuration extracted from the metadata of the export database., a\n string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;metadata_file, a text file that\n contains all the relevant metadata information for the URI to import.  The file is generated\n by backup:export cursor., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n panic_corrupt, whether to panic if the metadata given is no longer valid for the table.  Not\n valid with \\c repair=true., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;repair, whether to reconstruct the metadata from the raw file\n content., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{internal_key_max, This option is no longer supported\\, retained for backward\n compatibility., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{internal_key_truncate, configure internal key truncation\\, discarding unnecessary\n trailing bytes on internal keys (ignored for custom collators)., a boolean flag; default \\c\n true.}\n @config{internal_page_max, the maximum page size for internal nodes\\, in bytes; the size must\n be a multiple of the allocation size and is significant for applications wanting to avoid\n excessive L2 cache misses while searching the tree.  The page maximum is the bytes of\n uncompressed data\\, that is\\, the limit is applied before any block compression is done., an\n integer between \\c 512B and \\c 512MB; default \\c 4KB.}\n @config{key_format, the format of the data packed into key items.  See @ref\n schema_format_types for details.  By default\\, the key_format is \\c 'u' and applications use\n WT_ITEM structures to manipulate raw byte arrays.  By default\\, records are stored in\n row-store files: keys of type \\c 'r' are record numbers and records referenced by record\n number are stored in column-store files., a format string; default \\c u.}\n @config{key_gap, This option is no longer supported\\, retained for backward compatibility.,\n an integer greater than or equal to \\c 0; default \\c 10.}\n @config{leaf_key_max, the largest key stored in a leaf node\\, in bytes.  If set\\, keys larger\n than the specified size are stored as overflow items (which may require additional I/O to\n access). The default value is one-tenth the size of a newly split leaf page., an integer\n greater than or equal to \\c 0; default \\c 0.}\n @config{leaf_page_max, the maximum page size for leaf nodes\\, in bytes; the size must be a\n multiple of the allocation size\\, and is significant for applications wanting to maximize\n sequential data transfer from a storage device.  The page maximum is the bytes of\n uncompressed data\\, that is\\, the limit is applied before any block compression is done., an\n integer between \\c 512B and \\c 512MB; default \\c 32KB.}\n @config{leaf_value_max, the largest value stored in a leaf node\\, in bytes.  If set\\, values\n larger than the specified size are stored as overflow items (which may require additional I/O\n to access). If the size is larger than the maximum leaf page size\\, the page size is\n temporarily ignored when large values are written.  The default is one-half the size of a\n newly split leaf page., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{log = (, the transaction log configuration for this object.  Only valid if \\c log is\n enabled in ::wiredtiger_open., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, if false\\, this object has checkpoint-level\n durability.  Not supported for layered tables., a boolean flag; default \\c true.}\n @config{\n ),,}\n @config{memory_page_image_max, the maximum in-memory page image represented by a single\n storage block.  Depending on compression efficiency\\, compression can create storage blocks\n which require significant resources to re-instantiate in the cache\\, penalizing the\n performance of future point updates.  The value limits the maximum in-memory page image a\n storage block will need.  If set to 0\\, a default of 4 times \\c leaf_page_max is used., an\n integer greater than or equal to \\c 0; default \\c 0.}\n @config{memory_page_max, the maximum size a page can grow to in memory before being\n reconciled to disk.  The specified size will be adjusted to a lower bound of\n <code>leaf_page_max</code>\\, and an upper bound of <code>cache_size / 10</code>. This limit\n is soft - it is possible for pages to be temporarily larger than this value., an integer\n between \\c 512B and \\c 10TB; default \\c 5MB.}\n @config{os_cache_dirty_max, maximum dirty system buffer cache usage\\, in bytes.  If\n non-zero\\, schedule writes for dirty blocks belonging to this object in the system buffer\n cache after that many bytes from this object are written into the buffer cache., an integer\n greater than or equal to \\c 0; default \\c 0.}\n @config{os_cache_max, maximum system buffer cache usage\\, in bytes.  If non-zero\\, evict\n object blocks from the system buffer cache after that many bytes from this object are read or\n written into the buffer cache., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{prefix_compression, configure prefix compression on row-store leaf pages., a boolean\n flag; default \\c false.}\n @config{prefix_compression_min, minimum gain before prefix compression will be used on\n row-store leaf pages., an integer greater than or equal to \\c 0; default \\c 4.}\n @config{split_pct, the Btree page split size as a percentage of the maximum Btree page size\\,\n that is\\, when a Btree page is split\\, it will be split into smaller pages\\, where each page\n is the specified percentage of the maximum Btree page size., an integer between \\c 50 and \\c\n 100; default \\c 90.}\n @config{tiered_storage = (, configure a storage source for this table., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;auth_token,\n authentication string identifier., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n bucket, the bucket indicating the location for this table., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;bucket_prefix, the unique bucket prefix for this table., a\n string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cache_directory, a directory to store\n locally cached versions of files in the storage source.  By default\\, it is named with \\c\n \"-cache\" appended to the bucket name.  A relative directory name is relative to the home\n directory., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;local_retention, time\n in seconds to retain data on tiered storage on the local tier for faster read access., an\n integer between \\c 0 and \\c 10000; default \\c 300.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;name,\n permitted values are \\c \"none\" or a custom storage source name created with\n WT_CONNECTION::add_storage_source.  See @ref custom_storage_sources for more information., a\n string; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;shared, enable sharing tiered\n tables across other WiredTiger instances., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{type, set the type of data source used to store a column group\\, index or simple\n table.  By default\\, a \\c \"file:\" URI is derived from the object name.  The \\c type\n configuration can be used to switch to a different data source or an extension configured by\n the application., a string; default \\c file.}\n @config{value_format, the format of the data packed into value items.  See @ref\n schema_format_types for details.  By default\\, the value_format is \\c 'u' and applications\n use a WT_ITEM structure to manipulate raw byte arrays.  Value items of type 't' are\n bitfields., a format string; default \\c u.}\n @config{write_timestamp_usage, describe how timestamps are expected to be used on table\n modifications.  The choices are the default\\, which ensures that once timestamps are used for\n a key\\, they are always used\\, and also that multiple updates to a key never use decreasing\n timestamps and \\c never which enforces that timestamps are never used for a table.  (The \\c\n always\\, \\c key_consistent\\, \\c mixed_mode and \\c ordered choices should not be used\\, and\n are retained for backward compatibility.)., a string\\, chosen from the following options: \\c\n \"always\"\\, \\c \"key_consistent\"\\, \\c \"mixed_mode\"\\, \\c \"never\"\\, \\c \"none\"\\, \\c \"ordered\";\n default \\c none.}\n @configend\n @errors"]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Compact a live row- or column-store btree.\n\n @snippet ex_all.c Compact a table\n\n @param session the session handle\n @param name the URI of the object to compact, such as\n \\c \"table:stock\"\n @configstart{WT_SESSION.compact, see dist/api_data.py}\n @config{background, enable/disabled the background compaction server., a boolean flag;\n default empty.}\n @config{dryrun, run only the estimation phase of compact., a boolean flag; default \\c false.}\n @config{exclude, list of table objects to be excluded from background compaction.  The list\n is immutable and only applied when the background compaction gets enabled.  The list is not\n saved between the calls and needs to be reapplied each time the service is enabled.  The\n individual objects in the list can only be of the \\c table: URI type., a list of strings;\n default empty.}\n @config{free_space_target, minimum amount of space recoverable for compaction to proceed., an\n integer greater than or equal to \\c 1MB; default \\c 20MB.}\n @config{run_once, configure background compaction server to run once.  In this mode\\,\n compaction is always attempted on each table unless explicitly excluded., a boolean flag;\n default \\c false.}\n @config{timeout, maximum amount of time to allow for compact in seconds.  The actual amount\n of time spent in compact may exceed the configured value.  A value of zero disables the\n timeout., an integer; default \\c 1200.}\n @configend\n @errors"]
    pub compact: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Drop (delete) a table.\n\n Although the drop operation is non-transactional, if it fails, it will force the current\n transaction to roll back to avoid potential disruption to the data written by the\n transaction.\n\n @exclusive\n\n @not_transactional\n\n @snippet ex_all.c Drop a table\n\n @param session the session handle\n @param name the URI of the object to drop, such as \\c \"table:stock\"\n @configstart{WT_SESSION.drop, see dist/api_data.py}\n @config{force, return success if the object does not exist., a boolean flag; default \\c\n false.}\n @config{remove_files, if the underlying files should be removed., a boolean flag; default \\c\n true.}\n @configend\n @ebusy_errors"]
    pub drop: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Flush the log.\n\n WT_SESSION::log_flush will fail if logging is not enabled.\n\n @param session the session handle\n @configstart{WT_SESSION.log_flush, see dist/api_data.py}\n @config{sync, forcibly flush the log and wait for it to achieve the synchronization level\n specified.  The \\c off setting forces any buffered log records to be written to the file\n system.  The \\c on setting forces log records to be written to the storage device., a\n string\\, chosen from the following options: \\c \"off\"\\, \\c \"on\"; default \\c on.}\n @configend\n @errors"]
    pub log_flush: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Insert a ::WT_LOGREC_MESSAGE type record in the database log files\n (the database must be configured for logging when this method is\n called).\n\n @param session the session handle\n @param format a printf format specifier\n @errors"]
    pub log_printf: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reset the session handle.\n\n This method resets the cursors associated with the session, clears session statistics and\n discards cached resources. No session configurations are modified (or reset to their\n default values). WT_SESSION::reset will fail if a transaction is in progress in the\n session.\n\n @snippet ex_all.c Reset the session\n\n @param session the session handle\n @errors"]
    pub reset: ::std::option::Option<
        unsafe extern "C" fn(session: *mut WT_SESSION) -> ::std::os::raw::c_int,
    >,
    #[doc = " Salvage a table.\n\n Salvage rebuilds the file or files which comprise a table,\n discarding any corrupted file blocks.\n\n When salvage is done, previously deleted records may re-appear, and\n inserted records may disappear, so salvage should not be run\n unless it is known to be necessary.  Normally, salvage should be\n called after a table or file has been corrupted, as reported by the\n WT_SESSION::verify method.\n\n Files are rebuilt in place. The salvage method overwrites the\n existing files.\n\n @exclusive\n\n @snippet ex_all.c Salvage a table\n\n @param session the session handle\n @param name the URI of the table or file to salvage\n @configstart{WT_SESSION.salvage, see dist/api_data.py}\n @config{force, force salvage even of files that do not appear to be WiredTiger files., a\n boolean flag; default \\c false.}\n @configend\n @ebusy_errors"]
    pub salvage: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Truncate a file, table, cursor range, or backup cursor\n\n Truncate a table or file.\n @snippet ex_all.c Truncate a table\n\n Truncate a cursor range.  When truncating based on a cursor position,\n it is not required the cursor reference a record in the object, only\n that the key be set.  This allows applications to discard portions of\n the object name space without knowing exactly what records the object\n contains. The start and stop points are both inclusive; that is, the\n key set in the start cursor is the first record to be deleted and the\n key set in the stop cursor is the last.\n\n @snippet ex_all.c Truncate a range\n\n Range truncate is implemented as a \"scan and write\" operation, specifically without range\n locks. Inserts or other operations in the range, as well as operations before or after\n the range when no explicit starting or ending key is set, are not well defined: conflicts\n may be detected or both transactions may commit. If both commit, there's a failure and\n recovery runs, the result may be different than what was in cache before the crash.\n\n The WT_CURSOR::truncate range truncate operation can only be used at snapshot isolation.\n\n Any specified cursors end with no position, and subsequent calls to\n the WT_CURSOR::next (WT_CURSOR::prev) method will iterate from the\n beginning (end) of the table.\n\n @param session the session handle\n @param name the URI of the table or file to truncate, or \\c \"log:\"\n for a backup cursor\n @param start optional cursor marking the first record discarded;\n if <code>NULL</code>, the truncate starts from the beginning of\n the object; must be provided when truncating a backup cursor\n @param stop optional cursor marking the last record discarded;\n if <code>NULL</code>, the truncate continues to the end of the\n object; ignored when truncating a backup cursor\n @configempty{WT_SESSION.truncate, see dist/api_data.py}\n @errors"]
    pub truncate: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            start: *mut WT_CURSOR,
            stop: *mut WT_CURSOR,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Verify a table.\n\n Verify reports if a file, or the files that comprise a table, have been corrupted.\n The WT_SESSION::salvage method can be used to repair a corrupted file.\n\n @snippet ex_all.c Verify a table\n\n @exclusive\n\n @param session the session handle\n @param name the URI of the table or file to verify, optional if verifying the history\n store\n @configstart{WT_SESSION.verify, see dist/api_data.py}\n @config{do_not_clear_txn_id, Turn off transaction id clearing\\, intended for debugging and\n better diagnosis of crashes or failures.  Note: History store validation is disabled when the\n configuration is set as visibility rules may not work correctly because the transaction ids\n are not cleared., a boolean flag; default \\c false.}\n @config{dump_address, Display page addresses\\, time windows\\, and page types as pages are\n verified\\, using the application's message handler\\, intended for debugging., a boolean flag;\n default \\c false.}\n @config{dump_all_data, Display application data as pages or blocks are verified\\, using the\n application's message handler\\, intended for debugging.  Disabling this does not guarantee\n that no user data will be output., a boolean flag; default \\c false.}\n @config{dump_blocks, Display the contents of on-disk blocks as they are verified\\, using the\n application's message handler\\, intended for debugging., a boolean flag; default \\c false.}\n @config{dump_key_data, Display application data keys as pages or blocks are verified\\, using\n the application's message handler\\, intended for debugging.  Disabling this does not\n guarantee that no user data will be output., a boolean flag; default \\c false.}\n @config{dump_layout, Display the layout of the files as they are verified\\, using the\n application's message handler\\, intended for debugging; requires optional support from the\n block manager., a boolean flag; default \\c false.}\n @config{dump_offsets, Display the contents of specific on-disk blocks\\, using the\n application's message handler\\, intended for debugging., a list of strings; default empty.}\n @config{dump_pages, Display the contents of in-memory pages as they are verified\\, using the\n application's message handler\\, intended for debugging., a boolean flag; default \\c false.}\n @config{dump_tree_shape, Display the btree shapes as they are verified\\, using the\n application's message handler\\, intended for debugging; requires optional support from the\n block manager., a boolean flag; default \\c false.}\n @config{read_corrupt, A mode that allows verify to continue reading after encountering a\n checksum error.  It will skip past the corrupt block and continue with the verification\n process., a boolean flag; default \\c false.}\n @config{stable_timestamp, Ensure that no data has a start timestamp after the stable\n timestamp\\, to be run after rollback_to_stable., a boolean flag; default \\c false.}\n @config{strict, Treat any verification problem as an error; by default\\, verify will warn\\,\n but not fail\\, in the case of errors that won't affect future behavior (for example\\, a\n leaked block)., a boolean flag; default \\c false.}\n @configend\n @ebusy_errors"]
    pub verify: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            name: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Transactions\n @{\n/\n/*!\n Start a transaction in this session.\n\n The transaction remains active until ended by\n WT_SESSION::commit_transaction or WT_SESSION::rollback_transaction.\n Operations performed on cursors capable of supporting transactional\n operations that are already open in this session, or which are opened\n before the transaction ends, will operate in the context of the\n transaction.\n\n @requires_notransaction\n\n @snippet ex_all.c transaction commit/rollback\n\n @param session the session handle\n @configstart{WT_SESSION.begin_transaction, see dist/api_data.py}\n @config{claim_prepared_id, allow a session to claim a prepared transaction that was restored\n upon restart by specifying the transaction's prepared ID. Returns WT_NOTFOUND if the prepared\n id doesn't exist., a string; default empty.}\n @config{ignore_prepare, whether to ignore updates by other prepared transactions when doing\n of read operations of this transaction.  When \\c true\\, forces the transaction to be\n read-only.  Use \\c force to ignore prepared updates and permit writes (see @ref\n timestamp_prepare_ignore_prepare for more information)., a string\\, chosen from the following\n options: \\c \"false\"\\, \\c \"force\"\\, \\c \"true\"; default \\c false.}\n @config{isolation, the isolation level for this transaction; defaults to the session's\n isolation level., a string\\, chosen from the following options: \\c \"read-uncommitted\"\\, \\c\n \"read-committed\"\\, \\c \"snapshot\"; default empty.}\n @config{name, name of the transaction for tracing and debugging., a string; default empty.}\n @config{no_timestamp, allow a commit without a timestamp\\, creating values that have \"always\n existed\" and are visible regardless of timestamp.  See @ref timestamp_txn_api., a boolean\n flag; default \\c false.}\n @config{operation_timeout_ms, when non-zero\\, a requested limit on the time taken to complete\n operations in this transaction.  Time is measured in real time milliseconds from the start of\n each WiredTiger API call.  There is no guarantee any operation will not take longer than this\n amount of time.  If WiredTiger notices the limit has been exceeded\\, an operation may return\n a WT_ROLLBACK error.  Default is to have no limit., an integer greater than or equal to \\c 0;\n default \\c 0.}\n @config{priority, priority of the transaction for resolving conflicts.  Transactions with\n higher values are less likely to abort., an integer between \\c -100 and \\c 100; default \\c\n 0.}\n @config{read_timestamp, read using the specified timestamp.  The value must not be older than\n the current oldest timestamp.  See @ref timestamp_txn_api., a string; default empty.}\n @config{roundup_timestamps = (, round up timestamps of the transaction., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prepared,\n applicable only for prepared transactions\\, and intended only for special-purpose use.  See\n @ref timestamp_prepare_roundup.  Allows the prepare timestamp and the commit timestamp of\n this transaction to be rounded up to be no older than the oldest timestamp\\, and allows\n violating the usual restriction that the prepare timestamp must be newer than the stable\n timestamp.  Specifically: at transaction prepare\\, if the prepare timestamp is less than or\n equal to the oldest timestamp\\, the prepare timestamp will be rounded to the oldest\n timestamp.  Subsequently\\, at commit time\\, if the commit timestamp is less than the (now\n rounded) prepare timestamp\\, the commit timestamp will be rounded up to it and thus to at\n least oldest.  Neither timestamp will be checked against the stable timestamp., a boolean\n flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;read, if the read timestamp is less\n than the oldest timestamp\\, the read timestamp will be rounded up to the oldest timestamp.\n See @ref timestamp_read_roundup., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{sync, whether to sync log records when the transaction commits\\, inherited from\n ::wiredtiger_open \\c transaction_sync., a boolean flag; default empty.}\n @configend\n @errors"]
    pub begin_transaction: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Commit the current transaction.\n\n A transaction must be in progress when this method is called.\n\n If WT_SESSION::commit_transaction returns an error, the transaction\n was rolled back, not committed, and all cursors associated with the session are reset.\n\n @requires_transaction\n\n @snippet ex_all.c transaction commit/rollback\n\n @param session the session handle\n @configstart{WT_SESSION.commit_transaction, see dist/api_data.py}\n @config{commit_timestamp, set the commit timestamp for the current transaction.  For\n non-prepared transactions\\, the value must not be older than the first commit timestamp\n already set for the current transaction (if any)\\, must not be older than the current oldest\n timestamp\\, and must be after the current stable timestamp.  For prepared transactions\\, a\n commit timestamp is required\\, must not be older than the prepare timestamp\\, and can be set\n only once.  See @ref timestamp_txn_api and @ref timestamp_prepare., a string; default empty.}\n @config{durable_timestamp, set the durable timestamp for the current transaction.  Required\n for the commit of a prepared transaction\\, and otherwise not permitted.  The value must also\n be after the current oldest and stable timestamps and must not be older than the commit\n timestamp.  See @ref timestamp_prepare., a string; default empty.}\n @config{operation_timeout_ms, when non-zero\\, a requested limit on the time taken to complete\n operations in this transaction.  Time is measured in real time milliseconds from the start of\n each WiredTiger API call.  There is no guarantee any operation will not take longer than this\n amount of time.  If WiredTiger notices the limit has been exceeded\\, an operation may return\n a WT_ROLLBACK error.  Default is to have no limit., an integer greater than or equal to \\c 0;\n default \\c 0.}\n @config{sync, override whether to sync log records when the transaction commits.  The default\n is inherited from ::wiredtiger_open \\c transaction_sync.  The \\c off setting does not wait\n for records to be written or synchronized.  The \\c on setting forces log records to be\n written to the storage device., a string\\, chosen from the following options: \\c \"off\"\\, \\c\n \"on\"; default empty.}\n @configend\n @errors"]
    pub commit_transaction: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Prepare the current transaction.\n\n A transaction must be in progress when this method is called.\n\n Preparing a transaction will guarantee a subsequent commit will\n succeed. Only commit and rollback are allowed on a transaction after\n it has been prepared. The transaction prepare API is designed to\n support MongoDB exclusively, and guarantees update conflicts have\n been resolved, but does not guarantee durability.\n\n @requires_transaction\n\n @snippet ex_all.c transaction prepare\n\n @param session the session handle\n @configstart{WT_SESSION.prepare_transaction, see dist/api_data.py}\n @config{prepare_timestamp, set the prepare timestamp for the updates of the current\n transaction.  The value must not be older than any active read timestamps\\, and must be newer\n than the current stable timestamp.  See @ref timestamp_prepare., a string; default empty.}\n @config{prepared_id, set the optional prepared ID for the prepared updates of the current\n transaction.  Multiple transactions can share a prepared ID\\, as long as they are all\n guaranteed to share a decision whether to commit or abort and share the same prepare\\, commit\n and durable timestamps.  It is ignored if the preserve prepared config is not enabled., a\n string; default empty.}\n @configend\n @errors"]
    pub prepare_transaction: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Roll back the current transaction.\n\n A transaction must be in progress when this method is called.\n\n All cursors associated with the session are reset.\n\n @requires_transaction\n\n @snippet ex_all.c transaction commit/rollback\n\n @param session the session handle\n @configstart{WT_SESSION.rollback_transaction, see dist/api_data.py}\n @config{operation_timeout_ms, when non-zero\\, a requested limit on the time taken to complete\n operations in this transaction.  Time is measured in real time milliseconds from the start of\n each WiredTiger API call.  There is no guarantee any operation will not take longer than this\n amount of time.  If WiredTiger notices the limit has been exceeded\\, an operation may return\n a WT_ROLLBACK error.  Default is to have no limit., an integer greater than or equal to \\c 0;\n default \\c 0.}\n @config{rollback_timestamp, set the rollback timestamp for the current transaction.  This is\n valid only for prepared transactions under the preserve_prepared config.  For prepared\n transactions\\, a rollback timestamp is required\\, must not be older than the prepare\n timestamp\\, and can be set only once.  See @ref timestamp_txn_api and @ref\n timestamp_prepare., a string; default empty.}\n @configend\n @errors"]
    pub rollback_transaction: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Transaction timestamps\n @{\n/\n/*!\n Query the session's transaction timestamp state.\n\n The WT_SESSION.query_timestamp method can only be used at snapshot isolation.\n\n @param session the session handle\n @param[out] hex_timestamp a buffer that will be set to the\n hexadecimal encoding of the timestamp being queried.  Must be large\n enough to hold a NUL terminated, hex-encoded 8B timestamp (17 bytes).\n @configstart{WT_SESSION.query_timestamp, see dist/api_data.py}\n @config{get, specify which timestamp to query: \\c commit returns the most recently set\n commit_timestamp; \\c first_commit returns the first set commit_timestamp; \\c prepare returns\n the timestamp used in preparing a transaction; \\c read returns the timestamp at which the\n transaction is reading.  See @ref timestamp_txn_api., a string\\, chosen from the following\n options: \\c \"commit\"\\, \\c \"first_commit\"\\, \\c \"prepare\"\\, \\c \"read\"; default \\c read.}\n @configend\n\n A timestamp of 0 is returned if the timestamp is not available or has not been set.\n @errors"]
    pub query_timestamp: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            hex_timestamp: *mut ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set a timestamp on a transaction.\n\n The WT_SESSION.timestamp_transaction method can only be used at snapshot isolation.\n\n @snippet ex_all.c transaction timestamp\n\n @requires_transaction\n\n @param session the session handle\n @configstart{WT_SESSION.timestamp_transaction, see dist/api_data.py}\n @config{commit_timestamp, set the commit timestamp for the current transaction.  For\n non-prepared transactions\\, the value must not be older than the first commit timestamp\n already set for the current transaction\\, if any\\, must not be older than the current oldest\n timestamp and must be after the current stable timestamp.  For prepared transactions\\, a\n commit timestamp is required\\, must not be older than the prepare timestamp\\, can be set only\n once\\, and must not be set until after the transaction has successfully prepared.  See @ref\n timestamp_txn_api and @ref timestamp_prepare., a string; default empty.}\n @config{durable_timestamp, set the durable timestamp for the current transaction.  Required\n for the commit of a prepared transaction\\, and otherwise not permitted.  Can only be set\n after the transaction has been prepared and a commit timestamp has been set.  The value must\n be after the current oldest and stable timestamps and must not be older than the commit\n timestamp.  See @ref timestamp_prepare., a string; default empty.}\n @config{prepare_timestamp, set the prepare timestamp for the updates of the current\n transaction.  The value must not be older than any active read timestamps\\, and must be newer\n than the current stable timestamp.  Can be set only once per transaction.  Setting the\n prepare timestamp does not by itself prepare the transaction\\, but does oblige the\n application to eventually prepare the transaction before committing it.  See @ref\n timestamp_prepare., a string; default empty.}\n @config{read_timestamp, read using the specified timestamp.  The value must not be older than\n the current oldest timestamp.  This can only be set once for a transaction.  See @ref\n timestamp_txn_api., a string; default empty.}\n @config{rollback_timestamp, set the rollback timestamp for the current transaction.  This is\n valid only for prepared transactions under the preserve_prepared config.  For prepared\n transactions\\, a rollback timestamp is required\\, must not be older than the prepare\n timestamp\\, and can be set only once.  It is ignored if the preserve prepared config is not\n enabled.  See @ref timestamp_txn_api and @ref timestamp_prepare., a string; default empty.}\n @configend\n @errors"]
    pub timestamp_transaction: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set a timestamp on a transaction numerically.  Prefer this method over\n WT_SESSION::timestamp_transaction if the hexadecimal string parsing done in that method\n becomes a bottleneck.\n\n The WT_SESSION.timestamp_transaction_uint method can only be used at snapshot isolation.\n\n @snippet ex_all.c transaction timestamp_uint\n\n @requires_transaction\n\n @param session the session handle\n @param which the timestamp being set (see ::WT_TS_TXN_TYPE for available options, and\n WT_SESSION::timestamp_transaction for constraints on the timestamps).\n @param ts the timestamp.\n @errors"]
    pub timestamp_transaction_uint: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            which: WT_TS_TXN_TYPE,
            ts: u64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set a prepared_id on a transaction.\n\n The WT_SESSION.prepared_id_transaction method can only be used at snapshot isolation.\n\n @snippet ex_all.c transaction prepared_id\n\n @requires_transaction\n\n @param session the session handle\n @configstart{WT_SESSION.prepared_id_transaction, see dist/api_data.py}\n @config{prepared_id, set the optional prepared ID for the prepared updates of the current\n transaction.  Multiple transactions can share a prepared ID\\, as long as they are all\n guaranteed to share a decision whether to commit or abort and share the same prepare\\, commit\n and durable timestamps.  It is ignored if the preserve prepared config is not enabled., a\n string; default empty.}\n @configend\n @errors"]
    pub prepared_id_transaction: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set a prepared id on a transaction numerically.  Prefer this method over\n WT_SESSION::prepared_id_transaction if the hexadecimal string parsing done in that method\n becomes a bottleneck.\n\n The WT_SESSION.prepared_id_transaction_uint method can only be used at snapshot isolation.\n\n @snippet ex_all.c transaction prepared_id_uint\n\n @requires_transaction\n\n @param session the session handle\n @param prepared_id the prepared_id.\n @errors"]
    pub prepared_id_transaction_uint: ::std::option::Option<
        unsafe extern "C" fn(session: *mut WT_SESSION, prepared_id: u64) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Transaction support\n @{\n/\n/*!\n Write a transactionally consistent snapshot of a database or set of individual objects.\n\n When timestamps are not in use, the checkpoint includes all transactions committed\n before the checkpoint starts. When timestamps are in use and the checkpoint runs with\n \\c use_timestamp=true (the default), updates committed with a timestamp after the\n \\c stable timestamp, in tables configured for checkpoint-level durability, are not\n included in the checkpoint. Updates committed in tables configured for commit-level\n durability are always included in the checkpoint. See @ref durability_checkpoint and\n @ref durability_log for more information.\n\n Calling the checkpoint method multiple times serializes the checkpoints; new checkpoint\n calls wait for running checkpoint calls to complete.\n\n Existing named checkpoints may optionally be discarded.\n\n @requires_notransaction\n\n @snippet ex_all.c Checkpoint examples\n\n @param session the session handle\n @configstart{WT_SESSION.checkpoint, see dist/api_data.py}\n @config{debug = (, configure debug specific behavior on a checkpoint.  Generally only used\n for internal testing purposes., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;checkpoint_cleanup, if true\\, checkpoint cleanup thread is\n triggered to perform the checkpoint cleanup., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;checkpoint_crash_point, A value between 1 and 1000 will\n trigger a controlled crash during the checkpoint process.  Lower values will trigger crashes\n in the initial phase of checkpoint\\, while higher values will result in crashes in the final\n phase of the checkpoint process., an integer between \\c 0 and \\c 1000; default \\c 0.}\n @config{ ),,}\n @config{drop, specify a list of checkpoints to drop.  The list may additionally contain one\n of the following keys: \\c \"from=all\" to drop all checkpoints\\, \\c \"from=<checkpoint>\" to drop\n all checkpoints after and including the named checkpoint\\, or \\c \"to=<checkpoint>\" to drop\n all checkpoints before and including the named checkpoint.  Checkpoints cannot be dropped if\n open in a cursor.  While a hot backup is in progress\\, checkpoints created prior to the start\n of the backup cannot be dropped., a list of strings; default empty.}\n @config{flush_tier = (, configure flushing objects to tiered storage after checkpoint.  See\n @ref tiered_storage., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, if true and tiered storage is in use\\, perform one\n iteration of object switching and flushing objects to tiered storage., a boolean flag;\n default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;force, if false (the default)\\, flush_tier\n of any individual object may be skipped if the underlying object has not been modified since\n the previous flush_tier.  If true\\, this option forces the flush_tier., a boolean flag;\n default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;sync, wait for all objects to be flushed\n to the shared storage to the level specified.  When false\\, do not wait for any objects to be\n written to the tiered storage system but return immediately after generating the objects and\n work units for an internal thread.  When true\\, the caller waits until all work queued for\n this call to be completely processed before returning., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;timeout, amount of time\\, in seconds\\, to wait for flushing\n of objects to complete.  WiredTiger returns EBUSY if the timeout is reached.  A value of zero\n disables the timeout., an integer; default \\c 0.}\n @config{ ),,}\n @config{force, if false (the default)\\, checkpoints may be skipped if the underlying object\n has not been modified.  If true\\, this option forces the checkpoint., a boolean flag; default\n \\c false.}\n @config{name, if set\\, specify a name for the checkpoint., a string; default empty.}\n @config{use_timestamp, if true (the default)\\, create the checkpoint as of the last stable\n timestamp if timestamps are in use\\, or with all committed updates if there is no stable\n timestamp set.  If false\\, always generate a checkpoint with all committed updates\\, ignoring\n any stable timestamp., a boolean flag; default \\c true.}\n @configend\n @errors"]
    pub checkpoint: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reset the snapshot used for database visibility.\n\n For transactions running with snapshot isolation, this method releases the existing\n snapshot of the database and gets a new one. This makes newer commits visible. The\n call can be used to avoid pinning old and no-longer-needed content in the database.\n Applications not using read timestamps for search may see different results after the\n snapshot is updated.\n\n It is an error to call this method when using an isolation level other than snapshot\n isolation, or if the current transaction has already written any data.\n\n @requires_transaction\n\n @snippet ex_all.c reset snapshot\n\n @param session the session handle\n @errors"]
    pub reset_snapshot: ::std::option::Option<
        unsafe extern "C" fn(session: *mut WT_SESSION) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the transaction ID range pinned by the session handle.\n\n The ID range is an approximate count of transactions and is calculated\n based on the oldest ID needed for the active transaction in this session,\n compared to the newest transaction in the system.\n\n @snippet ex_all.c transaction pinned range\n\n @param session the session handle\n @param[out] range the range of IDs pinned by this session. Zero if\n there is no active transaction.\n @errors"]
    pub transaction_pinned_range: ::std::option::Option<
        unsafe extern "C" fn(session: *mut WT_SESSION, range: *mut u64) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Error info\n @{\n/\n/*!\n Return verbose information about the last session API call.\n After every session API call (excluding this one), the error, sub-level error and error\n message is reset. See @ref error_handling for more details.\n\n @param session the session handle\n @param[out] err The return value of the last session API call.\n @param[out] sub_level_err An optional sub-level error code to provide contextual information.\n @param[out] err_msg An optional error message to provide contextual information."]
    pub get_last_error: ::std::option::Option<
        unsafe extern "C" fn(
            session: *mut WT_SESSION,
            err: *mut ::std::os::raw::c_int,
            sub_level_err: *mut ::std::os::raw::c_int,
            err_msg: *mut *const ::std::os::raw::c_char,
        ),
    >,
    #[doc = " Call into the library.\n\n This method is used for breakpoints and to set other configuration\n when debugging layers not directly supporting those features.\n\n @param session the session handle\n @errors"]
    pub breakpoint: ::std::option::Option<
        unsafe extern "C" fn(session: *mut WT_SESSION) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_session"][::std::mem::size_of::<__wt_session>() - 248usize];
    ["Alignment of __wt_session"][::std::mem::align_of::<__wt_session>() - 8usize];
    ["Offset of field: __wt_session::connection"]
        [::std::mem::offset_of!(__wt_session, connection) - 0usize];
    ["Offset of field: __wt_session::app_private"]
        [::std::mem::offset_of!(__wt_session, app_private) - 8usize];
    ["Offset of field: __wt_session::close"][::std::mem::offset_of!(__wt_session, close) - 16usize];
    ["Offset of field: __wt_session::reconfigure"]
        [::std::mem::offset_of!(__wt_session, reconfigure) - 24usize];
    ["Offset of field: __wt_session::strerror"]
        [::std::mem::offset_of!(__wt_session, strerror) - 32usize];
    ["Offset of field: __wt_session::open_cursor"]
        [::std::mem::offset_of!(__wt_session, open_cursor) - 40usize];
    ["Offset of field: __wt_session::alter"][::std::mem::offset_of!(__wt_session, alter) - 48usize];
    ["Offset of field: __wt_session::bind_configuration"]
        [::std::mem::offset_of!(__wt_session, bind_configuration) - 56usize];
    ["Offset of field: __wt_session::create"]
        [::std::mem::offset_of!(__wt_session, create) - 64usize];
    ["Offset of field: __wt_session::compact"]
        [::std::mem::offset_of!(__wt_session, compact) - 72usize];
    ["Offset of field: __wt_session::drop"][::std::mem::offset_of!(__wt_session, drop) - 80usize];
    ["Offset of field: __wt_session::log_flush"]
        [::std::mem::offset_of!(__wt_session, log_flush) - 88usize];
    ["Offset of field: __wt_session::log_printf"]
        [::std::mem::offset_of!(__wt_session, log_printf) - 96usize];
    ["Offset of field: __wt_session::reset"]
        [::std::mem::offset_of!(__wt_session, reset) - 104usize];
    ["Offset of field: __wt_session::salvage"]
        [::std::mem::offset_of!(__wt_session, salvage) - 112usize];
    ["Offset of field: __wt_session::truncate"]
        [::std::mem::offset_of!(__wt_session, truncate) - 120usize];
    ["Offset of field: __wt_session::verify"]
        [::std::mem::offset_of!(__wt_session, verify) - 128usize];
    ["Offset of field: __wt_session::begin_transaction"]
        [::std::mem::offset_of!(__wt_session, begin_transaction) - 136usize];
    ["Offset of field: __wt_session::commit_transaction"]
        [::std::mem::offset_of!(__wt_session, commit_transaction) - 144usize];
    ["Offset of field: __wt_session::prepare_transaction"]
        [::std::mem::offset_of!(__wt_session, prepare_transaction) - 152usize];
    ["Offset of field: __wt_session::rollback_transaction"]
        [::std::mem::offset_of!(__wt_session, rollback_transaction) - 160usize];
    ["Offset of field: __wt_session::query_timestamp"]
        [::std::mem::offset_of!(__wt_session, query_timestamp) - 168usize];
    ["Offset of field: __wt_session::timestamp_transaction"]
        [::std::mem::offset_of!(__wt_session, timestamp_transaction) - 176usize];
    ["Offset of field: __wt_session::timestamp_transaction_uint"]
        [::std::mem::offset_of!(__wt_session, timestamp_transaction_uint) - 184usize];
    ["Offset of field: __wt_session::prepared_id_transaction"]
        [::std::mem::offset_of!(__wt_session, prepared_id_transaction) - 192usize];
    ["Offset of field: __wt_session::prepared_id_transaction_uint"]
        [::std::mem::offset_of!(__wt_session, prepared_id_transaction_uint) - 200usize];
    ["Offset of field: __wt_session::checkpoint"]
        [::std::mem::offset_of!(__wt_session, checkpoint) - 208usize];
    ["Offset of field: __wt_session::reset_snapshot"]
        [::std::mem::offset_of!(__wt_session, reset_snapshot) - 216usize];
    ["Offset of field: __wt_session::transaction_pinned_range"]
        [::std::mem::offset_of!(__wt_session, transaction_pinned_range) - 224usize];
    ["Offset of field: __wt_session::get_last_error"]
        [::std::mem::offset_of!(__wt_session, get_last_error) - 232usize];
    ["Offset of field: __wt_session::breakpoint"]
        [::std::mem::offset_of!(__wt_session, breakpoint) - 240usize];
};
#[doc = "< The LSN of the last materialized page log entry."]
pub const WT_CONTEXT_TYPE_WT_CONTEXT_TYPE_LAST_MATERIALIZED_LSN: WT_CONTEXT_TYPE = 0;
#[doc = " WT_CONNECTION::set_context_uint types"]
pub type WT_CONTEXT_TYPE = ::std::os::raw::c_uint;
#[doc = " A connection to a WiredTiger database.  The connection may be opened within\n the same address space as the caller or accessed over a socket connection.\n\n Most applications will open a single connection to a database for each\n process.  The first process to open a connection to a database will access\n the database in its own address space.  Subsequent connections (if allowed)\n will communicate with the first process over a socket connection to perform\n their operations.\n\n <b>Thread safety:</b> A WT_CONNECTION handle may be shared between threads.\n See @ref threads for more information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_connection {
    #[doc = " Close a connection.\n\n Any open sessions will be closed. This will release the resources\n associated with the session handle, including rolling back any\n active transactions and closing any cursors that remain open in the\n session.\n\n @snippet ex_all.c Close a connection\n\n @param connection the connection handle\n @configstart{WT_CONNECTION.close, see dist/api_data.py}\n @config{leak_memory, don't free memory during close., a boolean flag; default \\c false.}\n @config{use_timestamp, by default\\, create the close checkpoint as of the last stable\n timestamp if timestamps are in use\\, or all current updates if there is no stable timestamp\n set.  If false\\, this option generates a checkpoint with all updates., a boolean flag;\n default \\c true.}\n @configend\n @errors"]
    pub close: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Output debug information for various subsystems. The output format\n may change over time, gathering the debug information may be\n invasive, and the information reported may not provide a point in\n time view of the system.\n\n @param connection the connection handle\n @configstart{WT_CONNECTION.debug_info, see dist/api_data.py}\n @config{backup, print incremental backup information., a boolean flag; default \\c false.}\n @config{cache, print cache information., a boolean flag; default \\c false.}\n @config{cursors, print all open cursor information., a boolean flag; default \\c false.}\n @config{handles, print open handles information., a boolean flag; default \\c false.}\n @config{log, print log information., a boolean flag; default \\c false.}\n @config{metadata, print metadata information., a boolean flag; default \\c false.}\n @config{sessions, print open session information., a boolean flag; default \\c false.}\n @config{txn, print global txn information., a boolean flag; default \\c false.}\n @configend\n @errors"]
    pub debug_info: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Reconfigure a connection handle.\n\n @snippet ex_all.c Reconfigure a connection\n\n @param connection the connection handle\n @configstart{WT_CONNECTION.reconfigure, see dist/api_data.py}\n @config{block_cache = (, block cache configuration options., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;blkcache_eviction_aggression,\n seconds an unused block remains in the cache before it is evicted., an integer between \\c 1\n and \\c 7200; default \\c 1800.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cache_on_checkpoint, cache\n blocks written by a checkpoint., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cache_on_writes, cache blocks as they are written (other than\n checkpoint blocks)., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n enabled, enable block cache., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;full_target, the fraction of the block cache that must be\n full before eviction will remove unused blocks., an integer between \\c 30 and \\c 100; default\n \\c 95.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;hashsize, number of buckets in the hashtable that\n keeps track of blocks., an integer between \\c 512 and \\c 256K; default \\c 32768.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;max_percent_overhead, maximum tolerated overhead expressed as\n the number of blocks added and removed as percent of blocks looked up; cache population and\n eviction will be suppressed if the overhead exceeds the threshold., an integer between \\c 1\n and \\c 500; default \\c 10.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;nvram_path, the absolute path to\n the file system mounted on the NVRAM device., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;percent_file_in_dram, bypass cache for a file if the set\n percentage of the file fits in system DRAM (as specified by block_cache.system_ram)., an\n integer between \\c 0 and \\c 100; default \\c 50.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;size,\n maximum memory to allocate for the block cache., an integer between \\c 0 and \\c 10TB; default\n \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;system_ram, the bytes of system DRAM available for\n caching filesystem blocks., an integer between \\c 0 and \\c 1024GB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;type, cache location: DRAM or NVRAM., a string; default\n empty.}\n @config{ ),,}\n @config{cache_max_wait_ms, the maximum number of milliseconds an application thread will wait\n for space to be available in cache before giving up.  Default or 0 will wait forever.  1 will\n never wait., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{cache_overhead, assume the heap allocator overhead is the specified percentage\\, and\n adjust the cache usage by that amount (for example\\, if there is 10GB of data in cache\\, a\n percentage of 10 means WiredTiger treats this as 11GB). This value is configurable because\n different heap allocators have different overhead and different workloads will have different\n heap allocation sizes and patterns\\, therefore applications may need to adjust this value\n based on allocator choice and behavior in measured workloads., an integer between \\c 0 and \\c\n 30; default \\c 8.}\n @config{cache_size, maximum heap memory to allocate for the cache.  A database should\n configure either \\c cache_size or \\c shared_cache but not both., an integer between \\c 1MB\n and \\c 10TB; default \\c 100MB.}\n @config{cache_stuck_timeout_ms, the number of milliseconds to wait before a stuck cache times\n out in diagnostic mode.  Default will wait for 5 minutes\\, 0 will wait forever., an integer\n greater than or equal to \\c 0; default \\c 300000.}\n @config{checkpoint = (, periodically checkpoint the database.  Enabling the checkpoint server\n uses a session from the configured \\c session_max., a set of related configuration options\n defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;log_size, wait for this amount of log\n record bytes to be written to the log between each checkpoint.  If non-zero\\, this value will\n use a minimum of the log file size.  A database can configure both log_size and wait to set\n an upper bound for checkpoints; setting this value above 0 configures periodic checkpoints.,\n an integer between \\c 0 and \\c 2GB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;wait,\n seconds to wait between each checkpoint; setting this value above 0 configures periodic\n checkpoints., an integer between \\c 0 and \\c 100000; default \\c 0.}\n @config{ ),,}\n @config{checkpoint_cleanup = (, periodically checkpoint cleanup the database., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n file_wait_ms, the number of milliseconds to wait between each file by the checkpoint\n cleanup\\, 0 will not wait., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;method, control how aggressively obsolete content is removed\n by reading the internal pages.  Default to none\\, which means no additional work is done to\n find obsolete content., a string\\, chosen from the following options: \\c \"none\"\\, \\c\n \"reclaim_space\"; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;wait, seconds to wait\n between each checkpoint cleanup., an integer between \\c 1 and \\c 100000; default \\c 300.}\n @config{ ),,}\n @config{chunk_cache = (, chunk cache reconfiguration options., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;pinned, List of \"table:\" URIs\n exempt from cache eviction.  Capacity config overrides this\\, tables exceeding capacity will\n not be fully retained.  Table names can appear in both this and the preload list\\, but not in\n both this and the exclude list.  Duplicate names are allowed., a list of strings; default\n empty.}\n @config{ ),,}\n @config{compatibility = (, set compatibility version of database.  Changing the compatibility\n version requires that there are no active operations for the duration of the call., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;release,\n compatibility release version string., a string; default empty.}\n @config{ ),,}\n @config{debug_mode = (, control the settings of various extended debugging features., a set\n of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n background_compact, if true\\, background compact aggressively removes compact statistics for\n a file and decreases the max amount of time a file can be skipped for., a boolean flag;\n default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;checkpoint_retention, adjust log removal\n to retain the log records of this number of checkpoints.  Zero or one means perform normal\n removal., an integer between \\c 0 and \\c 1024; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;configuration, if true\\, display invalid cache configuration\n warnings., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n corruption_abort, if true and built in diagnostic mode\\, dump core in the case of data\n corruption., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;crash_point =\n (, control the settings of crash points used for debugging., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n after_drop_colgroup, if true\\, force crash in table drop after dropping the table metadata\n entry.  This is intended for testing purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;after_drop_file, if true\\, force\n crash in table drop after dropping the colgroup metadata entry.  This is intended for testing\n purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;before_insert_colgroup, if true\\,\n force crash in table creation before inserting the colgroup metadata entry.  This is intended\n for testing purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;before_insert_file, if true\\, force\n crash in table creation before inserting the file metadata entry.  This is intended for\n testing purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n ),,}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cursor_copy, if true\\, use the system allocator to make\n a copy of any data returned by a cursor operation and return the copy instead.  The copy is\n freed on the next cursor operation.  This allows memory sanitizers to detect inappropriate\n references to memory owned by cursors., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cursor_reposition, if true\\, for operations with snapshot\n isolation the cursor temporarily releases any page that requires force eviction\\, then\n repositions back to the page for further operations.  A page release encourages eviction of\n hot or large pages\\, which is more likely to succeed without a cursor keeping the page\n pinned., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;eviction, if\n true\\, modify internal algorithms to change skew to force history store eviction to happen\n more aggressively.  This includes but is not limited to not skewing newest\\, not favoring\n leaf pages\\, and modifying the eviction score mechanism., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;eviction_checkpoint_ts_ordering, if true\\, act as if eviction\n is being run in parallel to checkpoint.  We should return EBUSY in eviction if we detect any\n timestamp ordering issue., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;log_retention, adjust log removal to retain at least this\n number of log files.  (Warning: this option can remove log files required for recovery if no\n checkpoints have yet been done and the number of log files exceeds the configured value.  As\n WiredTiger cannot detect the difference between a system that has not yet checkpointed and\n one that will never checkpoint\\, it might discard log files before any checkpoint is done.)\n Ignored if set to 0., an integer between \\c 0 and \\c 1024; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;realloc_exact, if true\\, reallocation of memory will only\n provide the exact amount requested.  This will help with spotting memory allocation issues\n more easily., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n realloc_malloc, if true\\, every realloc call will force a new memory allocation by using\n malloc., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;rollback_error,\n return a WT_ROLLBACK error from a transaction operation about every Nth operation to simulate\n a collision., an integer between \\c 0 and \\c 10M; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;slow_checkpoint, if true\\, slow down checkpoint creation by\n slowing down internal page processing., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;stress_skiplist, Configure various internal parameters to\n encourage race conditions and other issues with internal skip lists\\, e.g.  using a more\n dense representation., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n table_logging, if true\\, write transaction related information to the log for all\n operations\\, even operations for tables with logging turned off.  This additional logging\n information is intended for debugging and is informational only\\, that is\\, it is ignored\n during recovery., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n tiered_flush_error_continue, on a write to tiered storage\\, continue when an error occurs., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;update_restore_evict, if\n true\\, control all dirty page evictions through forcing update restore eviction., a boolean\n flag; default \\c false.}\n @config{ ),,}\n @config{disaggregated = (, configure disaggregated storage for this connection., a set of\n related configuration options defined as follows.}\n @config{ ),,}\n @config{error_prefix, prefix string for error messages., a string; default empty.}\n @config{eviction = (, eviction configuration options., a set of related configuration options\n defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;app_eviction_min_cache_fill_ratio, This\n setting establishes a minimum cache fill ratio that must be met before application threads\n can start assisting with eviction.  The value is a percentage between 0 and 50\\, with 0\n disabling the feature.  For it to have any effect\\, this minimum ratio must be higher than\n the existing \\c eviction_dirty_trigger or \\c eviction_update_trigger and less than \\c\n eviction_trigger.  Essentially\\, the standard dirty or update triggers won't become active\n until the cache fill ratio first reaches this new\\, higher threshold., an integer between \\c\n 0 and \\c 50; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cache_tolerance_for_app_eviction,\n This setting establishes a tolerance level for the configured \\c eviction_dirty_trigger and\n \\c eviction_update_trigger.  The value is a percentage between 0 and 100\\, with 0 treating \\c\n eviction_dirty_trigger and \\c eviction_update_trigger as hard limit.  The configured\n percentage will be taken in increments of 10 only\\, by applying the floor to the given\n percentage value., an integer between \\c 0 and \\c 100; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;evict_sample_inmem, If no in-memory ref is found on the root\n page\\, attempt to locate a random in-memory page by examining all entries on the root page.,\n a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;incremental_app_eviction,\n Only a part of application threads will participate in cache management when a cache\n threshold reaches its trigger limit., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;legacy_page_visit_strategy, Use legacy page visit strategy\n for eviction.  Using this option is highly discouraged as it will re-introduce a bug where\n eviction can fail to find older cache content., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prefer_scrub_eviction, Change the eviction strategy to scrub\n eviction when the cache usage is under half way between the target limit to the trigger\n limit., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n skip_update_obsolete_check, Skip checking for obsolete updates whenever an update operation\n is performed., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n threads_max, maximum number of threads WiredTiger will start to help evict pages from cache.\n The number of threads started will vary depending on the current eviction load.  Each\n eviction worker thread uses a session from the configured session_max., an integer between \\c\n 1 and \\c 64; default \\c 8.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;threads_min, minimum number of\n threads WiredTiger will start to help evict pages from cache.  The number of threads\n currently running will vary depending on the current eviction load., an integer between \\c 1\n and \\c 64; default \\c 1.}\n @config{ ),,}\n @config{eviction_checkpoint_target, perform eviction at the beginning of checkpoints to bring\n the dirty content in cache to this level.  It is a percentage of the cache size if the value\n is within the range of 0 to 100 or an absolute size when greater than 100. The value is not\n allowed to exceed the \\c cache_size.  Ignored if set to zero., an integer between \\c 0 and \\c\n 10TB; default \\c 1.}\n @config{eviction_dirty_target, perform eviction in worker threads when the cache contains at\n least this much dirty content.  It is a percentage of the cache size if the value is within\n the range of 1 to 100 or an absolute size when greater than 100. The value is not allowed to\n exceed the \\c cache_size and has to be lower than its counterpart \\c eviction_dirty_trigger.,\n an integer between \\c 1 and \\c 10TB; default \\c 5.}\n @config{eviction_dirty_trigger, trigger application threads to perform eviction when the\n cache contains at least this much dirty content.  It is a percentage of the cache size if the\n value is within the range of 1 to 100 or an absolute size when greater than 100. The value is\n not allowed to exceed the \\c cache_size and has to be greater than its counterpart \\c\n eviction_dirty_target.  This setting only alters behavior if it is lower than\n eviction_trigger., an integer between \\c 1 and \\c 10TB; default \\c 20.}\n @config{eviction_target, perform eviction in worker threads when the cache contains at least\n this much content.  It is a percentage of the cache size if the value is within the range of\n 10 to 100 or an absolute size when greater than 100. The value is not allowed to exceed the\n \\c cache_size and has to be lower than its counterpart \\c eviction_trigger., an integer\n between \\c 10 and \\c 10TB; default \\c 80.}\n @config{eviction_trigger, trigger application threads to perform eviction when the cache\n contains at least this much content.  It is a percentage of the cache size if the value is\n within the range of 10 to 100 or an absolute size when greater than 100. The value is not\n allowed to exceed the \\c cache_size and has to be greater than its counterpart \\c\n eviction_target., an integer between \\c 10 and \\c 10TB; default \\c 95.}\n @config{eviction_updates_target, perform eviction in worker threads when the cache contains\n at least this many bytes of updates.  It is a percentage of the cache size if the value is\n within the range of 0 to 100 or an absolute size when greater than 100. Calculated as half of\n \\c eviction_dirty_target by default unless precise checkpoints are enabled\\, in which case it\n is equal to the \\c eviction_dirty_target.  The value is not allowed to exceed the \\c\n cache_size and has to be lower than its counterpart \\c eviction_updates_trigger., an integer\n between \\c 0 and \\c 10TB; default \\c 0.}\n @config{eviction_updates_trigger, trigger application threads to perform eviction when the\n cache contains at least this many bytes of updates.  It is a percentage of the cache size if\n the value is within the range of 1 to 100 or an absolute size when greater than 100\\.\n Calculated as half of \\c eviction_dirty_trigger by default.  The value is not allowed to\n exceed the \\c cache_size and has to be greater than its counterpart \\c\n eviction_updates_target.  This setting only alters behavior if it is lower than \\c\n eviction_trigger., an integer between \\c 0 and \\c 10TB; default \\c 0.}\n @config{extra_diagnostics, enable additional diagnostics in WiredTiger.  These additional\n diagnostics include diagnostic assertions that can cause WiredTiger to abort when an invalid\n state is detected.  Options are given as a list\\, such as\n <code>\"extra_diagnostics=[out_of_order\\,visibility]\"</code>. Choosing \\c all enables all\n assertions.  When WiredTiger is compiled with \\c HAVE_DIAGNOSTIC=1 all assertions are enabled\n and cannot be reconfigured., a list\\, with values chosen from the following options: \\c\n \"all\"\\, \\c \"checkpoint_validate\"\\, \\c \"cursor_check\"\\, \\c \"disk_validate\"\\, \\c\n \"eviction_check\"\\, \\c \"generation_check\"\\, \\c \"hs_validate\"\\, \\c \"key_out_of_order\"\\, \\c\n \"log_validate\"\\, \\c \"prepared\"\\, \\c \"slow_operation\"\\, \\c \"txn_visibility\"; default \\c [].}\n @config{file_manager = (, control how file handles are managed., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n close_handle_minimum, number of handles open before the file manager will look for handles to\n close., an integer greater than or equal to \\c 0; default \\c 250.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;close_idle_time, amount of time in seconds a file handle\n needs to be idle before attempting to close it.  A setting of 0 means that idle handles are\n not closed., an integer between \\c 0 and \\c 100000; default \\c 30.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;close_scan_interval, interval in seconds at which to check\n for files that are inactive and close them., an integer between \\c 1 and \\c 100000; default\n \\c 10.}\n @config{ ),,}\n @config{generation_drain_timeout_ms, the number of milliseconds to wait for a resource to\n drain before timing out.  In the diagnostic mode\\, it will log an error and crash the system.\n In the production mode\\, it will only log an error.  Default will wait for 4 minutes\\, 0 will\n wait forever., an integer greater than or equal to \\c 0; default \\c 240000.}\n @config{heuristic_controls = (, control the behavior of various optimizations.  This is\n primarily used as a mechanism for rolling out changes to internal heuristics while providing\n a mechanism for quickly reverting to prior behavior in the field., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n checkpoint_cleanup_obsolete_tw_pages_dirty_max, maximum number of obsolete time window pages\n that can be marked as dirty per btree in a single checkpoint by the checkpoint cleanup., an\n integer between \\c 0 and \\c 100000; default \\c 100.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n eviction_obsolete_tw_pages_dirty_max, maximum number of obsolete time window pages that can\n be marked dirty per btree in a single checkpoint by the eviction threads., an integer between\n \\c 0 and \\c 100000; default \\c 100.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;obsolete_tw_btree_max,\n maximum number of btrees that can be checked for obsolete time window cleanup in a single\n checkpoint., an integer between \\c 0 and \\c 500000; default \\c 100.}\n @config{ ),,}\n @config{history_store = (, history store configuration options., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;file_max, the\n maximum number of bytes that WiredTiger is allowed to use for its history store mechanism.\n If the history store file exceeds this size\\, a panic will be triggered.  The default value\n means that the history store file is unbounded and may use as much space as the filesystem\n will accommodate.  The minimum non-zero setting is 100MB., an integer greater than or equal\n to \\c 0; default \\c 0.}\n @config{ ),,}\n @config{io_capacity = (, control how many bytes per second are written and read.  Exceeding\n the capacity results in throttling., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;chunk_cache, number of bytes per second available\n to the chunk cache.  The minimum non-zero setting is 1MB., an integer between \\c 0 and \\c\n 1TB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;total, number of bytes per second\n available to all subsystems in total.  When set\\, decisions about what subsystems are\n throttled\\, and in what proportion\\, are made internally.  The minimum non-zero setting is\n 1MB., an integer between \\c 0 and \\c 1TB; default \\c 0.}\n @config{ ),,}\n @config{json_output, enable JSON formatted messages on the event handler interface.  Options\n are given as a list\\, where each option specifies an event handler category e.g.  'error'\n represents the messages from the WT_EVENT_HANDLER::handle_error method., a list\\, with values\n chosen from the following options: \\c \"error\"\\, \\c \"message\"; default \\c [].}\n @config{log = (, enable logging.  Enabling logging uses three sessions from the configured\n session_max., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;os_cache_dirty_pct, maximum dirty system buffer cache usage\\,\n as a percentage of the log's \\c file_max.  If non-zero\\, schedule writes for dirty blocks\n belonging to the log in the system buffer cache after that percentage of the log has been\n written into the buffer cache without an intervening file sync., an integer between \\c 0 and\n \\c 100; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prealloc, pre-allocate log files., a\n boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prealloc_init_count, initial\n number of pre-allocated log files., an integer between \\c 1 and \\c 500; default \\c 1.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;remove, automatically remove unneeded log files., a boolean\n flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;zero_fill, manually write zeroes into\n log files., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{operation_timeout_ms, this option is no longer supported\\, retained for backward\n compatibility., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{operation_tracking = (, enable tracking of performance-critical functions.  See @ref\n operation_tracking for more information., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, enable operation tracking subsystem., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;path, the name of a\n directory into which operation tracking files are written.  The directory must already exist.\n If the value is not an absolute path\\, the path is relative to the database home (see @ref\n absolute_path for more information)., a string; default \\c \".\".}\n @config{ ),,}\n @config{page_delta = (, configure page delta settings for this connection., a set of related\n configuration options defined as follows.}\n @config{ ),,}\n @config{rollback_to_stable = (, rollback tables to an earlier point in time\\, discarding all\n updates to checkpoint durable tables that have durable times more recent than the current\n global stable timestamp., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;threads, maximum number of threads WiredTiger will start to\n help RTS. Each RTS worker thread uses a session from the configured WT_RTS_MAX_WORKERS., an\n integer between \\c 0 and \\c 10; default \\c 4.}\n @config{ ),,}\n @config{shared_cache = (, shared cache configuration options.  A database should configure\n either a cache_size or a shared_cache not both.  Enabling a shared cache uses a session from\n the configured session_max.  A shared cache can not have absolute values configured for cache\n eviction settings., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;chunk, the granularity that a shared cache is redistributed.,\n an integer between \\c 1MB and \\c 10TB; default \\c 10MB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n name, the name of a cache that is shared between databases or \\c \"none\" when no shared cache\n is configured., a string; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;quota, maximum\n size of cache this database can be allocated from the shared cache.  Defaults to the entire\n shared cache size., an integer; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;reserve,\n amount of cache this database is guaranteed to have available from the shared cache.  This\n setting is per database.  Defaults to the chunk size., an integer; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;size, maximum memory to allocate for the shared cache.\n Setting this will update the value if one is already set., an integer between \\c 1MB and \\c\n 10TB; default \\c 500MB.}\n @config{ ),,}\n @config{statistics, Maintain database statistics\\, which may impact performance.  Choosing\n \"all\" maintains all statistics regardless of cost\\, \"fast\" maintains a subset of statistics\n that are relatively inexpensive\\, \"none\" turns off all statistics.  The \"clear\" configuration\n resets statistics after they are gathered\\, where appropriate (for example\\, a cache size\n statistic is not cleared\\, while the count of cursor insert operations will be cleared). When\n \"clear\" is configured for the database\\, gathered statistics are reset each time a statistics\n cursor is used to gather statistics\\, as well as each time statistics are logged using the \\c\n statistics_log configuration.  See @ref statistics for more information., a list\\, with\n values chosen from the following options: \\c \"all\"\\, \\c \"cache_walk\"\\, \\c \"fast\"\\, \\c\n \"none\"\\, \\c \"clear\"\\, \\c \"tree_walk\"; default \\c none.}\n @config{statistics_log = (, log any statistics the database is configured to maintain\\, to a\n file.  See @ref statistics for more information.  Enabling the statistics log server uses a\n session from the configured session_max., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;json, encode statistics in JSON format., a boolean\n flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;on_close, log statistics on database\n close., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;sources, if\n non-empty\\, include statistics for the list of \"file:\" data source URIs\\, if they are open at\n the time of the statistics logging., a list of strings; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;timestamp, a timestamp prepended to each log record.  May\n contain \\c strftime conversion specifications.  When \\c json is configured\\, defaults to \\c\n \"%Y-%m-%dT%H:%M:%S.000Z\"., a string; default \\c \"%b %d %H:%M:%S\".}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;wait, seconds to wait between each write of the log records;\n setting this value above 0 configures statistics logging., an integer between \\c 0 and \\c\n 100000; default \\c 0.}\n @config{ ),,}\n @config{tiered_storage = (, enable tiered storage.  Enabling tiered storage may use one\n session from the configured session_max., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;local_retention, time in seconds to retain data on\n tiered storage on the local tier for faster read access., an integer between \\c 0 and \\c\n 10000; default \\c 300.}\n @config{ ),,}\n @config{verbose, enable messages for various subsystems and operations.  Options are given as\n a list\\, where each message type can optionally define an associated verbosity level\\, such\n as <code>\"verbose=[eviction\\,read:1\\,rts:0]\"</code>. Verbosity levels that can be provided\n include <code>0</code> (INFO) and <code>1</code> through <code>5</code>\\, corresponding to\n (DEBUG_1) to (DEBUG_5). \\c all is a special case that defines the verbosity level for all\n categories not explicitly set in the config string., a list\\, with values chosen from the\n following options: \\c \"all\"\\, \\c \"api\"\\, \\c \"backup\"\\, \\c \"block\"\\, \\c \"block_cache\"\\, \\c\n \"checkpoint\"\\, \\c \"checkpoint_cleanup\"\\, \\c \"checkpoint_progress\"\\, \\c \"chunkcache\"\\, \\c\n \"compact\"\\, \\c \"compact_progress\"\\, \\c \"configuration\"\\, \\c \"disaggregated_storage\"\\, \\c\n \"error_returns\"\\, \\c \"eviction\"\\, \\c \"extension\"\\, \\c \"fileops\"\\, \\c \"generation\"\\, \\c\n \"handleops\"\\, \\c \"history_store\"\\, \\c \"history_store_activity\"\\, \\c \"layered\"\\, \\c\n \"live_restore\"\\, \\c \"live_restore_progress\"\\, \\c \"log\"\\, \\c \"metadata\"\\, \\c \"mutex\"\\, \\c\n \"out_of_order\"\\, \\c \"overflow\"\\, \\c \"page_delta\"\\, \\c \"prefetch\"\\, \\c \"read\"\\, \\c\n \"reconcile\"\\, \\c \"recovery\"\\, \\c \"recovery_progress\"\\, \\c \"rts\"\\, \\c \"salvage\"\\, \\c\n \"shared_cache\"\\, \\c \"split\"\\, \\c \"sweep\"\\, \\c \"temporary\"\\, \\c \"thread_group\"\\, \\c \"tiered\"\\,\n \\c \"timestamp\"\\, \\c \"transaction\"\\, \\c \"verify\"\\, \\c \"version\"\\, \\c \"write\"; default \\c [].}\n @configend\n @errors"]
    pub reconfigure: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " The home directory of the connection.\n\n @snippet ex_all.c Get the database home directory\n\n @param connection the connection handle\n @returns a pointer to a string naming the home directory"]
    pub get_home: ::std::option::Option<
        unsafe extern "C" fn(connection: *mut WT_CONNECTION) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Compile a configuration string to be used with an API.  The string returned by this\n method can be used with the indicated API call as its configuration argument.\n Precompiled strings should be used where configuration parsing has proved to be a\n performance bottleneck. The lifetime of a configuration string ends when the connection\n is closed. The number of compilation strings that can be made is limited by\n the \\c compile_configuration_count configuration in ::wiredtiger_open .\n\n Configuration strings containing '%d' or '%s' can have values bound, see\n WT_SESSION::bind_configuration.\n\n This API may change in future releases.\n\n @param connection the connection handle\n @param method the API to the configuration string applies to, e.g.\n \\c \"WT_SESSION.open_cursor\"\n @param str the configuration string to compile\n @param compiled the returned configuration string\n @errors"]
    pub compile_configuration: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            method: *const ::std::os::raw::c_char,
            str_: *const ::std::os::raw::c_char,
            compiled: *mut *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add configuration options for a method.  See\n @ref custom_ds_config_add for more information.\n\n @snippet ex_all.c Configure method configuration\n\n @param connection the connection handle\n @param method the method being configured\n @param uri the object type or NULL for all object types\n @param config the additional configuration's name and default value\n @param type the additional configuration's type (must be one of\n \\c \"boolean\"\\, \\c \"int\", \\c \"list\" or \\c \"string\")\n @param check the additional configuration check string, or NULL if\n none\n @errors"]
    pub configure_method: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            method: *const ::std::os::raw::c_char,
            uri: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
            type_: *const ::std::os::raw::c_char,
            check: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return if opening this handle created the database.\n\n @snippet ex_all.c Check if the database is newly created\n\n @param connection the connection handle\n @returns false (zero) if the connection existed before the call to\n ::wiredtiger_open, true (non-zero) if it was created by opening this\n handle."]
    pub is_new: ::std::option::Option<
        unsafe extern "C" fn(connection: *mut WT_CONNECTION) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Session handles\n @{\n/\n/*!\n Open a session.\n\n @snippet ex_all.c Open a session\n\n @param connection the connection handle\n @param event_handler An event handler. If <code>NULL</code>, the\n connection's event handler is used. See @ref event_message_handling\n for more information.\n @configstart{WT_CONNECTION.open_session, see dist/api_data.py}\n @config{cache_cursors, enable caching of cursors for reuse.  Any calls to WT_CURSOR::close\n for a cursor created in this session will mark the cursor as cached and keep it available to\n be reused for later calls to WT_SESSION::open_cursor.  Cached cursors may be eventually\n closed.  This value is inherited from ::wiredtiger_open \\c cache_cursors., a boolean flag;\n default \\c true.}\n @config{cache_max_wait_ms, the maximum number of milliseconds an application thread will wait\n for space to be available in cache before giving up.  Default value will be the global\n setting of the connection config.  0 will wait forever.  1 will never wait., an integer\n greater than or equal to \\c 0; default \\c 0.}\n @config{debug = (, configure debug specific behavior on a session.  Generally only used for\n internal testing purposes., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;checkpoint_fail_before_turtle_update, Fail before writing a\n turtle file at the end of a checkpoint., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;release_evict_page, Configure the session to evict the page\n when it is released and no longer needed., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{ignore_cache_size, when set\\, operations performed by this session ignore the cache\n size and are not blocked when the cache is full.  Note that use of this option for operations\n that create cache pressure can starve ordinary sessions that obey the cache size., a boolean\n flag; default \\c false.}\n @config{isolation, the default isolation level for operations in this session., a string\\,\n chosen from the following options: \\c \"read-uncommitted\"\\, \\c \"read-committed\"\\, \\c\n \"snapshot\"; default \\c snapshot.}\n @config{prefetch = (, Enable automatic detection of scans by applications\\, and attempt to\n pre-fetch future content into the cache., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, whether pre-fetch is enabled for this\n session., a boolean flag; default \\c false.}\n @config{ ),,}\n @configend\n @param[out] sessionp the new session handle\n @errors"]
    pub open_session: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            event_handler: *mut WT_EVENT_HANDLER,
            config: *const ::std::os::raw::c_char,
            sessionp: *mut *mut WT_SESSION,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Transactions\n @{\n/\n/*!\n Query the global transaction timestamp state.\n\n @snippet ex_all.c query timestamp\n\n @param connection the connection handle\n @param[out] hex_timestamp a buffer that will be set to the\n hexadecimal encoding of the timestamp being queried.  Must be large\n enough to hold a NUL terminated, hex-encoded 8B timestamp (17 bytes).\n @configstart{WT_CONNECTION.query_timestamp, see dist/api_data.py}\n @config{get, specify which timestamp to query: \\c all_durable returns the largest timestamp\n such that all timestamps up to and including that value have been committed (possibly bounded\n by the application-set \\c durable timestamp); \\c backup_checkpoint returns the stable\n timestamp of the checkpoint pinned for an open backup cursor; \\c last_checkpoint returns the\n timestamp of the most recent stable checkpoint; \\c oldest_timestamp returns the most recent\n \\c oldest_timestamp set with WT_CONNECTION::set_timestamp; \\c oldest_reader returns the\n minimum of the read timestamps of all active readers; \\c pinned returns the minimum of the \\c\n oldest_timestamp and the read timestamps of all active readers; \\c recovery returns the\n timestamp of the most recent stable checkpoint taken prior to a shutdown; \\c stable_timestamp\n returns the most recent \\c stable_timestamp set with WT_CONNECTION::set_timestamp.  (The \\c\n oldest and \\c stable arguments are deprecated short-hand for \\c oldest_timestamp and \\c\n stable_timestamp\\, respectively.) See @ref timestamp_global_api., a string\\, chosen from the\n following options: \\c \"all_durable\"\\, \\c \"backup_checkpoint\"\\, \\c \"last_checkpoint\"\\, \\c\n \"oldest\"\\, \\c \"oldest_reader\"\\, \\c \"oldest_timestamp\"\\, \\c \"pinned\"\\, \\c \"recovery\"\\, \\c\n \"stable\"\\, \\c \"stable_timestamp\"; default \\c all_durable.}\n @configend\n\n A timestamp of 0 is returned if the timestamp is not available or has not been set.\n @errors"]
    pub query_timestamp: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            hex_timestamp: *mut ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set a global transaction timestamp.\n\n @snippet ex_all.c set durable timestamp\n\n @snippet ex_all.c set oldest timestamp\n\n @snippet ex_all.c set stable timestamp\n\n @param connection the connection handle\n @configstart{WT_CONNECTION.set_timestamp, see dist/api_data.py}\n @config{durable_timestamp, temporarily set the system's maximum durable timestamp\\, bounding\n the timestamp returned by WT_CONNECTION::query_timestamp with the \\c all_durable\n configuration.  Calls to WT_CONNECTION::query_timestamp will ignore durable timestamps\n greater than the specified value until a subsequent transaction commit advances the maximum\n durable timestamp\\, or rollback-to-stable resets the value.  See @ref timestamp_global_api.,\n a string; default empty.}\n @config{oldest_timestamp, future commits and queries will be no earlier than the specified\n timestamp.  Values must be monotonically increasing.  The value must not be newer than the\n current stable timestamp.  See @ref timestamp_global_api., a string; default empty.}\n @config{stable_timestamp, checkpoints will not include commits that are newer than the\n specified timestamp in tables configured with \\c \"log=(enabled=false)\". Values must be\n monotonically increasing.  The value must not be older than the current oldest timestamp.\n See @ref timestamp_global_api., a string; default empty.}\n @configend\n @errors"]
    pub set_timestamp: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Rollback tables to an earlier point in time, discarding all updates to checkpoint durable\n tables that have commit times more recent than the current global stable timestamp.\n\n No updates made to logged tables or updates made without an associated commit timestamp\n will be discarded. See @ref timestamp_misc.\n\n Applications must resolve all running transactions and close or reset all open cursors\n before the call, and no other API calls should be made for the duration of the call.\n\n @snippet ex_all.c rollback to stable\n\n @param connection the connection handle\n @configstart{WT_CONNECTION.rollback_to_stable, see dist/api_data.py}\n @config{dryrun, perform the checks associated with RTS\\, but don't modify any data., a\n boolean flag; default \\c false.}\n @config{threads, maximum number of threads WiredTiger will start to help RTS. Each RTS worker\n thread uses a session from the configured WT_RTS_MAX_WORKERS., an integer between \\c 0 and \\c\n 10; default \\c 4.}\n @configend\n @errors\n An error should occur only in the case of a system problem, and an application typically\n will retry WT_CONNECTION::rollback_to_stable on error, or fail outright."]
    pub rollback_to_stable: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @name Extensions\n @{\n/\n/*!\n Load an extension.\n\n @snippet ex_all.c Load an extension\n\n @param connection the connection handle\n @param path the filename of the extension module, or \\c \"local\" to\n search the current application binary for the initialization\n function, see @ref extensions for more details.\n @configstart{WT_CONNECTION.load_extension, see dist/api_data.py}\n @config{config, configuration string passed to the entry point of the extension as its\n WT_CONFIG_ARG argument., a string; default empty.}\n @config{early_load, whether this extension should be loaded at the beginning of\n ::wiredtiger_open.  Only applicable to extensions loaded via the wiredtiger_open\n configurations string., a boolean flag; default \\c false.}\n @config{entry, the entry point of the extension\\, called to initialize the extension when it\n is loaded.  The signature of the function must match ::wiredtiger_extension_init., a string;\n default \\c wiredtiger_extension_init.}\n @config{terminate, an optional function in the extension that is called before the extension\n is unloaded during WT_CONNECTION::close.  The signature of the function must match\n ::wiredtiger_extension_terminate., a string; default \\c wiredtiger_extension_terminate.}\n @configend\n @errors"]
    pub load_extension: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            path: *const ::std::os::raw::c_char,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add a custom data source.  See @ref custom_data_sources for more\n information.\n\n The application must first implement the WT_DATA_SOURCE interface\n and then register the implementation with WiredTiger:\n\n @snippet ex_data_source.c WT_DATA_SOURCE register\n\n @param connection the connection handle\n @param prefix the URI prefix for this data source, e.g., \"file:\"\n @param data_source the application-supplied implementation of\n  WT_DATA_SOURCE to manage this data source.\n @configempty{WT_CONNECTION.add_data_source, see dist/api_data.py}\n @errors"]
    pub add_data_source: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            prefix: *const ::std::os::raw::c_char,
            data_source: *mut WT_DATA_SOURCE,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add a custom collation function.\n\n The application must first implement the WT_COLLATOR interface and\n then register the implementation with WiredTiger:\n\n @snippet ex_all.c WT_COLLATOR register\n\n @param connection the connection handle\n @param name the name of the collation to be used in calls to\n  WT_SESSION::create, may not be \\c \"none\"\n @param collator the application-supplied collation handler\n @configempty{WT_CONNECTION.add_collator, see dist/api_data.py}\n @errors"]
    pub add_collator: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            collator: *mut WT_COLLATOR,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add a compression function.\n\n The application must first implement the WT_COMPRESSOR interface\n and then register the implementation with WiredTiger:\n\n @snippet nop_compress.c WT_COMPRESSOR initialization structure\n\n @snippet nop_compress.c WT_COMPRESSOR initialization function\n\n @param connection the connection handle\n @param name the name of the compression function to be used in calls\n  to WT_SESSION::create, may not be \\c \"none\"\n @param compressor the application-supplied compression handler\n @configempty{WT_CONNECTION.add_compressor, see dist/api_data.py}\n @errors"]
    pub add_compressor: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            compressor: *mut WT_COMPRESSOR,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add an encryption function.\n\n The application must first implement the WT_ENCRYPTOR interface\n and then register the implementation with WiredTiger:\n\n @snippet nop_encrypt.c WT_ENCRYPTOR initialization structure\n\n @snippet nop_encrypt.c WT_ENCRYPTOR initialization function\n\n @param connection the connection handle\n @param name the name of the encryption function to be used in calls\n  to WT_SESSION::create, may not be \\c \"none\"\n @param encryptor the application-supplied encryption handler\n @configempty{WT_CONNECTION.add_encryptor, see dist/api_data.py}\n @errors"]
    pub add_encryptor: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            encryptor: *mut WT_ENCRYPTOR,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Configure a custom file system.\n\n This method can only be called from an early loaded extension\n module. The application must first implement the WT_FILE_SYSTEM\n interface and then register the implementation with WiredTiger:\n\n @snippet ex_file_system.c WT_FILE_SYSTEM register\n\n @param connection the connection handle\n @param fs the populated file system structure\n @configempty{WT_CONNECTION.set_file_system, see dist/api_data.py}\n @errors"]
    pub set_file_system: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            fs: *mut WT_FILE_SYSTEM,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add a page and log service implementation.\n\n The application must first implement the WT_PAGE_LOG\n interface and then register the implementation with WiredTiger:\n\n @param connection the connection handle\n @param name the name of the storage source implementation\n @param page_log the populated page log service structure\n @configempty{WT_CONNECTION.add_page_log, see dist/api_data.py}\n @errors"]
    pub add_page_log: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            page_log: *mut WT_PAGE_LOG,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Add a storage source implementation.\n\n The application must first implement the WT_STORAGE_SOURCE\n interface and then register the implementation with WiredTiger:\n\n @snippet ex_storage_source.c WT_STORAGE_SOURCE register\n\n @param connection the connection handle\n @param name the name of the storage source implementation\n @param storage_source the populated storage source structure\n @configempty{WT_CONNECTION.add_storage_source, see dist/api_data.py}\n @errors"]
    pub add_storage_source: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            storage_source: *mut WT_STORAGE_SOURCE,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Get a page log service implementation.\n\n Look up a page log service by name and return it. The returned page log service\n must be released by calling WT_PAGE_LOG::terminate.\n\n @snippet ex_storage_source.c WT_PAGE_LOG register\n\n @param connection the connection handle\n @param name the name of the page log service implementation\n @param storage_source the page log service structure\n @errors"]
    pub get_page_log: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            page_logp: *mut *mut WT_PAGE_LOG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Get a storage source implementation.\n\n Look up a storage source by name and return it. The returned storage source\n must be released by calling WT_STORAGE_SOURCE::terminate.\n\n @snippet ex_storage_source.c WT_STORAGE_SOURCE register\n\n @param connection the connection handle\n @param name the name of the storage source implementation\n @param storage_source the storage source structure\n @errors"]
    pub get_storage_source: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            name: *const ::std::os::raw::c_char,
            storage_sourcep: *mut *mut WT_STORAGE_SOURCE,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Set a global context parameter, which tells WiredTiger about relevant changes\n in the running system, such as the state of the page log service.\n\n @snippet ex_all.c Set the last materialized page log LSN by the page log service\n\n @param connection the connection handle\n @param which the context parameter being set (see ::WT_CONTEXT_TYPE for available options).\n @param value the value\n @errors"]
    pub set_context_uint: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            which: WT_CONTEXT_TYPE,
            value: u64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Dump any logged error messages into the event handler and clear the error log. This works\n only if this level of diagnostics is enabled.\n\n @param connection the connection handle\n @errors"]
    pub dump_error_log: ::std::option::Option<
        unsafe extern "C" fn(connection: *mut WT_CONNECTION) -> ::std::os::raw::c_int,
    >,
    #[doc = " Configure a key provider system.\n\n This method can only be called from an early loaded extension\n module. The application must first implement the WT_KEY_PROVIDER\n interface and then register the implementation with WiredTiger:\n\n @param connection the connection handle\n @param km the key provider structure\n @configempty{WT_CONNECTION.set_key_provider, see dist/api_data.py}\n @errors"]
    pub set_key_provider: ::std::option::Option<
        unsafe extern "C" fn(
            connection: *mut WT_CONNECTION,
            km: *mut WT_KEY_PROVIDER,
            config: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return a reference to the WiredTiger extension functions.\n\n @snippet ex_data_source.c WT_EXTENSION_API declaration\n\n @param wt_conn the WT_CONNECTION handle\n @returns a reference to a WT_EXTENSION_API structure."]
    pub get_extension_api: ::std::option::Option<
        unsafe extern "C" fn(wt_conn: *mut WT_CONNECTION) -> *mut WT_EXTENSION_API,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_connection"][::std::mem::size_of::<__wt_connection>() - 200usize];
    ["Alignment of __wt_connection"][::std::mem::align_of::<__wt_connection>() - 8usize];
    ["Offset of field: __wt_connection::close"]
        [::std::mem::offset_of!(__wt_connection, close) - 0usize];
    ["Offset of field: __wt_connection::debug_info"]
        [::std::mem::offset_of!(__wt_connection, debug_info) - 8usize];
    ["Offset of field: __wt_connection::reconfigure"]
        [::std::mem::offset_of!(__wt_connection, reconfigure) - 16usize];
    ["Offset of field: __wt_connection::get_home"]
        [::std::mem::offset_of!(__wt_connection, get_home) - 24usize];
    ["Offset of field: __wt_connection::compile_configuration"]
        [::std::mem::offset_of!(__wt_connection, compile_configuration) - 32usize];
    ["Offset of field: __wt_connection::configure_method"]
        [::std::mem::offset_of!(__wt_connection, configure_method) - 40usize];
    ["Offset of field: __wt_connection::is_new"]
        [::std::mem::offset_of!(__wt_connection, is_new) - 48usize];
    ["Offset of field: __wt_connection::open_session"]
        [::std::mem::offset_of!(__wt_connection, open_session) - 56usize];
    ["Offset of field: __wt_connection::query_timestamp"]
        [::std::mem::offset_of!(__wt_connection, query_timestamp) - 64usize];
    ["Offset of field: __wt_connection::set_timestamp"]
        [::std::mem::offset_of!(__wt_connection, set_timestamp) - 72usize];
    ["Offset of field: __wt_connection::rollback_to_stable"]
        [::std::mem::offset_of!(__wt_connection, rollback_to_stable) - 80usize];
    ["Offset of field: __wt_connection::load_extension"]
        [::std::mem::offset_of!(__wt_connection, load_extension) - 88usize];
    ["Offset of field: __wt_connection::add_data_source"]
        [::std::mem::offset_of!(__wt_connection, add_data_source) - 96usize];
    ["Offset of field: __wt_connection::add_collator"]
        [::std::mem::offset_of!(__wt_connection, add_collator) - 104usize];
    ["Offset of field: __wt_connection::add_compressor"]
        [::std::mem::offset_of!(__wt_connection, add_compressor) - 112usize];
    ["Offset of field: __wt_connection::add_encryptor"]
        [::std::mem::offset_of!(__wt_connection, add_encryptor) - 120usize];
    ["Offset of field: __wt_connection::set_file_system"]
        [::std::mem::offset_of!(__wt_connection, set_file_system) - 128usize];
    ["Offset of field: __wt_connection::add_page_log"]
        [::std::mem::offset_of!(__wt_connection, add_page_log) - 136usize];
    ["Offset of field: __wt_connection::add_storage_source"]
        [::std::mem::offset_of!(__wt_connection, add_storage_source) - 144usize];
    ["Offset of field: __wt_connection::get_page_log"]
        [::std::mem::offset_of!(__wt_connection, get_page_log) - 152usize];
    ["Offset of field: __wt_connection::get_storage_source"]
        [::std::mem::offset_of!(__wt_connection, get_storage_source) - 160usize];
    ["Offset of field: __wt_connection::set_context_uint"]
        [::std::mem::offset_of!(__wt_connection, set_context_uint) - 168usize];
    ["Offset of field: __wt_connection::dump_error_log"]
        [::std::mem::offset_of!(__wt_connection, dump_error_log) - 176usize];
    ["Offset of field: __wt_connection::set_key_provider"]
        [::std::mem::offset_of!(__wt_connection, set_key_provider) - 184usize];
    ["Offset of field: __wt_connection::get_extension_api"]
        [::std::mem::offset_of!(__wt_connection, get_extension_api) - 192usize];
};
unsafe extern "C" {
    #[doc = " Open a connection to a database.\n\n @snippet ex_all.c Open a connection\n\n @param home The path to the database home directory.  See @ref home\n for more information.\n @param event_handler An event handler. If <code>NULL</code>, a default\n event handler is installed that writes error messages to stderr. See\n @ref event_message_handling for more information.\n @configstart{wiredtiger_open, see dist/api_data.py}\n @config{backup_restore_target, If non-empty and restoring from a backup\\, restore only the table\n object targets listed.  WiredTiger will remove all the metadata entries for the tables that are\n not listed in the list from the reconstructed metadata.  The target list must include URIs of\n type \\c table:., a list of strings; default empty.}\n @config{block_cache = (, block cache configuration options., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;blkcache_eviction_aggression,\n seconds an unused block remains in the cache before it is evicted., an integer between \\c 1 and\n \\c 7200; default \\c 1800.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cache_on_checkpoint, cache blocks\n written by a checkpoint., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n cache_on_writes, cache blocks as they are written (other than checkpoint blocks)., a boolean\n flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, enable block cache., a boolean\n flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;full_target, the fraction of the block\n cache that must be full before eviction will remove unused blocks., an integer between \\c 30 and\n \\c 100; default \\c 95.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;hashsize, number of buckets in the\n hashtable that keeps track of blocks., an integer between \\c 512 and \\c 256K; default \\c 32768.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;max_percent_overhead, maximum tolerated overhead expressed as the\n number of blocks added and removed as percent of blocks looked up; cache population and eviction\n will be suppressed if the overhead exceeds the threshold., an integer between \\c 1 and \\c 500;\n default \\c 10.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;nvram_path, the absolute path to the file system\n mounted on the NVRAM device., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n percent_file_in_dram, bypass cache for a file if the set percentage of the file fits in system\n DRAM (as specified by block_cache.system_ram)., an integer between \\c 0 and \\c 100; default \\c\n 50.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;size, maximum memory to allocate for the block cache., an\n integer between \\c 0 and \\c 10TB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;system_ram, the\n bytes of system DRAM available for caching filesystem blocks., an integer between \\c 0 and \\c\n 1024GB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;type, cache location: DRAM or NVRAM., a\n string; default empty.}\n @config{ ),,}\n @config{builtin_extension_config, A structure where the keys are the names of builtin extensions\n and the values are passed to WT_CONNECTION::load_extension as the \\c config parameter (for\n example\\, <code>builtin_extension_config={zlib={compression_level=3}}</code>)., a string; default\n empty.}\n @config{cache_cursors, enable caching of cursors for reuse.  This is the default value for any\n sessions created\\, and can be overridden in configuring \\c cache_cursors in\n WT_CONNECTION.open_session., a boolean flag; default \\c true.}\n @config{cache_max_wait_ms, the maximum number of milliseconds an application thread will wait for\n space to be available in cache before giving up.  Default or 0 will wait forever.  1 will never\n wait., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{cache_overhead, assume the heap allocator overhead is the specified percentage\\, and\n adjust the cache usage by that amount (for example\\, if there is 10GB of data in cache\\, a\n percentage of 10 means WiredTiger treats this as 11GB). This value is configurable because\n different heap allocators have different overhead and different workloads will have different\n heap allocation sizes and patterns\\, therefore applications may need to adjust this value based\n on allocator choice and behavior in measured workloads., an integer between \\c 0 and \\c 30;\n default \\c 8.}\n @config{cache_size, maximum heap memory to allocate for the cache.  A database should configure\n either \\c cache_size or \\c shared_cache but not both., an integer between \\c 1MB and \\c 10TB;\n default \\c 100MB.}\n @config{cache_stuck_timeout_ms, the number of milliseconds to wait before a stuck cache times out\n in diagnostic mode.  Default will wait for 5 minutes\\, 0 will wait forever., an integer greater\n than or equal to \\c 0; default \\c 300000.}\n @config{checkpoint = (, periodically checkpoint the database.  Enabling the checkpoint server\n uses a session from the configured \\c session_max., a set of related configuration options\n defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;log_size, wait for this amount of log record\n bytes to be written to the log between each checkpoint.  If non-zero\\, this value will use a\n minimum of the log file size.  A database can configure both log_size and wait to set an upper\n bound for checkpoints; setting this value above 0 configures periodic checkpoints., an integer\n between \\c 0 and \\c 2GB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;wait, seconds to wait\n between each checkpoint; setting this value above 0 configures periodic checkpoints., an integer\n between \\c 0 and \\c 100000; default \\c 0.}\n @config{ ),,}\n @config{checkpoint_cleanup = (, periodically checkpoint cleanup the database., a set of related\n configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;file_wait_ms, the\n number of milliseconds to wait between each file by the checkpoint cleanup\\, 0 will not wait., an\n integer greater than or equal to \\c 0; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;method,\n control how aggressively obsolete content is removed by reading the internal pages.  Default to\n none\\, which means no additional work is done to find obsolete content., a string\\, chosen from\n the following options: \\c \"none\"\\, \\c \"reclaim_space\"; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;wait, seconds to wait between each checkpoint cleanup., an\n integer between \\c 1 and \\c 100000; default \\c 300.}\n @config{ ),,}\n @config{checkpoint_sync, flush files to stable storage when closing or writing checkpoints., a\n boolean flag; default \\c true.}\n @config{chunk_cache = (, chunk cache configuration options., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;capacity, maximum memory or storage\n to use for the chunk cache., an integer between \\c 512KB and \\c 100TB; default \\c 10GB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;chunk_cache_evict_trigger, chunk cache percent full that triggers\n eviction., an integer between \\c 0 and \\c 100; default \\c 90.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n chunk_size, size of cached chunks., an integer between \\c 512KB and \\c 100GB; default \\c 1MB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, enable chunk cache., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;hashsize, number of buckets in the hashtable that keeps track of\n objects., an integer between \\c 64 and \\c 1048576; default \\c 1024.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;pinned, List of \"table:\" URIs exempt from cache eviction.\n Capacity config overrides this\\, tables exceeding capacity will not be fully retained.  Table\n names can appear in both this and the preload list\\, but not in both this and the exclude list.\n Duplicate names are allowed., a list of strings; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n storage_path, the path (absolute or relative) to the file used as cache location.  This should be\n on a filesystem that supports file truncation.  All filesystems in common use meet this\n criteria., a string; default empty.}\n @config{ ),,}\n @config{compatibility = (, set compatibility version of database.  Changing the compatibility\n version requires that there are no active operations for the duration of the call., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;release,\n compatibility release version string., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n require_max, required maximum compatibility version of existing data files.  Must be greater than\n or equal to any release version set in the \\c release setting.  Has no effect if creating the\n database., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;require_min, required\n minimum compatibility version of existing data files.  Must be less than or equal to any release\n version set in the \\c release setting.  Has no effect if creating the database., a string;\n default empty.}\n @config{ ),,}\n @config{compile_configuration_count, the number of configuration strings that can be precompiled.\n Some configuration strings are compiled internally when the connection is opened., an integer\n greater than or equal to \\c 500; default \\c 1000.}\n @config{config_base, write the base configuration file if creating the database.  If \\c false in\n the config passed directly to ::wiredtiger_open\\, will ignore any existing base configuration\n file in addition to not creating one.  See @ref config_base for more information., a boolean\n flag; default \\c true.}\n @config{create, create the database if it does not exist., a boolean flag; default \\c false.}\n @config{debug_mode = (, control the settings of various extended debugging features., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n background_compact, if true\\, background compact aggressively removes compact statistics for a\n file and decreases the max amount of time a file can be skipped for., a boolean flag; default \\c\n false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;checkpoint_retention, adjust log removal to retain the\n log records of this number of checkpoints.  Zero or one means perform normal removal., an integer\n between \\c 0 and \\c 1024; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;configuration, if true\\,\n display invalid cache configuration warnings., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;corruption_abort, if true and built in diagnostic mode\\, dump\n core in the case of data corruption., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;crash_point = (, control the settings of crash points used for\n debugging., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;after_drop_colgroup, if true\\, force\n crash in table drop after dropping the table metadata entry.  This is intended for testing\n purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;after_drop_file, if true\\, force crash in\n table drop after dropping the colgroup metadata entry.  This is intended for testing purposes\n only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;before_insert_colgroup, if true\\, force\n crash in table creation before inserting the colgroup metadata entry.  This is intended for\n testing purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;before_insert_file, if true\\, force crash\n in table creation before inserting the file metadata entry.  This is intended for testing\n purposes only., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp; ),,}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cursor_copy, if true\\, use the system allocator to make a copy of\n any data returned by a cursor operation and return the copy instead.  The copy is freed on the\n next cursor operation.  This allows memory sanitizers to detect inappropriate references to\n memory owned by cursors., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n cursor_reposition, if true\\, for operations with snapshot isolation the cursor temporarily\n releases any page that requires force eviction\\, then repositions back to the page for further\n operations.  A page release encourages eviction of hot or large pages\\, which is more likely to\n succeed without a cursor keeping the page pinned., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;eviction, if true\\, modify internal algorithms to change skew to\n force history store eviction to happen more aggressively.  This includes but is not limited to\n not skewing newest\\, not favoring leaf pages\\, and modifying the eviction score mechanism., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;eviction_checkpoint_ts_ordering,\n if true\\, act as if eviction is being run in parallel to checkpoint.  We should return EBUSY in\n eviction if we detect any timestamp ordering issue., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;log_retention, adjust log removal to retain at least this number\n of log files.  (Warning: this option can remove log files required for recovery if no checkpoints\n have yet been done and the number of log files exceeds the configured value.  As WiredTiger\n cannot detect the difference between a system that has not yet checkpointed and one that will\n never checkpoint\\, it might discard log files before any checkpoint is done.) Ignored if set to\n 0., an integer between \\c 0 and \\c 1024; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n realloc_exact, if true\\, reallocation of memory will only provide the exact amount requested.\n This will help with spotting memory allocation issues more easily., a boolean flag; default \\c\n false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;realloc_malloc, if true\\, every realloc call will force a\n new memory allocation by using malloc., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;rollback_error, return a WT_ROLLBACK error from a transaction\n operation about every Nth operation to simulate a collision., an integer between \\c 0 and \\c 10M;\n default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;slow_checkpoint, if true\\, slow down checkpoint\n creation by slowing down internal page processing., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;stress_skiplist, Configure various internal parameters to\n encourage race conditions and other issues with internal skip lists\\, e.g.  using a more dense\n representation., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n table_logging, if true\\, write transaction related information to the log for all operations\\,\n even operations for tables with logging turned off.  This additional logging information is\n intended for debugging and is informational only\\, that is\\, it is ignored during recovery., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;tiered_flush_error_continue, on\n a write to tiered storage\\, continue when an error occurs., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;update_restore_evict, if true\\, control all dirty page evictions\n through forcing update restore eviction., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{disaggregated = (, configure disaggregated storage for this connection., a set of related\n configuration options defined as follows.}\n @config{ ),,}\n @config{encryption = (, configure an encryptor for system wide metadata and logs.  If a system\n wide encryptor is set\\, it is also used for encrypting data files and tables\\, unless encryption\n configuration is explicitly set for them when they are created with WT_SESSION::create., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;keyid, An\n identifier that identifies a unique instance of the encryptor.  It is stored in clear text\\, and\n thus is available when the WiredTiger database is reopened.  On the first use of a (name\\, keyid)\n combination\\, the WT_ENCRYPTOR::customize function is called with the keyid as an argument., a\n string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;name, Permitted values are \\c \"none\" or a\n custom encryption engine name created with WT_CONNECTION::add_encryptor.  See @ref encryption for\n more information., a string; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;secretkey, A\n string that is passed to the WT_ENCRYPTOR::customize function.  It is never stored in clear\n text\\, so must be given to any subsequent ::wiredtiger_open calls to reopen the database.  It\n must also be provided to any \"wt\" commands used with this database., a string; default empty.}\n @config{ ),,}\n @config{error_prefix, prefix string for error messages., a string; default empty.}\n @config{eviction = (, eviction configuration options., a set of related configuration options\n defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;app_eviction_min_cache_fill_ratio, This\n setting establishes a minimum cache fill ratio that must be met before application threads can\n start assisting with eviction.  The value is a percentage between 0 and 50\\, with 0 disabling the\n feature.  For it to have any effect\\, this minimum ratio must be higher than the existing \\c\n eviction_dirty_trigger or \\c eviction_update_trigger and less than \\c eviction_trigger.\n Essentially\\, the standard dirty or update triggers won't become active until the cache fill\n ratio first reaches this new\\, higher threshold., an integer between \\c 0 and \\c 50; default \\c\n 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;cache_tolerance_for_app_eviction, This setting establishes a\n tolerance level for the configured \\c eviction_dirty_trigger and \\c eviction_update_trigger.  The\n value is a percentage between 0 and 100\\, with 0 treating \\c eviction_dirty_trigger and \\c\n eviction_update_trigger as hard limit.  The configured percentage will be taken in increments of\n 10 only\\, by applying the floor to the given percentage value., an integer between \\c 0 and \\c\n 100; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;evict_sample_inmem, If no in-memory ref is\n found on the root page\\, attempt to locate a random in-memory page by examining all entries on\n the root page., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n incremental_app_eviction, Only a part of application threads will participate in cache management\n when a cache threshold reaches its trigger limit., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;legacy_page_visit_strategy, Use legacy page visit strategy for\n eviction.  Using this option is highly discouraged as it will re-introduce a bug where eviction\n can fail to find older cache content., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prefer_scrub_eviction, Change the eviction strategy to scrub\n eviction when the cache usage is under half way between the target limit to the trigger limit., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;skip_update_obsolete_check, Skip\n checking for obsolete updates whenever an update operation is performed., a boolean flag; default\n \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;threads_max, maximum number of threads WiredTiger will\n start to help evict pages from cache.  The number of threads started will vary depending on the\n current eviction load.  Each eviction worker thread uses a session from the configured\n session_max., an integer between \\c 1 and \\c 64; default \\c 8.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n threads_min, minimum number of threads WiredTiger will start to help evict pages from cache.  The\n number of threads currently running will vary depending on the current eviction load., an integer\n between \\c 1 and \\c 64; default \\c 1.}\n @config{ ),,}\n @config{eviction_checkpoint_target, perform eviction at the beginning of checkpoints to bring the\n dirty content in cache to this level.  It is a percentage of the cache size if the value is\n within the range of 0 to 100 or an absolute size when greater than 100. The value is not allowed\n to exceed the \\c cache_size.  Ignored if set to zero., an integer between \\c 0 and \\c 10TB;\n default \\c 1.}\n @config{eviction_dirty_target, perform eviction in worker threads when the cache contains at\n least this much dirty content.  It is a percentage of the cache size if the value is within the\n range of 1 to 100 or an absolute size when greater than 100. The value is not allowed to exceed\n the \\c cache_size and has to be lower than its counterpart \\c eviction_dirty_trigger., an integer\n between \\c 1 and \\c 10TB; default \\c 5.}\n @config{eviction_dirty_trigger, trigger application threads to perform eviction when the cache\n contains at least this much dirty content.  It is a percentage of the cache size if the value is\n within the range of 1 to 100 or an absolute size when greater than 100. The value is not allowed\n to exceed the \\c cache_size and has to be greater than its counterpart \\c eviction_dirty_target.\n This setting only alters behavior if it is lower than eviction_trigger., an integer between \\c 1\n and \\c 10TB; default \\c 20.}\n @config{eviction_target, perform eviction in worker threads when the cache contains at least this\n much content.  It is a percentage of the cache size if the value is within the range of 10 to 100\n or an absolute size when greater than 100. The value is not allowed to exceed the \\c cache_size\n and has to be lower than its counterpart \\c eviction_trigger., an integer between \\c 10 and \\c\n 10TB; default \\c 80.}\n @config{eviction_trigger, trigger application threads to perform eviction when the cache contains\n at least this much content.  It is a percentage of the cache size if the value is within the\n range of 10 to 100 or an absolute size when greater than 100. The value is not allowed to exceed\n the \\c cache_size and has to be greater than its counterpart \\c eviction_target., an integer\n between \\c 10 and \\c 10TB; default \\c 95.}\n @config{eviction_updates_target, perform eviction in worker threads when the cache contains at\n least this many bytes of updates.  It is a percentage of the cache size if the value is within\n the range of 0 to 100 or an absolute size when greater than 100. Calculated as half of \\c\n eviction_dirty_target by default unless precise checkpoints are enabled\\, in which case it is\n equal to the \\c eviction_dirty_target.  The value is not allowed to exceed the \\c cache_size and\n has to be lower than its counterpart \\c eviction_updates_trigger., an integer between \\c 0 and \\c\n 10TB; default \\c 0.}\n @config{eviction_updates_trigger, trigger application threads to perform eviction when the cache\n contains at least this many bytes of updates.  It is a percentage of the cache size if the value\n is within the range of 1 to 100 or an absolute size when greater than 100\\. Calculated as half of\n \\c eviction_dirty_trigger by default.  The value is not allowed to exceed the \\c cache_size and\n has to be greater than its counterpart \\c eviction_updates_target.  This setting only alters\n behavior if it is lower than \\c eviction_trigger., an integer between \\c 0 and \\c 10TB; default\n \\c 0.}\n @config{exclusive, fail if the database already exists\\, generally used with the \\c create\n option., a boolean flag; default \\c false.}\n @config{extensions, list of shared library extensions to load (using dlopen). Any values\n specified to a library extension are passed to WT_CONNECTION::load_extension as the \\c config\n parameter (for example\\, <code>extensions=(/path/ext.so={entry=my_entry})</code>)., a list of\n strings; default empty.}\n @config{extra_diagnostics, enable additional diagnostics in WiredTiger.  These additional\n diagnostics include diagnostic assertions that can cause WiredTiger to abort when an invalid\n state is detected.  Options are given as a list\\, such as\n <code>\"extra_diagnostics=[out_of_order\\,visibility]\"</code>. Choosing \\c all enables all\n assertions.  When WiredTiger is compiled with \\c HAVE_DIAGNOSTIC=1 all assertions are enabled and\n cannot be reconfigured., a list\\, with values chosen from the following options: \\c \"all\"\\, \\c\n \"checkpoint_validate\"\\, \\c \"cursor_check\"\\, \\c \"disk_validate\"\\, \\c \"eviction_check\"\\, \\c\n \"generation_check\"\\, \\c \"hs_validate\"\\, \\c \"key_out_of_order\"\\, \\c \"log_validate\"\\, \\c\n \"prepared\"\\, \\c \"slow_operation\"\\, \\c \"txn_visibility\"; default \\c [].}\n @config{file_extend, file size extension configuration.  If set\\, extend files of the given type\n in allocations of the given size\\, instead of a block at a time as each new block is written.\n For example\\, <code>file_extend=(data=16MB)</code>. If set to 0\\, disable file size extension for\n the given type.  For log files\\, the allowed range is between 100KB and 2GB; values larger than\n the configured maximum log size and the default config would extend log files in allocations of\n the maximum log file size., a list\\, with values chosen from the following options: \\c \"data\"\\,\n \\c \"log\"; default empty.}\n @config{file_manager = (, control how file handles are managed., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;close_handle_minimum, number of\n handles open before the file manager will look for handles to close., an integer greater than or\n equal to \\c 0; default \\c 250.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;close_idle_time, amount of time\n in seconds a file handle needs to be idle before attempting to close it.  A setting of 0 means\n that idle handles are not closed., an integer between \\c 0 and \\c 100000; default \\c 30.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;close_scan_interval, interval in seconds at which to check for\n files that are inactive and close them., an integer between \\c 1 and \\c 100000; default \\c 10.}\n @config{ ),,}\n @config{generation_drain_timeout_ms, the number of milliseconds to wait for a resource to drain\n before timing out.  In the diagnostic mode\\, it will log an error and crash the system.  In the\n production mode\\, it will only log an error.  Default will wait for 4 minutes\\, 0 will wait\n forever., an integer greater than or equal to \\c 0; default \\c 240000.}\n @config{hash = (, manage resources used by hash bucket arrays.  All values must be a power of\n two.  Note that setting large values can significantly increase memory usage inside WiredTiger.,\n a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n buckets, configure the number of hash buckets for most system hash arrays., an integer between \\c\n 64 and \\c 65536; default \\c 512.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;dhandle_buckets, configure the\n number of hash buckets for hash arrays relating to data handles., an integer between \\c 64 and \\c\n 65536; default \\c 512.}\n @config{ ),,}\n @config{heuristic_controls = (, control the behavior of various optimizations.  This is primarily\n used as a mechanism for rolling out changes to internal heuristics while providing a mechanism\n for quickly reverting to prior behavior in the field., a set of related configuration options\n defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n checkpoint_cleanup_obsolete_tw_pages_dirty_max, maximum number of obsolete time window pages that\n can be marked as dirty per btree in a single checkpoint by the checkpoint cleanup., an integer\n between \\c 0 and \\c 100000; default \\c 100.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;\n eviction_obsolete_tw_pages_dirty_max, maximum number of obsolete time window pages that can be\n marked dirty per btree in a single checkpoint by the eviction threads., an integer between \\c 0\n and \\c 100000; default \\c 100.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;obsolete_tw_btree_max, maximum\n number of btrees that can be checked for obsolete time window cleanup in a single checkpoint., an\n integer between \\c 0 and \\c 500000; default \\c 100.}\n @config{ ),,}\n @config{history_store = (, history store configuration options., a set of related configuration\n options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;file_max, the maximum number of\n bytes that WiredTiger is allowed to use for its history store mechanism.  If the history store\n file exceeds this size\\, a panic will be triggered.  The default value means that the history\n store file is unbounded and may use as much space as the filesystem will accommodate.  The\n minimum non-zero setting is 100MB., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{ ),,}\n @config{in_memory, keep data in memory only.  See @ref in_memory for more information., a boolean\n flag; default \\c false.}\n @config{io_capacity = (, control how many bytes per second are written and read.  Exceeding the\n capacity results in throttling., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;chunk_cache, number of bytes per second available to the chunk\n cache.  The minimum non-zero setting is 1MB., an integer between \\c 0 and \\c 1TB; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;total, number of bytes per second available to all subsystems in\n total.  When set\\, decisions about what subsystems are throttled\\, and in what proportion\\, are\n made internally.  The minimum non-zero setting is 1MB., an integer between \\c 0 and \\c 1TB;\n default \\c 0.}\n @config{ ),,}\n @config{json_output, enable JSON formatted messages on the event handler interface.  Options are\n given as a list\\, where each option specifies an event handler category e.g.  'error' represents\n the messages from the WT_EVENT_HANDLER::handle_error method., a list\\, with values chosen from\n the following options: \\c \"error\"\\, \\c \"message\"; default \\c [].}\n @config{live_restore = (, Live restore configuration options.  These options control the behavior\n of WiredTiger when live restoring from a backup., a set of related configuration options defined\n as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, whether live restore is enabled or not., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;path, the path to the backup\n that will be restored from., a string; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;read_size,\n the read size for data migration\\, in bytes\\, must be a power of two.  This setting is a best\n effort.  It does not force every read to be this size., an integer between \\c 512B and \\c 16MB;\n default \\c 1MB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;threads_max, maximum number of threads\n WiredTiger will start to migrate data from the backup to the running WiredTiger database.  Each\n worker thread uses a session handle from the configured session_max., an integer between \\c 0 and\n \\c 12; default \\c 8.}\n @config{ ),,}\n @config{log = (, enable logging.  Enabling logging uses three sessions from the configured\n session_max., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;compressor, configure a compressor for log records.  Permitted\n values are \\c \"none\" or a custom compression engine name created with\n WT_CONNECTION::add_compressor.  If WiredTiger has builtin support for \\c \"lz4\"\\, \\c \"snappy\"\\, \\c\n \"zlib\" or \\c \"zstd\" compression\\, these names are also available.  See @ref compression for more\n information., a string; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, enable logging\n subsystem., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;file_max, the\n maximum size of log files., an integer between \\c 100KB and \\c 2GB; default \\c 100MB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;os_cache_dirty_pct, maximum dirty system buffer cache usage\\, as\n a percentage of the log's \\c file_max.  If non-zero\\, schedule writes for dirty blocks belonging\n to the log in the system buffer cache after that percentage of the log has been written into the\n buffer cache without an intervening file sync., an integer between \\c 0 and \\c 100; default \\c\n 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;path, the name of a directory into which log files are\n written.  The directory must already exist.  If the value is not an absolute path\\, the path is\n relative to the database home (see @ref absolute_path for more information)., a string; default\n \\c \".\".}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prealloc, pre-allocate log files., a boolean flag;\n default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;prealloc_init_count, initial number of\n pre-allocated log files., an integer between \\c 1 and \\c 500; default \\c 1.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;recover, run recovery or fail with an error if recovery needs to\n run after an unclean shutdown., a string\\, chosen from the following options: \\c \"error\"\\, \\c\n \"on\"; default \\c on.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;remove, automatically remove unneeded log\n files., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;zero_fill, manually\n write zeroes into log files., a boolean flag; default \\c false.}\n @config{ ),,}\n @config{mmap, Use memory mapping when accessing files in a read-only mode., a boolean flag;\n default \\c true.}\n @config{mmap_all, Use memory mapping to read and write all data files., a boolean flag; default\n \\c false.}\n @config{multiprocess, permit sharing between processes (will automatically start an RPC server\n for primary processes and use RPC for secondary processes). <b>Not yet supported in\n WiredTiger</b>., a boolean flag; default \\c false.}\n @config{operation_timeout_ms, this option is no longer supported\\, retained for backward\n compatibility., an integer greater than or equal to \\c 0; default \\c 0.}\n @config{operation_tracking = (, enable tracking of performance-critical functions.  See @ref\n operation_tracking for more information., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled, enable operation tracking subsystem., a\n boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;path, the name of a directory\n into which operation tracking files are written.  The directory must already exist.  If the value\n is not an absolute path\\, the path is relative to the database home (see @ref absolute_path for\n more information)., a string; default \\c \".\".}\n @config{ ),,}\n @config{page_delta = (, configure page delta settings for this connection., a set of related\n configuration options defined as follows.}\n @config{ ),,}\n @config{precise_checkpoint, Only write data with timestamps that are smaller or equal to the\n stable timestamp to the checkpoint.  Rollback to stable after restart is a no-op if enabled.\n However\\, it leads to extra cache pressure.  The user must have set the stable timestamp.  It is\n not compatible with use_timestamp=false config., a boolean flag; default \\c false.}\n @config{prefetch = (, Enable automatic detection of scans by applications\\, and attempt to\n pre-fetch future content into the cache., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;available, whether the thread pool for the pre-fetch\n functionality is started\\, this does not mean that pre-fetch is enabled for sessions by default\\,\n see the \\c default setting at the connection level and the \\c prefetch setting at the session\n level., a boolean flag; default \\c true.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;default, whether\n pre-fetch is enabled for all sessions by default., a boolean flag; default \\c false.}\n @config{\n ),,}\n @config{preserve_prepared, open connection in preserve prepare mode.  All the prepared\n transactions that are not yet committed or rolled back will be preserved in the database.  This\n is useful for applications that want to preserve prepared transactions across restarts., a\n boolean flag; default \\c false.}\n @config{readonly, open connection in read-only mode.  The database must exist.  All methods that\n may modify a database are disabled.  See @ref readonly for more information., a boolean flag;\n default \\c false.}\n @config{rollback_to_stable = (, rollback tables to an earlier point in time\\, discarding all\n updates to checkpoint durable tables that have durable times more recent than the current global\n stable timestamp., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;threads, maximum number of threads WiredTiger will start to help\n RTS. Each RTS worker thread uses a session from the configured WT_RTS_MAX_WORKERS., an integer\n between \\c 0 and \\c 10; default \\c 4.}\n @config{ ),,}\n @config{salvage, open connection and salvage any WiredTiger-owned database and log files that it\n detects as corrupted.  This call should only be used after getting an error return of\n WT_TRY_SALVAGE. Salvage rebuilds files in place\\, overwriting existing files.  We recommend\n making a backup copy of all files with the WiredTiger prefix prior to passing this flag., a\n boolean flag; default \\c false.}\n @config{session_max, maximum expected number of sessions (including server threads)., an integer\n greater than or equal to \\c 1; default \\c 100.}\n @config{shared_cache = (, shared cache configuration options.  A database should configure either\n a cache_size or a shared_cache not both.  Enabling a shared cache uses a session from the\n configured session_max.  A shared cache can not have absolute values configured for cache\n eviction settings., a set of related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;chunk, the granularity that a shared cache is redistributed., an\n integer between \\c 1MB and \\c 10TB; default \\c 10MB.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;name, the\n name of a cache that is shared between databases or \\c \"none\" when no shared cache is\n configured., a string; default \\c none.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;quota, maximum size of\n cache this database can be allocated from the shared cache.  Defaults to the entire shared cache\n size., an integer; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;reserve, amount of cache this\n database is guaranteed to have available from the shared cache.  This setting is per database.\n Defaults to the chunk size., an integer; default \\c 0.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;size,\n maximum memory to allocate for the shared cache.  Setting this will update the value if one is\n already set., an integer between \\c 1MB and \\c 10TB; default \\c 500MB.}\n @config{ ),,}\n @config{statistics, Maintain database statistics\\, which may impact performance.  Choosing \"all\"\n maintains all statistics regardless of cost\\, \"fast\" maintains a subset of statistics that are\n relatively inexpensive\\, \"none\" turns off all statistics.  The \"clear\" configuration resets\n statistics after they are gathered\\, where appropriate (for example\\, a cache size statistic is\n not cleared\\, while the count of cursor insert operations will be cleared). When \"clear\" is\n configured for the database\\, gathered statistics are reset each time a statistics cursor is used\n to gather statistics\\, as well as each time statistics are logged using the \\c statistics_log\n configuration.  See @ref statistics for more information., a list\\, with values chosen from the\n following options: \\c \"all\"\\, \\c \"cache_walk\"\\, \\c \"fast\"\\, \\c \"none\"\\, \\c \"clear\"\\, \\c\n \"tree_walk\"; default \\c none.}\n @config{statistics_log = (, log any statistics the database is configured to maintain\\, to a\n file.  See @ref statistics for more information.  Enabling the statistics log server uses a\n session from the configured session_max., a set of related configuration options defined as\n follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;json, encode statistics in JSON format., a boolean\n flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;on_close, log statistics on database\n close., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;path, the name of a\n directory into which statistics files are written.  The directory must already exist.  If the\n value is not an absolute path\\, the path is relative to the database home (see @ref absolute_path\n for more information)., a string; default \\c \".\".}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;sources, if\n non-empty\\, include statistics for the list of \"file:\" data source URIs\\, if they are open at the\n time of the statistics logging., a list of strings; default empty.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;timestamp, a timestamp prepended to each log record.  May contain\n \\c strftime conversion specifications.  When \\c json is configured\\, defaults to \\c\n \"%Y-%m-%dT%H:%M:%S.000Z\"., a string; default \\c \"%b %d %H:%M:%S\".}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;wait, seconds to wait between each write of the log records;\n setting this value above 0 configures statistics logging., an integer between \\c 0 and \\c 100000;\n default \\c 0.}\n @config{ ),,}\n @config{transaction_sync = (, how to sync log records when the transaction commits., a set of\n related configuration options defined as follows.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;enabled,\n whether to sync the log on every commit by default\\, can be overridden by the \\c sync setting to\n WT_SESSION::commit_transaction., a boolean flag; default \\c false.}\n @config{&nbsp;&nbsp;&nbsp;&nbsp;method, the method used to ensure log records are stable on\n disk\\, see @ref tune_durability for more information., a string\\, chosen from the following\n options: \\c \"dsync\"\\, \\c \"fsync\"\\, \\c \"none\"; default \\c fsync.}\n @config{ ),,}\n @config{use_environment, use the \\c WIREDTIGER_CONFIG and \\c WIREDTIGER_HOME environment\n variables if the process is not running with special privileges.  See @ref home for more\n information., a boolean flag; default \\c true.}\n @config{use_environment_priv, use the \\c WIREDTIGER_CONFIG and \\c WIREDTIGER_HOME environment\n variables even if the process is running with special privileges.  See @ref home for more\n information., a boolean flag; default \\c false.}\n @config{verbose, enable messages for various subsystems and operations.  Options are given as a\n list\\, where each message type can optionally define an associated verbosity level\\, such as\n <code>\"verbose=[eviction\\,read:1\\,rts:0]\"</code>. Verbosity levels that can be provided include\n <code>0</code> (INFO) and <code>1</code> through <code>5</code>\\, corresponding to (DEBUG_1) to\n (DEBUG_5). \\c all is a special case that defines the verbosity level for all categories not\n explicitly set in the config string., a list\\, with values chosen from the following options: \\c\n \"all\"\\, \\c \"api\"\\, \\c \"backup\"\\, \\c \"block\"\\, \\c \"block_cache\"\\, \\c \"checkpoint\"\\, \\c\n \"checkpoint_cleanup\"\\, \\c \"checkpoint_progress\"\\, \\c \"chunkcache\"\\, \\c \"compact\"\\, \\c\n \"compact_progress\"\\, \\c \"configuration\"\\, \\c \"disaggregated_storage\"\\, \\c \"error_returns\"\\, \\c\n \"eviction\"\\, \\c \"extension\"\\, \\c \"fileops\"\\, \\c \"generation\"\\, \\c \"handleops\"\\, \\c\n \"history_store\"\\, \\c \"history_store_activity\"\\, \\c \"layered\"\\, \\c \"live_restore\"\\, \\c\n \"live_restore_progress\"\\, \\c \"log\"\\, \\c \"metadata\"\\, \\c \"mutex\"\\, \\c \"out_of_order\"\\, \\c\n \"overflow\"\\, \\c \"page_delta\"\\, \\c \"prefetch\"\\, \\c \"read\"\\, \\c \"reconcile\"\\, \\c \"recovery\"\\, \\c\n \"recovery_progress\"\\, \\c \"rts\"\\, \\c \"salvage\"\\, \\c \"shared_cache\"\\, \\c \"split\"\\, \\c \"sweep\"\\, \\c\n \"temporary\"\\, \\c \"thread_group\"\\, \\c \"tiered\"\\, \\c \"timestamp\"\\, \\c \"transaction\"\\, \\c \"verify\"\\,\n \\c \"version\"\\, \\c \"write\"; default \\c [].}\n @config{verify_metadata, open connection and verify any WiredTiger metadata.  Not supported when\n opening a connection from a backup.  This API allows verification and detection of corruption in\n WiredTiger metadata., a boolean flag; default \\c false.}\n @config{write_through, Use \\c FILE_FLAG_WRITE_THROUGH on Windows to write to files.  Ignored on\n non-Windows systems.  Options are given as a list\\, such as <code>\"write_through=[data]\"</code>.\n Configuring \\c write_through requires care; see @ref write_through Including \\c \"data\" will cause\n WiredTiger data files to write through cache\\, including \\c \"log\" will cause WiredTiger log files\n to write through cache., a list\\, with values chosen from the following options: \\c \"data\"\\, \\c\n \"log\"; default empty.}\n @configend\n Additionally, if files named \\c WiredTiger.config or \\c WiredTiger.basecfg\n appear in the WiredTiger home directory, they are read for configuration\n values (see @ref config_file and @ref config_base for details).\n See @ref config_order for ordering of the configuration mechanisms.\n @param[out] connectionp A pointer to the newly opened connection handle\n @errors"]
    pub fn wiredtiger_open(
        home: *const ::std::os::raw::c_char,
        event_handler: *mut WT_EVENT_HANDLER,
        config: *const ::std::os::raw::c_char,
        connectionp: *mut *mut WT_CONNECTION,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return information about a WiredTiger error as a string (see\n WT_SESSION::strerror for a thread-safe API).\n\n @snippet ex_all.c Display an error\n\n @param error a return value from a WiredTiger, ISO C, or POSIX standard API call\n @returns a string representation of the error"]
    pub fn wiredtiger_strerror(error: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Dump any logged error messages into the provided function, one per line, and clear the error log.\n This works only if this level of diagnostics is enabled. See WT_CONNECTION::dump_error_log for a\n similar function, which dumps the error information to the event handler associated with the\n connection.\n\n @param callback the callback for each line of the error log; use NULL to print to stderr.\n @errors"]
    pub fn wiredtiger_dump_error_log(
        callback: ::std::option::Option<
            unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
#[doc = "< Compact check iteration."]
pub const WT_EVENT_TYPE_WT_EVENT_COMPACT_CHECK: WT_EVENT_TYPE = 0;
#[doc = "< Connection closing."]
pub const WT_EVENT_TYPE_WT_EVENT_CONN_CLOSE: WT_EVENT_TYPE = 1;
#[doc = "< Connection is ready."]
pub const WT_EVENT_TYPE_WT_EVENT_CONN_READY: WT_EVENT_TYPE = 2;
#[doc = "< The user session is about to be involved into eviction.\n   Non-zero return code stops eviction loop."]
pub const WT_EVENT_TYPE_WT_EVENT_EVICTION: WT_EVENT_TYPE = 3;
#[doc = " WT_EVENT_HANDLER::special event types"]
pub type WT_EVENT_TYPE = ::std::os::raw::c_uint;
#[doc = " The interface implemented by applications to handle error, informational and\n progress messages.  Entries set to NULL are ignored and the default handlers\n will continue to be used."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_event_handler {
    #[doc = " Callback to handle error messages; by default, error messages are\n written to the stderr stream. See @ref event_message_handling for\n more information.\n\n Errors that require the application to exit and restart will have\n their \\c error value set to \\c WT_PANIC. The application can exit\n immediately when \\c WT_PANIC is passed to an event handler; there\n is no reason to return into WiredTiger.\n\n Event handler returns are not ignored: if the handler returns\n non-zero, the error may cause the WiredTiger function posting the\n event to fail, and may even cause operation or library failure.\n\n @param session the WiredTiger session handle in use when the error\n was generated. The handle may have been created by the application\n or automatically by WiredTiger.\n @param error a return value from a WiredTiger, ISO C, or\n POSIX standard API call, which can be converted to a string using\n WT_SESSION::strerror\n @param message an error string"]
    pub handle_error: ::std::option::Option<
        unsafe extern "C" fn(
            handler: *mut WT_EVENT_HANDLER,
            session: *mut WT_SESSION,
            error: ::std::os::raw::c_int,
            message: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to handle informational messages; by default, informational\n messages are written to the stdout stream. See\n @ref event_message_handling for more information.\n\n Message handler returns are not ignored: if the handler returns\n non-zero, the error may cause the WiredTiger function posting the\n event to fail, and may even cause operation or library failure.\n\n @param session the WiredTiger session handle in use when the message\n was generated. The handle may have been created by the application\n or automatically by WiredTiger.\n @param message an informational string"]
    pub handle_message: ::std::option::Option<
        unsafe extern "C" fn(
            handler: *mut WT_EVENT_HANDLER,
            session: *mut WT_SESSION,
            message: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to handle progress messages; by default, progress messages\n are not written. See @ref event_message_handling for more\n information.\n\n Progress handler returns are not ignored: if the handler returns\n non-zero, the error may cause the WiredTiger function posting the\n event to fail, and may even cause operation or library failure.\n\n @param session the WiredTiger session handle in use when the\n progress message was generated. The handle may have been created by\n the application or automatically by WiredTiger.\n @param operation a string representation of the operation\n @param progress a counter"]
    pub handle_progress: ::std::option::Option<
        unsafe extern "C" fn(
            handler: *mut WT_EVENT_HANDLER,
            session: *mut WT_SESSION,
            operation: *const ::std::os::raw::c_char,
            progress: u64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to handle automatic close of a WiredTiger handle.\n\n Close handler returns are not ignored: if the handler returns\n non-zero, the error may cause the WiredTiger function posting the\n event to fail, and may even cause operation or library failure.\n\n @param session The session handle that is being closed if the\n cursor parameter is NULL.\n @param cursor The cursor handle that is being closed, or NULL if\n it is a session handle being closed."]
    pub handle_close: ::std::option::Option<
        unsafe extern "C" fn(
            handler: *mut WT_EVENT_HANDLER,
            session: *mut WT_SESSION,
            cursor: *mut WT_CURSOR,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to handle general events. The application may choose to handle\n only some types of events. An unhandled event should return 0.\n\n General event returns are not ignored in most cases. If the handler\n returns non-zero, the error may cause the WiredTiger function posting\n the event to fail.\n\n @param wt_conn The connection handle for the database.\n @param session the WiredTiger session handle in use when the\n progress message was generated. The handle may have been created by\n the application or automatically by WiredTiger or may be NULL.\n @param type A type indicator for what special event occurred.\n @param arg A generic argument that has a specific meaning\n depending on the event type.\n (see ::WT_EVENT_TYPE for available options.)"]
    pub handle_general: ::std::option::Option<
        unsafe extern "C" fn(
            handler: *mut WT_EVENT_HANDLER,
            wt_conn: *mut WT_CONNECTION,
            session: *mut WT_SESSION,
            type_: WT_EVENT_TYPE,
            arg: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_event_handler"][::std::mem::size_of::<__wt_event_handler>() - 40usize];
    ["Alignment of __wt_event_handler"][::std::mem::align_of::<__wt_event_handler>() - 8usize];
    ["Offset of field: __wt_event_handler::handle_error"]
        [::std::mem::offset_of!(__wt_event_handler, handle_error) - 0usize];
    ["Offset of field: __wt_event_handler::handle_message"]
        [::std::mem::offset_of!(__wt_event_handler, handle_message) - 8usize];
    ["Offset of field: __wt_event_handler::handle_progress"]
        [::std::mem::offset_of!(__wt_event_handler, handle_progress) - 16usize];
    ["Offset of field: __wt_event_handler::handle_close"]
        [::std::mem::offset_of!(__wt_event_handler, handle_close) - 24usize];
    ["Offset of field: __wt_event_handler::handle_general"]
        [::std::mem::offset_of!(__wt_event_handler, handle_general) - 32usize];
};
unsafe extern "C" {
    #[doc = " Pack a structure into a buffer.\n\n See @ref packing for a description of the permitted format strings.\n\n @section pack_examples Packing Examples\n\n For example, the string <code>\"iSh\"</code> will pack a 32-bit integer\n followed by a NUL-terminated string, followed by a 16-bit integer.  The\n default, big-endian encoding will be used, with no alignment.  This could be\n used in C as follows:\n\n @snippet ex_all.c Pack fields into a buffer\n\n Then later, the values can be unpacked as follows:\n\n @snippet ex_all.c Unpack fields from a buffer\n\n @param session the session handle\n @param buffer a pointer to a packed byte array\n @param len the number of valid bytes in the buffer\n @param format the data format, see @ref packing\n @errors"]
    pub fn wiredtiger_struct_pack(
        session: *mut WT_SESSION,
        buffer: *mut ::std::os::raw::c_void,
        len: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Calculate the size required to pack a structure.\n\n Note that for variable-sized fields including variable-sized strings and\n integers, the calculated sized merely reflects the expected sizes specified\n in the format string itself.\n\n @snippet ex_all.c Get the packed size\n\n @param session the session handle\n @param lenp a location where the number of bytes needed for the\n matching call to ::wiredtiger_struct_pack is returned\n @param format the data format, see @ref packing\n @errors"]
    pub fn wiredtiger_struct_size(
        session: *mut WT_SESSION,
        lenp: *mut usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Unpack a structure from a buffer.\n\n Reverse of ::wiredtiger_struct_pack: gets values out of a\n packed byte string.\n\n @snippet ex_all.c Unpack fields from a buffer\n\n @param session the session handle\n @param buffer a pointer to a packed byte array\n @param len the number of valid bytes in the buffer\n @param format the data format, see @ref packing\n @errors"]
    pub fn wiredtiger_struct_unpack(
        session: *mut WT_SESSION,
        buffer: *const ::std::os::raw::c_void,
        len: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_pack_stream {
    _unused: [u8; 0],
}
#[doc = " Streaming interface to packing.\n\n This allows applications to pack or unpack records one field at a time.\n This is an opaque handle returned by ::wiredtiger_pack_start or\n ::wiredtiger_unpack_start.  It must be closed with ::wiredtiger_pack_close."]
pub type WT_PACK_STREAM = __wt_pack_stream;
unsafe extern "C" {
    #[doc = " Start a packing operation into a buffer with the given format string.  This\n should be followed by a series of calls to ::wiredtiger_pack_item,\n ::wiredtiger_pack_int, ::wiredtiger_pack_str or ::wiredtiger_pack_uint\n to fill in the values.\n\n @param session the session handle\n @param format the data format, see @ref packing\n @param buffer a pointer to memory to hold the packed data\n @param size the size of the buffer\n @param[out] psp the new packing stream handle\n @errors"]
    pub fn wiredtiger_pack_start(
        session: *mut WT_SESSION,
        format: *const ::std::os::raw::c_char,
        buffer: *mut ::std::os::raw::c_void,
        size: usize,
        psp: *mut *mut WT_PACK_STREAM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Start an unpacking operation from a buffer with the given format string.\n This should be followed by a series of calls to ::wiredtiger_unpack_item,\n ::wiredtiger_unpack_int, ::wiredtiger_unpack_str or ::wiredtiger_unpack_uint\n to retrieve the packed values.\n\n @param session the session handle\n @param format the data format, see @ref packing\n @param buffer a pointer to memory holding the packed data\n @param size the size of the buffer\n @param[out] psp the new packing stream handle\n @errors"]
    pub fn wiredtiger_unpack_start(
        session: *mut WT_SESSION,
        format: *const ::std::os::raw::c_char,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
        psp: *mut *mut WT_PACK_STREAM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Close a packing stream.\n\n @param ps the packing stream handle\n @param[out] usedp the number of bytes in the buffer used by the stream\n @errors"]
    pub fn wiredtiger_pack_close(
        ps: *mut WT_PACK_STREAM,
        usedp: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Pack an item into a packing stream.\n\n @param ps the packing stream handle\n @param item an item to pack\n @errors"]
    pub fn wiredtiger_pack_item(
        ps: *mut WT_PACK_STREAM,
        item: *mut WT_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Pack a signed integer into a packing stream.\n\n @param ps the packing stream handle\n @param i a signed integer to pack\n @errors"]
    pub fn wiredtiger_pack_int(ps: *mut WT_PACK_STREAM, i: i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Pack a string into a packing stream.\n\n @param ps the packing stream handle\n @param s a string to pack\n @errors"]
    pub fn wiredtiger_pack_str(
        ps: *mut WT_PACK_STREAM,
        s: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Pack an unsigned integer into a packing stream.\n\n @param ps the packing stream handle\n @param u an unsigned integer to pack\n @errors"]
    pub fn wiredtiger_pack_uint(ps: *mut WT_PACK_STREAM, u: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Unpack an item from a packing stream.\n\n @param ps the packing stream handle\n @param item an item to unpack\n @errors"]
    pub fn wiredtiger_unpack_item(
        ps: *mut WT_PACK_STREAM,
        item: *mut WT_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Unpack a signed integer from a packing stream.\n\n @param ps the packing stream handle\n @param[out] ip the unpacked signed integer\n @errors"]
    pub fn wiredtiger_unpack_int(ps: *mut WT_PACK_STREAM, ip: *mut i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Unpack a string from a packing stream.\n\n @param ps the packing stream handle\n @param[out] sp the unpacked string\n @errors"]
    pub fn wiredtiger_unpack_str(
        ps: *mut WT_PACK_STREAM,
        sp: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Unpack an unsigned integer from a packing stream.\n\n @param ps the packing stream handle\n @param[out] up the unpacked unsigned integer\n @errors"]
    pub fn wiredtiger_unpack_uint(ps: *mut WT_PACK_STREAM, up: *mut u64) -> ::std::os::raw::c_int;
}
#[doc = " The configuration information returned by the WiredTiger configuration\n parsing functions in the WT_EXTENSION_API and the public API."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_config_item {
    #[doc = " The value of a configuration string.\n\n Regardless of the type of the configuration string (boolean, int,\n list or string), the \\c str field will reference the value of the\n configuration string.\n\n The bytes referenced by \\c str are <b>not</b> nul-terminated.\n Use the \\c len field instead of a terminating nul byte."]
    pub str_: *const ::std::os::raw::c_char,
    #[doc = " The number of bytes in the value referenced by \\c str."]
    pub len: usize,
    #[doc = " The numeric value of a configuration boolean or integer.\n\n If the configuration string's value is \"true\" or \"false\", the\n \\c val field will be set to 1 (true), or 0 (false).\n\n If the configuration string can be legally interpreted as an integer,\n using the \\c strtoll function rules as specified in ISO/IEC 9899:1990\n (\"ISO C90\"), that integer will be stored in the \\c val field."]
    pub val: i64,
    #[doc = " The type of value determined by the parser.  In all cases,\n the \\c str and \\c len fields are set."]
    pub type_: __wt_config_item_WT_CONFIG_ITEM_TYPE,
}
#[doc = " A string value with quotes stripped."]
pub const __wt_config_item_WT_CONFIG_ITEM_TYPE_WT_CONFIG_ITEM_STRING:
    __wt_config_item_WT_CONFIG_ITEM_TYPE = 0;
#[doc = " A boolean literal (\"true\" or \"false\")."]
pub const __wt_config_item_WT_CONFIG_ITEM_TYPE_WT_CONFIG_ITEM_BOOL:
    __wt_config_item_WT_CONFIG_ITEM_TYPE = 1;
#[doc = " An unquoted identifier: a string value without quotes."]
pub const __wt_config_item_WT_CONFIG_ITEM_TYPE_WT_CONFIG_ITEM_ID:
    __wt_config_item_WT_CONFIG_ITEM_TYPE = 2;
#[doc = " A numeric value."]
pub const __wt_config_item_WT_CONFIG_ITEM_TYPE_WT_CONFIG_ITEM_NUM:
    __wt_config_item_WT_CONFIG_ITEM_TYPE = 3;
#[doc = " A nested structure or list, including brackets."]
pub const __wt_config_item_WT_CONFIG_ITEM_TYPE_WT_CONFIG_ITEM_STRUCT:
    __wt_config_item_WT_CONFIG_ITEM_TYPE = 4;
#[doc = " Permitted values of the \\c type field."]
pub type __wt_config_item_WT_CONFIG_ITEM_TYPE = ::std::os::raw::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_config_item"][::std::mem::size_of::<__wt_config_item>() - 32usize];
    ["Alignment of __wt_config_item"][::std::mem::align_of::<__wt_config_item>() - 8usize];
    ["Offset of field: __wt_config_item::str_"]
        [::std::mem::offset_of!(__wt_config_item, str_) - 0usize];
    ["Offset of field: __wt_config_item::len"]
        [::std::mem::offset_of!(__wt_config_item, len) - 8usize];
    ["Offset of field: __wt_config_item::val"]
        [::std::mem::offset_of!(__wt_config_item, val) - 16usize];
    ["Offset of field: __wt_config_item::type_"]
        [::std::mem::offset_of!(__wt_config_item, type_) - 24usize];
};
unsafe extern "C" {
    #[doc = " Create a handle that can be used to parse or create configuration strings\n compatible with the WiredTiger API.\n This call is outside the scope of a WiredTiger connection handle, since\n applications may need to generate configuration strings prior to calling\n ::wiredtiger_open.\n @param session the session handle to be used for error reporting (if NULL,\n  error messages will be written to stderr).\n @param config the configuration string being parsed. The string must\n  remain valid for the lifetime of the parser handle.\n @param len the number of valid bytes in \\c config\n @param[out] config_parserp A pointer to the newly opened handle\n @errors\n\n @snippet ex_config_parse.c Create a configuration parser"]
    pub fn wiredtiger_config_parser_open(
        session: *mut WT_SESSION,
        config: *const ::std::os::raw::c_char,
        len: usize,
        config_parserp: *mut *mut WT_CONFIG_PARSER,
    ) -> ::std::os::raw::c_int;
}
#[doc = " A handle that can be used to search and traverse configuration strings\n compatible with the WiredTiger API.\n To parse the contents of a list or nested configuration string use a new\n configuration parser handle based on the content of the ::WT_CONFIG_ITEM\n retrieved from the parent configuration string.\n\n @section config_parse_examples Configuration String Parsing examples\n\n This could be used in C to create a configuration parser as follows:\n\n @snippet ex_config_parse.c Create a configuration parser\n\n Once the parser has been created the content can be queried directly:\n\n @snippet ex_config_parse.c get\n\n Or the content can be traversed linearly:\n\n @snippet ex_config_parse.c next\n\n Nested configuration values can be queried using a shorthand notation:\n\n @snippet ex_config_parse.c nested get\n\n Nested configuration values can be traversed using multiple\n ::WT_CONFIG_PARSER handles:\n\n @snippet ex_config_parse.c nested traverse"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_config_parser {
    #[doc = " Close the configuration scanner releasing any resources.\n\n @param config_parser the configuration parser handle\n @errors\n"]
    pub close: ::std::option::Option<
        unsafe extern "C" fn(config_parser: *mut WT_CONFIG_PARSER) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the next key/value pair.\n\n If an item has no explicitly assigned value, the item will be\n returned in \\c key and the \\c value will be set to the boolean\n \\c \"true\" value.\n\n @param config_parser the configuration parser handle\n @param key the returned key\n @param value the returned value\n @errors\n When iteration would pass the end of the configuration string\n ::WT_NOTFOUND will be returned."]
    pub next: ::std::option::Option<
        unsafe extern "C" fn(
            config_parser: *mut WT_CONFIG_PARSER,
            key: *mut WT_CONFIG_ITEM,
            value: *mut WT_CONFIG_ITEM,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Return the value of an item in the configuration string.\n\n @param config_parser the configuration parser handle\n @param key configuration key string\n @param value the returned value\n @errors\n"]
    pub get: ::std::option::Option<
        unsafe extern "C" fn(
            config_parser: *mut WT_CONFIG_PARSER,
            key: *const ::std::os::raw::c_char,
            value: *mut WT_CONFIG_ITEM,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_config_parser"][::std::mem::size_of::<__wt_config_parser>() - 24usize];
    ["Alignment of __wt_config_parser"][::std::mem::align_of::<__wt_config_parser>() - 8usize];
    ["Offset of field: __wt_config_parser::close"]
        [::std::mem::offset_of!(__wt_config_parser, close) - 0usize];
    ["Offset of field: __wt_config_parser::next"]
        [::std::mem::offset_of!(__wt_config_parser, next) - 8usize];
    ["Offset of field: __wt_config_parser::get"]
        [::std::mem::offset_of!(__wt_config_parser, get) - 16usize];
};
unsafe extern "C" {
    #[doc = " Return a pointer to a function that calculates a CRC32C checksum.\n\n The WiredTiger library CRC32C checksum function uses hardware support where available, else it\n falls back to a software implementation. Selecting a CRC32C checksum function can be slow, so the\n return value should be cached by the caller for repeated use.\n\n @snippet ex_all.c Checksum a buffer\n\n @returns a pointer to a function that takes a buffer and length and returns the CRC32C checksum"]
    pub fn wiredtiger_crc32c_func() -> ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void, arg2: usize) -> u32,
    >;
}
unsafe extern "C" {
    #[doc = " Return a pointer to a function that calculates a CRC32C checksum given a starting CRC seed.\n\n The WiredTiger library CRC32C checksum function uses hardware support where available, else it\n falls back to a software implementation. Selecting a CRC32C checksum function can be slow, so the\n return value should be cached by the caller for repeated use. This version returns a function\n that accepts a starting seed value for the CRC. This version is useful where an application wants\n to calculate the CRC of a large buffer in smaller incremental pieces. The starting seed to\n calculate the CRC of a piece is then the cumulative CRC of all the previous pieces.\n\n @snippet ex_all.c Checksum a large buffer in smaller pieces\n\n @returns a pointer to a function that takes a starting seed, a buffer and length and returns the\n CRC32C checksum"]
    pub fn wiredtiger_crc32c_with_seed_func() -> ::std::option::Option<
        unsafe extern "C" fn(arg1: u32, arg2: *const ::std::os::raw::c_void, arg3: usize) -> u32,
    >;
}
unsafe extern "C" {
    #[doc = " Calculate a set of WT_MODIFY operations to represent an update.\n This call will calculate a set of modifications to an old value that produce\n the new value.  If more modifications are required than fit in the array\n passed in by the caller, or if more bytes have changed than the \\c maxdiff\n parameter, the call will fail.  The matching algorithm is approximate, so it\n may fail and return WT_NOTFOUND if a matching set of WT_MODIFY operations\n is not found.\n\n The \\c maxdiff parameter bounds how much work will be done searching for a\n match: to ensure a match is found, it may need to be set larger than actual\n number of bytes that differ between the old and new values.  In particular,\n repeated patterns of bytes in the values can lead to suboptimal matching,\n and matching ranges less than 64 bytes long will not be detected.\n\n If the call succeeds, the WT_MODIFY operations will point into \\c newv,\n which must remain valid until WT_CURSOR::modify is called.\n\n @snippet ex_all.c Calculate a modify operation\n\n @param session the current WiredTiger session (may be NULL)\n @param oldv old value\n @param newv new value\n @param maxdiff maximum bytes difference\n @param[out] entries array of modifications producing the new value\n @param[in,out] nentriesp size of \\c entries array passed in,\n  set to the number of entries used\n @errors"]
    pub fn wiredtiger_calc_modify(
        session: *mut WT_SESSION,
        oldv: *const WT_ITEM,
        newv: *const WT_ITEM,
        maxdiff: usize,
        entries: *mut WT_MODIFY,
        nentriesp: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get version information.\n\n @snippet ex_all.c Get the WiredTiger library version #1\n @snippet ex_all.c Get the WiredTiger library version #2\n\n @param majorp a location where the major version number is returned\n @param minorp a location where the minor version number is returned\n @param patchp a location where the patch version number is returned\n @returns a string representation of the version"]
    pub fn wiredtiger_version(
        majorp: *mut ::std::os::raw::c_int,
        minorp: *mut ::std::os::raw::c_int,
        patchp: *mut ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
#[doc = " Forward structure declarations for the extension API"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_config_arg {
    _unused: [u8; 0],
}
pub type WT_CONFIG_ARG = __wt_config_arg;
#[doc = " Public forward structure declarations"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_collator {
    #[doc = " Callback to compare keys.\n\n @param[out] cmp set to -1 if <code>key1 < key2</code>,\n  0 if <code>key1 == key2</code>,\n  1 if <code>key1 > key2</code>.\n @returns zero for success, non-zero to indicate an error.\n\n @snippet ex_all.c Implement WT_COLLATOR\n\n @snippet ex_extending.c case insensitive comparator\n\n @snippet ex_extending.c n character comparator"]
    pub compare: ::std::option::Option<
        unsafe extern "C" fn(
            collator: *mut WT_COLLATOR,
            session: *mut WT_SESSION,
            key1: *const WT_ITEM,
            key2: *const WT_ITEM,
            cmp: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " If non-NULL, this callback is called to customize the collator\n for each data source.  If the callback returns a non-NULL\n collator, that instance is used instead of this one for all\n comparisons."]
    pub customize: ::std::option::Option<
        unsafe extern "C" fn(
            collator: *mut WT_COLLATOR,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            passcfg: *mut WT_CONFIG_ITEM,
            customp: *mut *mut WT_COLLATOR,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " If non-NULL a callback performed when the data source is closed\n for customized collators otherwise when the database is closed.\n\n The WT_COLLATOR::terminate callback is intended to allow cleanup;\n the handle will not be subsequently accessed by WiredTiger."]
    pub terminate: ::std::option::Option<
        unsafe extern "C" fn(
            collator: *mut WT_COLLATOR,
            session: *mut WT_SESSION,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_collator"][::std::mem::size_of::<__wt_collator>() - 24usize];
    ["Alignment of __wt_collator"][::std::mem::align_of::<__wt_collator>() - 8usize];
    ["Offset of field: __wt_collator::compare"]
        [::std::mem::offset_of!(__wt_collator, compare) - 0usize];
    ["Offset of field: __wt_collator::customize"]
        [::std::mem::offset_of!(__wt_collator, customize) - 8usize];
    ["Offset of field: __wt_collator::terminate"]
        [::std::mem::offset_of!(__wt_collator, terminate) - 16usize];
};
#[doc = " The interface implemented by applications to provide custom compression.\n\n Compressors must implement the WT_COMPRESSOR interface: the\n WT_COMPRESSOR::compress and WT_COMPRESSOR::decompress callbacks must be\n specified, and WT_COMPRESSOR::pre_size is optional.  To build your own\n compressor, use one of the compressors in \\c ext/compressors as a template:\n \\c ext/nop_compress is a simple compressor that passes through data\n unchanged, and is a reasonable starting point.\n\n Applications register their implementation with WiredTiger by calling\n WT_CONNECTION::add_compressor.\n\n @snippet nop_compress.c WT_COMPRESSOR initialization structure\n @snippet nop_compress.c WT_COMPRESSOR initialization function"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_compressor {
    #[doc = " Callback to compress a chunk of data.\n\n WT_COMPRESSOR::compress takes a source buffer and a destination\n buffer, by default of the same size.  If the callback can compress\n the buffer to a smaller size in the destination, it does so, sets\n the \\c compression_failed return to 0 and returns 0.  If compression\n does not produce a smaller result, the callback sets the\n \\c compression_failed return to 1 and returns 0. If another\n error occurs, it returns an errno or WiredTiger error code.\n\n On entry, \\c src will point to memory, with the length of the memory\n in \\c src_len.  After successful completion, the callback should\n return \\c 0 and set \\c result_lenp to the number of bytes required\n for the compressed representation.\n\n On entry, \\c dst points to the destination buffer with a length\n of \\c dst_len.  If the WT_COMPRESSOR::pre_size method is specified,\n the destination buffer will be at least the size returned by that\n method; otherwise, the destination buffer will be at least as large\n as the length of the data to compress.\n\n If compression would not shrink the data or the \\c dst buffer is not\n large enough to hold the compressed data, the callback should set\n \\c compression_failed to a non-zero value and return 0.\n\n @param[in] src the data to compress\n @param[in] src_len the length of the data to compress\n @param[in] dst the destination buffer\n @param[in] dst_len the length of the destination buffer\n @param[out] result_lenp the length of the compressed data\n @param[out] compression_failed non-zero if compression did not\n decrease the length of the data (compression may not have completed)\n @returns zero for success, non-zero to indicate an error.\n\n @snippet nop_compress.c WT_COMPRESSOR compress"]
    pub compress: ::std::option::Option<
        unsafe extern "C" fn(
            compressor: *mut WT_COMPRESSOR,
            session: *mut WT_SESSION,
            src: *mut u8,
            src_len: usize,
            dst: *mut u8,
            dst_len: usize,
            result_lenp: *mut usize,
            compression_failed: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to decompress a chunk of data.\n\n WT_COMPRESSOR::decompress takes a source buffer and a destination\n buffer.  The contents are switched from \\c compress: the\n source buffer is the compressed value, and the destination buffer is\n sized to be the original size.  If the callback successfully\n decompresses the source buffer to the destination buffer, it returns\n 0.  If an error occurs, it returns an errno or WiredTiger error code.\n The source buffer that WT_COMPRESSOR::decompress takes may have a\n size that is rounded up from the size originally produced by\n WT_COMPRESSOR::compress, with the remainder of the buffer set to\n zeroes. Most compressors do not care about this difference if the\n size to be decompressed can be implicitly discovered from the\n compressed data.  If your compressor cares, you may need to allocate\n space for, and store, the actual size in the compressed buffer.  See\n the source code for the included snappy compressor for an example.\n\n On entry, \\c src will point to memory, with the length of the memory\n in \\c src_len.  After successful completion, the callback should\n return \\c 0 and set \\c result_lenp to the number of bytes required\n for the decompressed representation.\n\n If the \\c dst buffer is not big enough to hold the decompressed\n data, the callback should return an error.\n\n @param[in] src the data to decompress\n @param[in] src_len the length of the data to decompress\n @param[in] dst the destination buffer\n @param[in] dst_len the length of the destination buffer\n @param[out] result_lenp the length of the decompressed data\n @returns zero for success, non-zero to indicate an error.\n\n @snippet nop_compress.c WT_COMPRESSOR decompress"]
    pub decompress: ::std::option::Option<
        unsafe extern "C" fn(
            compressor: *mut WT_COMPRESSOR,
            session: *mut WT_SESSION,
            src: *mut u8,
            src_len: usize,
            dst: *mut u8,
            dst_len: usize,
            result_lenp: *mut usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to size a destination buffer for compression\n\n WT_COMPRESSOR::pre_size is an optional callback that, given the\n source buffer and size, produces the size of the destination buffer\n to be given to WT_COMPRESSOR::compress.  This is useful for\n compressors that assume that the output buffer is sized for the\n worst case and thus no overrun checks are made.  If your compressor\n works like this, WT_COMPRESSOR::pre_size will need to be defined.\n See the source code for the snappy compressor for an example.\n However, if your compressor detects and avoids overruns against its\n target buffer, you will not need to define WT_COMPRESSOR::pre_size.\n When WT_COMPRESSOR::pre_size is set to NULL, the destination buffer\n is sized the same as the source buffer.  This is always sufficient,\n since a compression result that is larger than the source buffer is\n discarded by WiredTiger.\n\n If not NULL, this callback is called before each call to\n WT_COMPRESSOR::compress to determine the size of the destination\n buffer to provide.  If the callback is NULL, the destination\n buffer will be the same size as the source buffer.\n\n The callback should set \\c result_lenp to a suitable buffer size\n for compression, typically the maximum length required by\n WT_COMPRESSOR::compress.\n\n This callback function is for compressors that require an output\n buffer larger than the source buffer (for example, that do not\n check for buffer overflow during compression).\n\n @param[in] src the data to compress\n @param[in] src_len the length of the data to compress\n @param[out] result_lenp the required destination buffer size\n @returns zero for success, non-zero to indicate an error.\n\n @snippet nop_compress.c WT_COMPRESSOR presize"]
    pub pre_size: ::std::option::Option<
        unsafe extern "C" fn(
            compressor: *mut WT_COMPRESSOR,
            session: *mut WT_SESSION,
            src: *mut u8,
            src_len: usize,
            result_lenp: *mut usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " If non-NULL, a callback performed when the database is closed.\n\n The WT_COMPRESSOR::terminate callback is intended to allow cleanup;\n the handle will not be subsequently accessed by WiredTiger.\n\n @snippet nop_compress.c WT_COMPRESSOR terminate"]
    pub terminate: ::std::option::Option<
        unsafe extern "C" fn(
            compressor: *mut WT_COMPRESSOR,
            session: *mut WT_SESSION,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __wt_compressor"][::std::mem::size_of::<__wt_compressor>() - 32usize];
    ["Alignment of __wt_compressor"][::std::mem::align_of::<__wt_compressor>() - 8usize];
    ["Offset of field: __wt_compressor::compress"]
        [::std::mem::offset_of!(__wt_compressor, compress) - 0usize];
    ["Offset of field: __wt_compressor::decompress"]
        [::std::mem::offset_of!(__wt_compressor, decompress) - 8usize];
    ["Offset of field: __wt_compressor::pre_size"]
        [::std::mem::offset_of!(__wt_compressor, pre_size) - 16usize];
    ["Offset of field: __wt_compressor::terminate"]
        [::std::mem::offset_of!(__wt_compressor, terminate) - 24usize];
};
#[doc = " Applications can extend WiredTiger by providing new implementations of the\n WT_DATA_SOURCE class.  Each data source supports a different URI scheme for\n data sources to WT_SESSION::create, WT_SESSION::open_cursor and related\n methods.  See @ref custom_data_sources for more information.\n\n <b>Thread safety:</b> WiredTiger may invoke methods on the WT_DATA_SOURCE\n interface from multiple threads concurrently.  It is the responsibility of\n the implementation to protect any shared data.\n\n Applications register their implementation with WiredTiger by calling\n WT_CONNECTION::add_data_source.\n\n @snippet ex_data_source.c WT_DATA_SOURCE register"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wt_data_source {
    #[doc = " Callback to alter an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE alter"]
    pub alter: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to create a new object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE create"]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to compact an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE compact"]
    pub compact: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to drop an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE drop"]
    pub drop: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to initialize a cursor.\n\n @snippet ex_data_source.c WT_DATA_SOURCE open_cursor"]
    pub open_cursor: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
            new_cursor: *mut *mut WT_CURSOR,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to rename an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE rename"]
    pub rename: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            newuri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to salvage an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE salvage"]
    pub salvage: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            config: *mut WT_CONFIG_ARG,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to get the size of an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE size"]
    pub size: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
            uri: *const ::std::os::raw::c_char,
            size: *mut wt_off_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " Callback to truncate an object.\n\n @snippet ex_data_source.c WT_DATA_SOURCE truncate"]
    pub truncate: ::std::option::Option<
        unsafe extern "C" fn(
            dsrc: *mut WT_DATA_SOURCE,
            session: *mut WT_SESSION,
